// Class /Script/Game.AbilityAttributeAgent
// Size: 0x0 (Inherited: 0x0)
struct UAbilityAttributeAgent : UActorComponent {
	struct TArray<struct FPostProcessRule> PostProcessRules; // 0x0(0x0)
	char pad_C0[0x40]; // 0x0(0x0)

	void SetActorVectorParameterValueOnMaterials(struct AActor* Actor, struct FName ParameterName, struct FVector ParameterValue); // Function /Script/Game.AbilityAttributeAgent.SetActorVectorParameterValueOnMaterials // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	void SetActorScalarParameterValueOnMaterials(struct AActor* Actor, struct FName ParameterName, float ParameterValue); // Function /Script/Game.AbilityAttributeAgent.SetActorScalarParameterValueOnMaterials // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool K2_CheckPostProcess(struct FPostProcessRule& PostProcessRule); // Function /Script/Game.AbilityAttributeAgent.K2_CheckPostProcess // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	bool CheckPostProcessFlag(enum class EPostProcessType PostProcessType); // Function /Script/Game.AbilityAttributeAgent.CheckPostProcessFlag // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void AttributeTick(enum class EAttributeAgentType Type, float DeltaTime, struct UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, __int32 Index); // Function /Script/Game.AbilityAttributeAgent.AttributeTick // (Event|Public|BlueprintEvent) // @ game+0
	void AttributeLeaveFull(enum class EAttributeAgentType Type, struct UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, __int32 Index); // Function /Script/Game.AbilityAttributeAgent.AttributeLeaveFull // (Event|Public|BlueprintEvent) // @ game+0
	__int32 AttributeLeaveEmpty(enum class EAttributeAgentType Type, struct UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy); // Function /Script/Game.AbilityAttributeAgent.AttributeLeaveEmpty // (Event|Public|BlueprintEvent) // @ game+0
	__int32 AttributeInit(enum class EAttributeAgentType Type, struct UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy); // Function /Script/Game.AbilityAttributeAgent.AttributeInit // (Event|Public|BlueprintEvent) // @ game+0
	void AttributeFull(enum class EAttributeAgentType Type, struct UAbilityComponentBase* Ability, float CurrentEnergy, float MaxEnergy, __int32 Index); // Function /Script/Game.AbilityAttributeAgent.AttributeFull // (Event|Public|BlueprintEvent) // @ game+0
	void AttributeEmpty(enum class EAttributeAgentType Type, struct UAbilityComponentBase* Ability, __int32 Index); // Function /Script/Game.AbilityAttributeAgent.AttributeEmpty // (Event|Public|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.GameAbilityBuffer
// Size: 0x0 (Inherited: 0x0)
struct UGameAbilityBuffer : UObject {
	char pad_28[0x10]; // 0x0(0x0)
	__int32 BufferId; // 0x0(0x0)
	__int32 Priority; // 0x0(0x0)
	float AliveTime; // 0x0(0x0)
	__int32 MaxStacks; // 0x0(0x0)
	char bAllowMultistack : 1; // 0x0(0x0)
	char pad_48_1 : 7; // 0x0(0x0)
	char pad_49[0x7]; // 0x0(0x0)
	__int64 ActiveAbilityState; // 0x0(0x0)
	__int64 DisableAbilityState; // 0x0(0x0)
	char bAllowAutoRemoved : 1; // 0x0(0x0)
	char pad_60_1 : 7; // 0x0(0x0)
	char pad_61[0x7]; // 0x0(0x0)
	struct UAbilityComponentBase* AbilityCauser; // 0x0(0x0)
	struct UAbilityComponentBase* AbilityOwner; // 0x0(0x0)
	char bIsAllowTick : 1; // 0x0(0x0)
	char pad_78_1 : 7; // 0x0(0x0)
	char pad_79[0x3]; // 0x0(0x0)
	__int32 nLevel; // 0x0(0x0)
	__int32 SkillOwnerID; // 0x0(0x0)
	__int32 SkillRunTimeID; // 0x0(0x0)
	struct FBoneResult PartResult; // 0x0(0x0)
	struct FBoneResult PartitionResult; // 0x0(0x0)
	struct TWeakObjectPtr<struct UModifier> ModifierOwner; // 0x0(0x0)

	void SetSkillRunTimeID(__int32 InRunTimeID); // Function /Script/Game.GameAbilityBuffer.SetSkillRunTimeID // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetSkillOwnerID(__int32 InOwnerID); // Function /Script/Game.GameAbilityBuffer.SetSkillOwnerID // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetLevel(__int32 InLevel); // Function /Script/Game.GameAbilityBuffer.SetLevel // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveModifierOwner(); // Function /Script/Game.GameAbilityBuffer.RemoveModifierOwner // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnInstigatorDestroyed(); // Function /Script/Game.GameAbilityBuffer.OnInstigatorDestroyed // (Final|Native|Private) // @ game+0
	void K2_ReceiveTick(float DeltaSeconds, struct UGameAbilityComponent* Pawn); // Function /Script/Game.GameAbilityBuffer.K2_ReceiveTick // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_ReceiveInitialize(struct TArray<struct FParamInfo>& Info, struct UGameAbilityComponent* lpInstigator); // Function /Script/Game.GameAbilityBuffer.K2_ReceiveInitialize // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_ReceiveDeActive(struct UGameAbilityComponent* Pawn); // Function /Script/Game.GameAbilityBuffer.K2_ReceiveDeActive // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_ReceiveActive(struct UObject* Instigator); // Function /Script/Game.GameAbilityBuffer.K2_ReceiveActive // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0
	__int32 K2_GetPriority(); // Function /Script/Game.GameAbilityBuffer.K2_GetPriority // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	__int32 K2_GetMaxStacks(); // Function /Script/Game.GameAbilityBuffer.K2_GetMaxStacks // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	float K2_GetAliveTime(); // Function /Script/Game.GameAbilityBuffer.K2_GetAliveTime // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	bool IsControlByModifier(); // Function /Script/Game.GameAbilityBuffer.IsControlByModifier // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0
	void GetUsedModifierID(struct TArray<__int32>& OutModifierID); // Function /Script/Game.GameAbilityBuffer.GetUsedModifierID // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0
	__int32 GetSkillRunTimeID(); // Function /Script/Game.GameAbilityBuffer.GetSkillRunTimeID // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetSkillOwnerID(); // Function /Script/Game.GameAbilityBuffer.GetSkillOwnerID // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FVector GetOwnerModifierApplyLoc(); // Function /Script/Game.GameAbilityBuffer.GetOwnerModifierApplyLoc // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct UModifier* GetModifierOwner(); // Function /Script/Game.GameAbilityBuffer.GetModifierOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetModifierID(); // Function /Script/Game.GameAbilityBuffer.GetModifierID // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetLevel(); // Function /Script/Game.GameAbilityBuffer.GetLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct USkillEmitter* GetEmitterOwner(); // Function /Script/Game.GameAbilityBuffer.GetEmitterOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetCurrentStack(); // Function /Script/Game.GameAbilityBuffer.GetCurrentStack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void GetBufferUsedModifierID(struct FString InPath, struct TArray<__int32>& OutModifierID); // Function /Script/Game.GameAbilityBuffer.GetBufferUsedModifierID // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	float GetAttributeValue(struct UAbilityAttribute* AbilityAttribute); // Function /Script/Game.GameAbilityBuffer.GetAttributeValue // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	float GetAttributeMaxValue(struct UAbilityAttribute* AbilityAttribute); // Function /Script/Game.GameAbilityBuffer.GetAttributeMaxValue // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct AActor* GetAbilityOwnerActor(); // Function /Script/Game.GameAbilityBuffer.GetAbilityOwnerActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.AbilityBufferAttribute
// Size: 0x0 (Inherited: 0x0)
struct UAbilityBufferAttribute : UGameAbilityBuffer {
	struct TArray<struct FAbilityBufferAttributeRuleLoop> AbilityBufferAttributeSet; // 0x0(0x0)
};

 // Class /Script/Game.ApplyAbilityAttribute
// Size: 0x0 (Inherited: 0x0)
struct UApplyAbilityAttribute : UGameAbilityBuffer {
	struct TArray<struct FAbilityBufferAttributeRule> AbilityBufferAttributeSet; // 0x0(0x0)
};

 // Class /Script/Game.TemporaryAbilityAttribute
// Size: 0x0 (Inherited: 0x0)
struct UTemporaryAbilityAttribute : UApplyAbilityAttribute {
};

 // Class /Script/Game.CustomAbilityAttribute
// Size: 0x0 (Inherited: 0x0)
struct UCustomAbilityAttribute : UGameAbilityBuffer {

	void SetValueToAttribute(struct UAbilityAttribute* AbilityAttribute, float Value); // Function /Script/Game.CustomAbilityAttribute.SetValueToAttribute // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct AActor* GetLauncherActor(); // Function /Script/Game.CustomAbilityAttribute.GetLauncherActor // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	float AddValueToAttribute(struct UAbilityAttribute* AbilityAttribute, float Value); // Function /Script/Game.CustomAbilityAttribute.AddValueToAttribute // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AddBufferAliveTime(float Value); // Function /Script/Game.CustomAbilityAttribute.AddBufferAliveTime // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.NoModifyAbilityAttribute
// Size: 0x0 (Inherited: 0x0)
struct UNoModifyAbilityAttribute : UGameAbilityBuffer {
	enum class EAttributeType AttributeType; // 0x0(0x0)
	bool NoAdd; // 0x0(0x0)
	bool NoReduce; // 0x0(0x0)
	char pad_D3[0x5]; // 0x0(0x0)
};

 // Class /Script/Game.CustomGameAbilityBuffer
// Size: 0x0 (Inherited: 0x0)
struct UCustomGameAbilityBuffer : UGameAbilityBuffer {
	bool bCustomPaused; // 0x0(0x0)
	char pad_D1[0x7]; // 0x0(0x0)

	float SetValueToTargetAttribute(struct UGameAbilityComponent* GameAbility, struct UAbilityAttribute* AbilityAttribute, float Value); // Function /Script/Game.CustomGameAbilityBuffer.SetValueToTargetAttribute // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct AActor* GetLauncherActor(); // Function /Script/Game.CustomGameAbilityBuffer.GetLauncherActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void DeActiveSelf(); // Function /Script/Game.CustomGameAbilityBuffer.DeActiveSelf // (Final|Native|Public|BlueprintCallable) // @ game+0
	float AddValueToTargetAttribute(struct UGameAbilityComponent* GameAbility, struct UAbilityAttribute* AbilityAttribute, float Value); // Function /Script/Game.CustomGameAbilityBuffer.AddValueToTargetAttribute // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct UGameAbilityBuffer* ActiveBufferToTarget(struct UGameAbilityBuffer*& nGameAbilityBufferClass, struct UGameAbilityComponent* TargetAbility, struct TArray<struct FParamInfo>& Info, struct UObject* Outer); // Function /Script/Game.CustomGameAbilityBuffer.ActiveBufferToTarget // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.ClampAbilityAttribute
// Size: 0x0 (Inherited: 0x0)
struct UClampAbilityAttribute : UCustomGameAbilityBuffer {
	enum class EAttributeType AttributeType; // 0x0(0x0)
	char pad_D9[0x7]; // 0x0(0x0)
	struct UAbilityAttribute* AttributeAsset; // 0x0(0x0)
	struct FVector2D AttributeClamp; // 0x0(0x0)

	bool InitAbilityAttribute(enum class EAttributeType InAttributeType, struct FString AttributeString); // Function /Script/Game.ClampAbilityAttribute.InitAbilityAttribute // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.CustomEffectActor
// Size: 0x0 (Inherited: 0x0)
struct ACustomEffectActor : AActor {
	char pad_220[0x8]; // 0x0(0x0)
	char Attached : 1; // 0x0(0x0)
	char pad_228_1 : 7; // 0x0(0x0)
	char pad_229[0x3]; // 0x0(0x0)
	struct FName SocketName; // 0x0(0x0)
	char bAutoDestroyed : 1; // 0x0(0x0)
	char pad_234_1 : 7; // 0x0(0x0)
	char pad_235[0x3]; // 0x0(0x0)
	struct FVector OriginLocation; // 0x0(0x0)
	struct FVector ApplyLocation; // 0x0(0x0)
	struct AActor* Launcher; // 0x0(0x0)
	struct AActor* Target; // 0x0(0x0)
	struct FBoneResult BoneResult; // 0x0(0x0)
	struct FBoneResult PartResult; // 0x0(0x0)
	struct FBoneResult PartitionResult; // 0x0(0x0)
	__int32 OwnerModifierID; // 0x0(0x0)
	__int32 ModifierOverlaidNum; // 0x0(0x0)
	__int32 ModifierLevel; // 0x0(0x0)
	__int32 ModifierRunTimeID; // 0x0(0x0)
	struct TArray<struct FQueryResult> EmitterQueryResults; // 0x0(0x0)

	void SetScalarParameterValueOnMaterials(struct AActor* Actor, struct FName ParameterName, float ParameterValue, __int32 MatIndex); // Function /Script/Game.CustomEffectActor.SetScalarParameterValueOnMaterials // (Final|Native|Protected|BlueprintCallable) // @ game+0
	void OnOwnerModifierOverlaidChange(__int32 ModifierID, __int32 NewOverlaidNum); // Function /Script/Game.CustomEffectActor.OnOwnerModifierOverlaidChange // (Final|Native|Public) // @ game+0
	void LookCamera(); // Function /Script/Game.CustomEffectActor.LookCamera // (Final|Native|Protected|BlueprintCallable) // @ game+0
	void K2_ReceiveTick(float DeltaSeconds); // Function /Script/Game.CustomEffectActor.K2_ReceiveTick // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_ReceiveDeActive(); // Function /Script/Game.CustomEffectActor.K2_ReceiveDeActive // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_ReceiveActive(); // Function /Script/Game.CustomEffectActor.K2_ReceiveActive // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_OnOwnerModifierOverlaidChange(__int32 PreModifierOverliadNum, __int32 CurModifierOverlaidNum); // Function /Script/Game.CustomEffectActor.K2_OnOwnerModifierOverlaidChange // (Event|Protected|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.AbilityBufferCustomEffect
// Size: 0x0 (Inherited: 0x0)
struct UAbilityBufferCustomEffect : UGameAbilityBuffer {
	struct TArray<struct ACustomEffectActor*> CustomEffectActorClasses; // 0x0(0x0)
	struct TArray<struct ACustomEffectActor*> CustomEffectActors; // 0x0(0x0)
};

 // Class /Script/Game.AbilityBufferRandomSettings
// Size: 0x0 (Inherited: 0x0)
struct UAbilityBufferRandomSettings : UGameInstanceSubsystem {
	char pad_30[0x20]; // 0x0(0x0)
	struct TArray<struct FAbilityBufferPrice> AbilityBufferPrices; // 0x0(0x0)
	char pad_60[0x10]; // 0x0(0x0)
	struct TArray<struct FAbilityBufferShop> AbilityBufferShopes; // 0x0(0x0)
	struct TArray<struct FAbilityBufferRandomSetting> AbilityBufferRandomSettings; // 0x0(0x0)
	char pad_90[0x50]; // 0x0(0x0)

	void OnAsyncLoadAbilityBlueprint(struct TArray<struct FSoftObjectPath> LoadedPaths, struct TArray<__int32> BufferIds); // Function /Script/Game.AbilityBufferRandomSettings.OnAsyncLoadAbilityBlueprint // (Final|Native|Public) // @ game+0
};

 // Class /Script/Game.AbilityBufferSkill
// Size: 0x0 (Inherited: 0x0)
struct UAbilityBufferSkill : UGameAbilityBuffer {
	struct TArray<__int32> BufferSkilles; // 0x0(0x0)
	__int32 CurrentSkillId; // 0x0(0x0)
	char pad_E4[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AbilityBufferSummon
// Size: 0x0 (Inherited: 0x0)
struct UAbilityBufferSummon : UGameAbilityBuffer {
	struct TArray<struct AActor*> SummonActors; // 0x0(0x0)
};

 // Class /Script/Game.AbilityBufferGroupSummon
// Size: 0x0 (Inherited: 0x0)
struct UAbilityBufferGroupSummon : UAbilityBufferSummon {
	struct TArray<struct FSummonSetting> SummonActorClasses; // 0x0(0x0)
};

 // Class /Script/Game.AbilityBufferStackSummon
// Size: 0x0 (Inherited: 0x0)
struct UAbilityBufferStackSummon : UAbilityBufferSummon {
	struct TArray<struct FStackSummonSetting> SummonActorClasses; // 0x0(0x0)
};

 // Class /Script/Game.AbilityCollision_Sphere
// Size: 0x0 (Inherited: 0x0)
struct UAbilityCollision_Sphere : USphereComponent {
	char pad_470[0x8]; // 0x0(0x0)
	enum class ECollisionPurposeType CollisionPurposeType; // 0x0(0x0)
	char pad_479[0x3]; // 0x0(0x0)
	float ValidAngle; // 0x0(0x0)
	struct UCurveFloat* InnerRadiusCurve; // 0x0(0x0)
	struct UCurveFloat* RadiusCurve; // 0x0(0x0)
	struct UCurveVector* RotatorCurve; // 0x0(0x0)
	struct UCurveVector* OffsetCurve; // 0x0(0x0)
	bool bApplyEffect; // 0x0(0x0)
	char pad_4A1[0x7]; // 0x0(0x0)
	struct TArray<__int32> EffectEmitterIDs; // 0x0(0x0)
	struct TArray<struct FCastEmitterCondition> ConditionEmitterID; // 0x0(0x0)
	bool bUseGroup; // 0x0(0x0)
	char pad_4C9[0x3]; // 0x0(0x0)
	__int32 CollisionQueryTimes; // 0x0(0x0)
	float ActiveTime; // 0x0(0x0)
	char pad_4D4[0xD4]; // 0x0(0x0)
	struct TMap<struct FEmitterEffectApplyData, struct FEmitterEffectSaveData> LastEffectTimeMap; // 0x0(0x0)
	struct TMap<unsigned __int32, struct UCastConditionCheck*> CollisionCheckCondition; // 0x0(0x0)
	char pad_648[0x8]; // 0x0(0x0)
	struct UParticleSystemComponent* ParticleComp; // 0x0(0x0)
	struct USceneComponent* OldUpdateComp; // 0x0(0x0)
	struct TWeakObjectPtr<struct AGameSkill> CurGameSkill; // 0x0(0x0)
	char pad_668[0x8]; // 0x0(0x0)

	void TickFreshSphere(float DeltaTime); // Function /Script/Game.AbilityCollision_Sphere.TickFreshSphere // (Final|Native|Public) // @ game+0
	void OnOuterMoveCollisionOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Sphere.OnOuterMoveCollisionOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnEffectBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Sphere.OnEffectBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnAbilityCollisionEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex); // Function /Script/Game.AbilityCollision_Sphere.OnAbilityCollisionEndOverlap // (Final|Native|Public) // @ game+0
	void OnAbilityCollisionBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Sphere.OnAbilityCollisionBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnAbilityCollisionActivated(struct UActorComponent* Component, bool bReset); // Function /Script/Game.AbilityCollision_Sphere.OnAbilityCollisionActivated // (Final|Native|Public) // @ game+0
	void DisableAbilityCollision(); // Function /Script/Game.AbilityCollision_Sphere.DisableAbilityCollision // (Final|Native|Public) // @ game+0
};

 // Class /Script/Game.AbilityCollision_Capsual
// Size: 0x0 (Inherited: 0x0)
struct UAbilityCollision_Capsual : UCapsuleComponent {
	char pad_470[0x8]; // 0x0(0x0)
	enum class ECollisionPurposeType CollisionPurposeType; // 0x0(0x0)
	char pad_479[0x7]; // 0x0(0x0)
	struct UCurveFloat* CapsuleRadiusCurve; // 0x0(0x0)
	struct UCurveFloat* CapsuleHalfHeightCurve; // 0x0(0x0)
	struct UCurveVector* RotatorCurve; // 0x0(0x0)
	struct UCurveVector* OffsetCurve; // 0x0(0x0)
	bool HalfHeightForward; // 0x0(0x0)
	bool bApplyEffect; // 0x0(0x0)
	char pad_4A2[0x6]; // 0x0(0x0)
	struct TArray<__int32> EffectEmitterIDs; // 0x0(0x0)
	struct TArray<struct FCastEmitterCondition> ConditionEmitterID; // 0x0(0x0)
	bool bUseGroup; // 0x0(0x0)
	char pad_4C9[0x3]; // 0x0(0x0)
	__int32 CollisionQueryTimes; // 0x0(0x0)
	float ActiveTime; // 0x0(0x0)
	char pad_4D4[0xE4]; // 0x0(0x0)
	struct TMap<struct FEmitterEffectApplyData, struct FEmitterEffectSaveData> LastEffectTimeMap; // 0x0(0x0)
	struct TMap<unsigned __int32, struct UCastConditionCheck*> CollisionCheckCondition; // 0x0(0x0)
	bool bNeedSlide; // 0x0(0x0)
	bool bSlideOnHitPawn; // 0x0(0x0)
	char pad_65A[0x6]; // 0x0(0x0)
	struct UParticleSystemComponent* ParticleComp; // 0x0(0x0)
	struct USceneComponent* OldUpdateComp; // 0x0(0x0)
	struct TWeakObjectPtr<struct AGameSkill> CurGameSkill; // 0x0(0x0)
	char pad_678[0x8]; // 0x0(0x0)

	void TickFreshCapsual(float DeltaTime); // Function /Script/Game.AbilityCollision_Capsual.TickFreshCapsual // (Final|Native|Public) // @ game+0
	void OnOuterMoveCollisionOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Capsual.OnOuterMoveCollisionOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnEffectBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Capsual.OnEffectBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnAbilityCollisionEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex); // Function /Script/Game.AbilityCollision_Capsual.OnAbilityCollisionEndOverlap // (Final|Native|Public) // @ game+0
	void OnAbilityCollisionBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Capsual.OnAbilityCollisionBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnAbilityCollisionActivated(struct UActorComponent* Component, bool bReset); // Function /Script/Game.AbilityCollision_Capsual.OnAbilityCollisionActivated // (Final|Native|Public) // @ game+0
	void DisableAbilityCollision(); // Function /Script/Game.AbilityCollision_Capsual.DisableAbilityCollision // (Final|Native|Public) // @ game+0
};

 // Class /Script/Game.AbilityCollision_Box
// Size: 0x0 (Inherited: 0x0)
struct UAbilityCollision_Box : UBoxComponent {
	enum class ECollisionPurposeType CollisionPurposeType; // 0x0(0x0)
	char pad_481[0x7]; // 0x0(0x0)
	struct UCurveVector* BoxExtendCurve; // 0x0(0x0)
	struct UCurveVector* RotatorCurve; // 0x0(0x0)
	struct UCurveVector* OffsetCurve; // 0x0(0x0)
	char BoxExtendForwardX : 1; // 0x0(0x0)
	char BoxExtendForwardY : 1; // 0x0(0x0)
	char BoxExtendForwardZ : 1; // 0x0(0x0)
	char pad_4A0_3 : 5; // 0x0(0x0)
	bool bApplyEffect; // 0x0(0x0)
	char pad_4A2[0x6]; // 0x0(0x0)
	struct TArray<__int32> EffectEmitterIDs; // 0x0(0x0)
	struct TArray<struct FCastEmitterCondition> ConditionEmitterID; // 0x0(0x0)
	bool bUseGroup; // 0x0(0x0)
	char pad_4C9[0x3]; // 0x0(0x0)
	__int32 CollisionQueryTimes; // 0x0(0x0)
	char pad_4D0[0x58]; // 0x0(0x0)
	float ActiveTime; // 0x0(0x0)
	char pad_52C[0x94]; // 0x0(0x0)
	struct TMap<struct FEmitterEffectApplyData, struct FEmitterEffectSaveData> LastEffectTimeMap; // 0x0(0x0)
	struct TMap<unsigned __int32, struct UCastConditionCheck*> CollisionCheckCondition; // 0x0(0x0)
	char pad_660[0x8]; // 0x0(0x0)
	struct UParticleSystemComponent* ParticleComp; // 0x0(0x0)
	struct USceneComponent* OldUpdateComp; // 0x0(0x0)
	struct TWeakObjectPtr<struct AGameSkill> CurGameSkill; // 0x0(0x0)

	void OnOuterMoveCollisionOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Box.OnOuterMoveCollisionOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnEffectBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Box.OnEffectBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnAbilityCollisionEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex); // Function /Script/Game.AbilityCollision_Box.OnAbilityCollisionEndOverlap // (Final|Native|Public) // @ game+0
	void OnAbilityCollisionBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, __int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function /Script/Game.AbilityCollision_Box.OnAbilityCollisionBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0
	void OnAbilityCollisionActivated(struct UActorComponent* Component, bool bReset); // Function /Script/Game.AbilityCollision_Box.OnAbilityCollisionActivated // (Final|Native|Public) // @ game+0
	void DisableAbilityCollision(); // Function /Script/Game.AbilityCollision_Box.DisableAbilityCollision // (Final|Native|Public) // @ game+0
};

 // Class /Script/Game.AbilityCollisionEditor
// Size: 0x0 (Inherited: 0x0)
struct AAbilityCollisionEditor : AActor {

	struct TArray<struct FQueryResult> QueryTargetOverlap(struct TArray<struct FHitResult>& Hits, enum class EApplyLocationType LocationType, float RandRadius, struct UAbilityComponentBase* Launcher, struct FTargetsQueryInfo& Info, struct USkillEmitter* EmitterRef); // Function /Script/Game.AbilityCollisionEditor.QueryTargetOverlap // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<struct FHitResult> GetSweepHits(struct UShapeComponent* shape, struct TArray<struct AActor*> IgnoreActors, struct FTransform InOldTransform); // Function /Script/Game.AbilityCollisionEditor.GetSweepHits // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AbilityCollisionInterface
// Size: 0x0 (Inherited: 0x0)
struct UAbilityCollisionInterface : UInterface {
};

 // Class /Script/Game.AbilityCharacterInterface
// Size: 0x0 (Inherited: 0x0)
struct UAbilityCharacterInterface : UInterface {

	bool IsUseDestroyValue(); // Function /Script/Game.AbilityCharacterInterface.IsUseDestroyValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsMinion(); // Function /Script/Game.AbilityCharacterInterface.IsMinion // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int64 GetPlayerCardTeamplateID(); // Function /Script/Game.AbilityCharacterInterface.GetPlayerCardTeamplateID // (Native|Public|BlueprintCallable) // @ game+0
	struct AActor* GetOwnerActor(); // Function /Script/Game.AbilityCharacterInterface.GetOwnerActor // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct AGameCharacter* GetMinionMaster(); // Function /Script/Game.AbilityCharacterInterface.GetMinionMaster // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	char GetLevel(char AttackLevel); // Function /Script/Game.AbilityCharacterInterface.GetLevel // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetGrowAttributeID(__int32& OutLevel); // Function /Script/Game.AbilityCharacterInterface.GetGrowAttributeID // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	char GetAttackLevel(char AttackLevel); // Function /Script/Game.AbilityCharacterInterface.GetAttackLevel // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetAppearID(); // Function /Script/Game.AbilityCharacterInterface.GetAppearID // (Native|Public|BlueprintCallable) // @ game+0
	struct UAbilityComponentBase* GetAbilityComponent(); // Function /Script/Game.AbilityCharacterInterface.GetAbilityComponent // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.RelationshipInterface
// Size: 0x0 (Inherited: 0x0)
struct URelationshipInterface : UInterface {

	enum class ECharacterType GetOwnerCharacterType(); // Function /Script/Game.RelationshipInterface.GetOwnerCharacterType // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetCampType(); // Function /Script/Game.RelationshipInterface.GetCampType // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.AbilityCollisionEditorInterface
// Size: 0x0 (Inherited: 0x0)
struct UAbilityCollisionEditorInterface : UInterface {

	bool CheckCollisionEmitterTraceType(enum class ETraceTypeQuery TraceChannel); // Function /Script/Game.AbilityCollisionEditorInterface.CheckCollisionEmitterTraceType // (Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.BulletEnchantCollisionEditorInterface
// Size: 0x0 (Inherited: 0x0)
struct UBulletEnchantCollisionEditorInterface : UInterface {

	bool GetEnchantEmitterInfo(struct UAbilityComponentBase* Target, struct FBulletInfo& BulletInfo, struct FWeaponEnchantEmitterInfo& OutInfo, __int32& OutBulletEnchantID); // Function /Script/Game.BulletEnchantCollisionEditorInterface.GetEnchantEmitterInfo // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.GameAbilityComponent
// Size: 0x0 (Inherited: 0x0)
struct UGameAbilityComponent : UActorComponent {
	float SpecializationSkillBlockTime; // 0x0(0x0)
	char pad_B4[0x4]; // 0x0(0x0)
	struct FMulticastInlineDelegate OnBufferActive; // 0x0(0x0)
	struct FMulticastInlineDelegate OnBufferDeActive; // 0x0(0x0)
	struct FMulticastInlineDelegate OnSkillBlockup; // 0x0(0x0)
	struct FMulticastInlineDelegate OnQTEChange; // 0x0(0x0)
	struct FMulticastInlineDelegate OnSkillCdChange; // 0x0(0x0)
	struct FMulticastInlineDelegate OnSkillCoolDown; // 0x0(0x0)
	struct TArray<struct UAvailableSkill*> AvailableSkills; // 0x0(0x0)
	struct TArray<struct UAvailableSkill*> ClientPredictiveSkills; // 0x0(0x0)
	struct FAbilityAttributeArray AbilityAttributes; // 0x0(0x0)
	struct FGameplayTagContainer GameplayTagContainer; // 0x0(0x0)
	struct TMap<unsigned __int32, __int32> SkillCDConfigInfo; // 0x0(0x0)
	char pad_2D8[0x8]; // 0x0(0x0)
	struct TArray<struct UGameAbilityBuffer*> AbilityBufferes; // 0x0(0x0)
	struct TArray<struct UGameAbilityBuffer*> RemoveBufferes; // 0x0(0x0)
	char pad_300[0x8]; // 0x0(0x0)
	struct TArray<struct UAbilitySpecialAttribute*> SpecialAttributes; // 0x0(0x0)
	float HitAbnormalForbideTime; // 0x0(0x0)
	enum class EAbnormalState ForbideState; // 0x0(0x0)
	char pad_31D[0x3]; // 0x0(0x0)
	struct FBeakInvisibleData BreakInvisibleData; // 0x0(0x0)
	char pad_32C[0xC]; // 0x0(0x0)
	unsigned __int64 CurrentAbilityState; // 0x0(0x0)
	struct FMulticastInlineDelegate OnGameAbilityDestroyed; // 0x0(0x0)
	char pad_350[0x28]; // 0x0(0x0)

	bool UnPauseAllSkill(); // Function /Script/Game.GameAbilityComponent.UnPauseAllSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void StopAllSpecializationSkill(float StopTime); // Function /Script/Game.GameAbilityComponent.StopAllSpecializationSkill // (Net|Native|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void SetSkillTempCDByTagName(struct FString TagName, float TempCD, bool bUsePercentChange); // Function /Script/Game.GameAbilityComponent.SetSkillTempCDByTagName // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetSkillTempCDBySkillType(struct TArray<struct FString>& TypeName, float TempCD, bool bUsePercentChange); // Function /Script/Game.GameAbilityComponent.SetSkillTempCDBySkillType // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void SetSkillTempCD(__int32 SkillID, float TempCD, bool bUsePercentChange); // Function /Script/Game.GameAbilityComponent.SetSkillTempCD // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetSkillCurrentCDByTagName(struct FString TagName, float InCD, bool bUsePercentChange); // Function /Script/Game.GameAbilityComponent.SetSkillCurrentCDByTagName // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetSkillCurrentCD(__int32 SkillID, float InCD, bool bUsePercentChange); // Function /Script/Game.GameAbilityComponent.SetSkillCurrentCD // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetMaxAttributeValue(struct UAbilityAttribute* AbilityAttribute, float InValue); // Function /Script/Game.GameAbilityComponent.SetMaxAttributeValue // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetGodFather(bool InType); // Function /Script/Game.GameAbilityComponent.SetGodFather // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetBreakInvisibleData(struct FBeakInvisibleData& Data); // Function /Script/Game.GameAbilityComponent.SetBreakInvisibleData // (Final|Native|Public|HasOutParms) // @ game+0
	void SetAttributeValue(struct UAbilityAttribute* lpAbilityAttribute, float fAttributeValue); // Function /Script/Game.GameAbilityComponent.SetAttributeValue // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ResetSkillCurrentCDByTagName(struct FString TagName); // Function /Script/Game.GameAbilityComponent.ResetSkillCurrentCDByTagName // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ResetSkillCurrentCD(__int32 SkillID); // Function /Script/Game.GameAbilityComponent.ResetSkillCurrentCD // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveAllBuffer(); // Function /Script/Game.GameAbilityComponent.RemoveAllBuffer // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool PauseAllInAnimSkill(); // Function /Script/Game.GameAbilityComponent.PauseAllInAnimSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnRepAvailableSkills(); // Function /Script/Game.GameAbilityComponent.OnRepAvailableSkills // (Final|Native|Protected) // @ game+0
	void OnQTESkillsChange(enum class EQTESkillCastableType CastableType, __int32 SkillID); // Function /Script/Game.GameAbilityComponent.OnQTESkillsChange // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0
	void OnGameAbilityDestroyedSignature__DelegateSignature(); // DelegateFunction /Script/Game.GameAbilityComponent.OnGameAbilityDestroyedSignature__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0
	bool K2_IsDead(); // Function /Script/Game.GameAbilityComponent.K2_IsDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool K2_IsAlive(); // Function /Script/Game.GameAbilityComponent.K2_IsAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void K2_InitAttribute(struct UAbilityAttribute* AbilityAttribute, float fBaseValue, float fAddtionRate, float fAddtionValue, float fCurValue); // Function /Script/Game.GameAbilityComponent.K2_InitAttribute // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FSkillInfo K2_GetSkillInfo(__int32 nSkillId); // Function /Script/Game.GameAbilityComponent.K2_GetSkillInfo // (Final|Native|Public|BlueprintCallable) // @ game+0
	float K2_GetCurrentRealValue(struct UAbilityAttribute* AbilityAttribute); // Function /Script/Game.GameAbilityComponent.K2_GetCurrentRealValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float K2_GetCurrentCDRemainingPercent(__int32 SkillSlot); // Function /Script/Game.GameAbilityComponent.K2_GetCurrentCDRemainingPercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct UAvailableSkill* K2_GetAvaliableSkillInfo(__int32 InID); // Function /Script/Game.GameAbilityComponent.K2_GetAvaliableSkillInfo // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct TArray<struct UAvailableSkill*> K2_GetAllAvaliableSkillInfo(); // Function /Script/Game.GameAbilityComponent.K2_GetAllAvaliableSkillInfo // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool K2_CastSkill(__int32 SkillSlot, struct FString SkillTagSuffix, enum class ESkillCastType CastType); // Function /Script/Game.GameAbilityComponent.K2_CastSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsSkillWaitForCD(__int32 SkillID); // Function /Script/Game.GameAbilityComponent.IsSkillWaitForCD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsSkillInEndTime(__int32 SkillID); // Function /Script/Game.GameAbilityComponent.IsSkillInEndTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsSkillInActive(__int32 SkillID); // Function /Script/Game.GameAbilityComponent.IsSkillInActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInState(enum class EAbilityState nAbilityState); // Function /Script/Game.GameAbilityComponent.IsInState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool IsInSpecializationSkillBlock(); // Function /Script/Game.GameAbilityComponent.IsInSpecializationSkillBlock // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsInAbnormal(); // Function /Script/Game.GameAbilityComponent.IsInAbnormal // (Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool IsGodFather(); // Function /Script/Game.GameAbilityComponent.IsGodFather // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool HasActiveSkill(); // Function /Script/Game.GameAbilityComponent.HasActiveSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetVigourStorageRatio(); // Function /Script/Game.GameAbilityComponent.GetVigourStorageRatio // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetVigourRush(); // Function /Script/Game.GameAbilityComponent.GetVigourRush // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetVigourOtherRatio(); // Function /Script/Game.GameAbilityComponent.GetVigourOtherRatio // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetVigourDodgeRatio(); // Function /Script/Game.GameAbilityComponent.GetVigourDodgeRatio // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetTeamCurrentValue(enum class EAttributeType AbilityAttributeType); // Function /Script/Game.GameAbilityComponent.GetTeamCurrentValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetSkillUsingCD(struct UAvailableSkill* nAvailableSkill); // Function /Script/Game.GameAbilityComponent.GetSkillUsingCD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetSkillCurrentCD(struct UAvailableSkill* nAvailableSkill); // Function /Script/Game.GameAbilityComponent.GetSkillCurrentCD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void GetSkillChargeTimBySkillIndex(__int32 SkillIndex, __int32& CurrentChargeTime, __int32& MaxChargeTime); // Function /Script/Game.GameAbilityComponent.GetSkillChargeTimBySkillIndex // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void GetSkillCharageTime(__int32 SkillID, __int32& CurrentChargeTime, __int32& MaxChargeTime); // Function /Script/Game.GameAbilityComponent.GetSkillCharageTime // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct AGameCharacter* GetOriginCharacter(); // Function /Script/Game.GameAbilityComponent.GetOriginCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetMaxAttributeValueDirect(struct UAbilityAttribute* AbilityAttribute, bool bDirect); // Function /Script/Game.GameAbilityComponent.GetMaxAttributeValueDirect // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetMaxAttributeValue(struct UAbilityAttribute* AbilityAttribute); // Function /Script/Game.GameAbilityComponent.GetMaxAttributeValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool GetForbidMoveAndRotationState(); // Function /Script/Game.GameAbilityComponent.GetForbidMoveAndRotationState // (Final|Native|Public|BlueprintCallable) // @ game+0
	float GetCurrentValueDirect(struct UAbilityAttribute* AbilityAttribute, char Level, bool bDirect); // Function /Script/Game.GameAbilityComponent.GetCurrentValueDirect // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetCurrentValue(struct UAbilityAttribute* AbilityAttribute, char Level); // Function /Script/Game.GameAbilityComponent.GetCurrentValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void GetCurrentAbnormalInfo(struct FAbnormalInfo& Info); // Function /Script/Game.GameAbilityComponent.GetCurrentAbnormalInfo // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void GetBreakInvisibleData(struct FBeakInvisibleData& Data); // Function /Script/Game.GameAbilityComponent.GetBreakInvisibleData // (Final|Native|Public|HasOutParms) // @ game+0
	float GetBaseValueDirect(struct UAbilityAttribute* AbilityAttribute, bool bDirect); // Function /Script/Game.GameAbilityComponent.GetBaseValueDirect // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetBaseValue(struct UAbilityAttribute* AbilityAttribute); // Function /Script/Game.GameAbilityComponent.GetBaseValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<struct UGameAbilityBuffer*> GetActiveAbilityBuffer(struct UGameAbilityBuffer*& nGameAbilityBufferClass); // Function /Script/Game.GameAbilityComponent.GetActiveAbilityBuffer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<struct UGameAbilityBuffer*> GetAbilityBuffer(struct UGameAbilityBuffer*& nGameAbilityBufferClass); // Function /Script/Game.GameAbilityComponent.GetAbilityBuffer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void FrazzStateStart(); // Function /Script/Game.GameAbilityComponent.FrazzStateStart // (Final|Native|Public|BlueprintCallable) // @ game+0
	void FrazzStateFinish(); // Function /Script/Game.GameAbilityComponent.FrazzStateFinish // (Final|Native|Public) // @ game+0
	void ForbidSwitchAndCastSkill(); // Function /Script/Game.GameAbilityComponent.ForbidSwitchAndCastSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ForbidMoveAndRotation(); // Function /Script/Game.GameAbilityComponent.ForbidMoveAndRotation // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ForbidFire(); // Function /Script/Game.GameAbilityComponent.ForbidFire // (Final|Native|Public|BlueprintCallable) // @ game+0
	void EnableSwitchAndCastSkill(); // Function /Script/Game.GameAbilityComponent.EnableSwitchAndCastSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void EnableMoveAndRotation(); // Function /Script/Game.GameAbilityComponent.EnableMoveAndRotation // (Final|Native|Public|BlueprintCallable) // @ game+0
	void EnableFire(); // Function /Script/Game.GameAbilityComponent.EnableFire // (Final|Native|Public|BlueprintCallable) // @ game+0
	void DeActiveAbilityBuffer(struct UGameAbilityBuffer* lpGameAbilityBuffer); // Function /Script/Game.GameAbilityComponent.DeActiveAbilityBuffer // (Final|Native|Public|BlueprintCallable) // @ game+0
	void Client_SetSkillCurrentCD(__int32 InSkillId, float InCD); // Function /Script/Game.GameAbilityComponent.Client_SetSkillCurrentCD // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0
	void Client_ResetSkillPublicCD(__int32 InSkillId, float InCD); // Function /Script/Game.GameAbilityComponent.Client_ResetSkillPublicCD // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0
	void Client_ResetSkillCD(__int32 InSkillId, float InCD); // Function /Script/Game.GameAbilityComponent.Client_ResetSkillCD // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0
	void Client_NotifySkillCDChanged(); // Function /Script/Game.GameAbilityComponent.Client_NotifySkillCDChanged // (Net|Native|Event|Public|NetClient) // @ game+0
	void Client_AbilityBufferState(unsigned __int64 nCurAbilityBufferState, unsigned __int64 nLastAbilityBufferState); // Function /Script/Game.GameAbilityComponent.Client_AbilityBufferState // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void ClearBreakInvisibleData(); // Function /Script/Game.GameAbilityComponent.ClearBreakInvisibleData // (Final|Native|Public) // @ game+0
	void ChangeSkillCDByTagName(struct FString TagName, float ChangeValue, bool bPercentChange); // Function /Script/Game.GameAbilityComponent.ChangeSkillCDByTagName // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ChangeSkillCDBySkillType(struct TArray<struct FString>& TypeName, float ChangeValue, bool bPercentChange, __int32 ChargeType); // Function /Script/Game.GameAbilityComponent.ChangeSkillCDBySkillType // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void ChangeSkillCD(__int32 SkillID, float ChangeValue, bool bPercentChange); // Function /Script/Game.GameAbilityComponent.ChangeSkillCD // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ChangeAllNonChargingSkill(float ChangeValue, bool bPercentChange); // Function /Script/Game.GameAbilityComponent.ChangeAllNonChargingSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ChangeAllChargingSkill(float ChangeValue, bool bPercentChange); // Function /Script/Game.GameAbilityComponent.ChangeAllChargingSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CancleSpecificSkill(enum class ESkillInterruptedType Type, __int32 SkillID); // Function /Script/Game.GameAbilityComponent.CancleSpecificSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CancleAllSkill(enum class ESkillInterruptedType Type, bool bDieCause, bool bIncludeAdditiveSkill); // Function /Script/Game.GameAbilityComponent.CancleAllSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CancleAllInAnimSkill_Accessory(enum class ESkillInterruptedType Type); // Function /Script/Game.GameAbilityComponent.CancleAllInAnimSkill_Accessory // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CancleAllInAnimSkill(enum class ESkillInterruptedType Type, bool bExceptHalfSkil, bool bDieCause); // Function /Script/Game.GameAbilityComponent.CancleAllInAnimSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AddSkillChargeTimebyTag(struct FString TagName, __int32 ChangeValue); // Function /Script/Game.GameAbilityComponent.AddSkillChargeTimebyTag // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AddSkillChargeTime(__int32 SkillID, __int32 ChangeValue); // Function /Script/Game.GameAbilityComponent.AddSkillChargeTime // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct UAbilitySpecialAttribute* ActiveSpecialAttribute(struct UAbilitySpecialAttribute*& InSpecialAttributeClass, struct UObject* InOuter); // Function /Script/Game.GameAbilityComponent.ActiveSpecialAttribute // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct UGameAbilityBuffer* ActiveAbilityBuffer(struct UGameAbilityBuffer*& nGameAbilityBufferClass, struct UGameAbilityComponent* lpInstigator, struct TArray<struct FParamInfo>& Info, struct UObject* Outer, __int32 InLevel, struct UModifier* OwnerModifier); // Function /Script/Game.GameAbilityComponent.ActiveAbilityBuffer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AbilityComponentBase
// Size: 0x0 (Inherited: 0x0)
struct UAbilityComponentBase : UGameAbilityComponent {
	bool bShowDamageText; // 0x0(0x0)
	char pad_379[0x7]; // 0x0(0x0)
	struct UHitDelayRecoverAttribute* ShieldRecoverClass; // 0x0(0x0)
	struct UResetRecoverTimerOnReduceAndSwitch* CharacterEnergyRecover; // 0x0(0x0)
	struct TArray<struct FElemExplosionEffect> ElemExplosionEffects; // 0x0(0x0)
	char pad_3A0[0x18]; // 0x0(0x0)
	struct TArray<struct UModifier*> AppliedModifiers; // 0x0(0x0)
	struct TArray<struct UModifier*> DirtyModifiers; // 0x0(0x0)
	struct TArray<struct FModifierExhibitionData> AppliedModifierDatas; // 0x0(0x0)
	struct TArray<__int32> PassiveSkillIDs; // 0x0(0x0)
	struct FMulticastInlineDelegate OnEmitterEnd; // 0x0(0x0)
	struct FMulticastInlineDelegate OnModifierApplied; // 0x0(0x0)
	struct FMulticastInlineDelegate OnModifierRecived; // 0x0(0x0)
	struct FMulticastInlineDelegate OnModifierPreApply; // 0x0(0x0)
	struct FMulticastInlineDelegate OnModifierRemove; // 0x0(0x0)
	struct FMulticastInlineDelegate OnModifierRemoveEnd; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAppliedModifierOverlaidChange; // 0x0(0x0)
	char pad_468[0x18]; // 0x0(0x0)
	struct FMulticastInlineDelegate OnSkillCancel; // 0x0(0x0)
	char pad_490[0x18]; // 0x0(0x0)
	struct FMulticastInlineDelegate OnSkillEnd; // 0x0(0x0)
	struct FMulticastInlineDelegate OnPreDeadCheck; // 0x0(0x0)
	struct FMulticastInlineDelegate OnPreDead; // 0x0(0x0)
	struct FMulticastInlineDelegate OnDead; // 0x0(0x0)
	char pad_4E8[0x10]; // 0x0(0x0)
	struct FMulticastInlineDelegate OnShieldChange; // 0x0(0x0)
	struct FMulticastInlineDelegate OnShieldDisappear; // 0x0(0x0)
	char pad_518[0xB0]; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyModifyHealth; // 0x0(0x0)
	struct FMulticastInlineDelegate OnReceiveDamage; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyReceiveDamage; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyApplyDamage; // 0x0(0x0)
	struct FMulticastInlineDelegate OnElemExplosion; // 0x0(0x0)
	struct FMulticastInlineDelegate OnChangeElemExplosion; // 0x0(0x0)
	struct FMulticastInlineDelegate OnApplyDamage; // 0x0(0x0)
	struct FMulticastInlineDelegate OnApplyHeal; // 0x0(0x0)
	struct FMulticastInlineDelegate OnReceiveHeal; // 0x0(0x0)
	struct FMulticastInlineDelegate OnReceiveDamageSkillOnce; // 0x0(0x0)
	struct FMulticastInlineDelegate OnApplyDamageSkillOnce; // 0x0(0x0)
	struct FMulticastInlineDelegate OnReceiveHit; // 0x0(0x0)
	struct FMulticastInlineDelegate OnApplyHit; // 0x0(0x0)
	struct FMulticastInlineDelegate OnApplyBulletHitOnce; // 0x0(0x0)
	struct FMulticastInlineDelegate OnReceiveHitAffterDamage; // 0x0(0x0)
	struct FMulticastInlineDelegate OnApplyHitAffterDamage; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAbilityCastSkill; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAbilitySkillEnd; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAbilitySkillCastSuccess; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAbilitySkillCancle; // 0x0(0x0)
	struct FMulticastInlineDelegate OnEmitterTrigger; // 0x0(0x0)
	struct FMulticastInlineDelegate OnEmitterApplyMagic; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAppliedModifierChange; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAppliedModifierChangeToUI; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAppliedModifierRemainingTimeChange; // 0x0(0x0)
	struct FMulticastInlineDelegate OnSpawnBullet; // 0x0(0x0)
	struct FMulticastInlineDelegate OnRecycleBullet; // 0x0(0x0)
	struct FMulticastInlineDelegate OnBulletHitTarget; // 0x0(0x0)
	struct FMulticastInlineDelegate OnByBulletHit; // 0x0(0x0)
	struct FMulticastInlineDelegate OnPreModifierHealth; // 0x0(0x0)
	struct FMulticastInlineDelegate OnBlockDamage; // 0x0(0x0)
	struct FMulticastInlineDelegate OnTyrLock; // 0x0(0x0)
	struct FMulticastInlineDelegate OnTyrLockEnd; // 0x0(0x0)
	struct FMulticastInlineDelegate OnFightPowerChanged; // 0x0(0x0)
	struct FMulticastInlineDelegate OnReceiveAbnormal; // 0x0(0x0)
	struct FMulticastInlineDelegate OnApplyAbnormal; // 0x0(0x0)
	struct FMulticastInlineDelegate OnPreApplyAbnormal; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyReloadLogic; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyReloadState; // 0x0(0x0)
	bool bInReloadState; // 0x0(0x0)
	char pad_839[0x3]; // 0x0(0x0)
	struct TWeakObjectPtr<struct URecordSkillCostBuffer> RecordSkillCostBuffer; // 0x0(0x0)
	char pad_844[0x4]; // 0x0(0x0)
	struct TArray<__int32> AllSkillFixIds; // 0x0(0x0)
	struct TArray<__int32> FixTeamPassiveSkills; // 0x0(0x0)
	struct TArray<struct FSkillInfo> FixSkillInfos; // 0x0(0x0)
	struct TArray<struct FEmitterInfo> FixEmitterInfos; // 0x0(0x0)
	struct TArray<struct FModifierDataInfo> FixModifierInfos; // 0x0(0x0)
	struct TArray<struct FBulletInfo> FixBulletInfos; // 0x0(0x0)
	struct TArray<struct FTrapSpawnInfo> FixTrapInfos; // 0x0(0x0)
	struct TArray<__int32> ActiveSkillIds; // 0x0(0x0)
	struct TArray<__int32> ActiveEmitterIds; // 0x0(0x0)
	__int32 ModifierRunTimeID; // 0x0(0x0)
	__int32 SkillRunTimeID; // 0x0(0x0)
	char pad_8E0[0xA8]; // 0x0(0x0)
	struct TArray<__int32> DeActiveModifierIDs; // 0x0(0x0)
	struct FGameplayTagContainer DeActiveModifierTags; // 0x0(0x0)
	struct FAbnormalInfo CurrentAbonormalInfo; // 0x0(0x0)
	struct TArray<__int32> QTESkills; // 0x0(0x0)
	struct TWeakObjectPtr<struct UBreakOrZeroInCDToRecover> VigourRecoverBuffer; // 0x0(0x0)
	struct TArray<struct FAbnormalInfo> AbnormalStateInfos; // 0x0(0x0)
	struct UAbilityAttributeAgent* Attribute; // 0x0(0x0)
	struct FEnchantBulletInfo SkillEnchantBulletInfo; // 0x0(0x0)
	struct TMap<__int32, struct FDeriveSkillIDs> ActiveDeriveSkills; // 0x0(0x0)
	struct TMap<__int32, struct FDeriveSkillIDs> DeActiveDeriveSkills; // 0x0(0x0)
	struct TArray<enum class EModifyHPType> EnchantDamageType; // 0x0(0x0)
	struct TArray<__int32> SpecificEnchantID; // 0x0(0x0)
	struct TArray<__int32> EnchantEmitter; // 0x0(0x0)
	char pad_B28[0x58]; // 0x0(0x0)
	struct TMap<struct FString, struct FElemExplosionBaseData> ElemExplosionBaseData; // 0x0(0x0)
	struct FElemExplosion ElemExplosion; // 0x0(0x0)
	struct TMap<struct FString, struct FPartBounceData> PartBounceData; // 0x0(0x0)
	struct TMap<unsigned __int32, struct FDealArrayModifierDamageEffect> DealDamageEffectInfos; // 0x0(0x0)
	struct TArray<struct FAttributeChangeValue> CacheTempEffectChangeValue; // 0x0(0x0)
	char pad_CD0[0x10]; // 0x0(0x0)
	__int32 InvalidSpecifiedSkill; // 0x0(0x0)
	struct FCacheSkillInfo CacheSkillInfo; // 0x0(0x0)
	struct FCacheDodgeInfo CacheDodgeInfo; // 0x0(0x0)
	struct FControlProtectionInfo ControlProtectionInfo; // 0x0(0x0)
	struct TArray<struct FIgnoreByControlProtectionModifierInfo> DelayActiveModifierInfo; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAbnormalControlBegin; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAbnormalControlEnd; // 0x0(0x0)

	float VigourRecoverFunc(float InValue); // Function /Script/Game.AbilityComponentBase.VigourRecoverFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	float VigourCostFunc(float InValue, float Ratio); // Function /Script/Game.AbilityComponentBase.VigourCostFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	void TurnCharacterFaceCameraForward(); // Function /Script/Game.AbilityComponentBase.TurnCharacterFaceCameraForward // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void TryJumpToNextSkill(__int32 InID, __int32 PreSkillID); // Function /Script/Game.AbilityComponentBase.TryJumpToNextSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void TryCastSpecificSkill(__int32 InID, enum class ESkillCastType InType, bool bAutoCast, __int32 DelegateCastIndex); // Function /Script/Game.AbilityComponentBase.TryCastSpecificSkill // (Native|Public|BlueprintCallable) // @ game+0
	void TestFixEmitter(__int32 FixID); // Function /Script/Game.AbilityComponentBase.TestFixEmitter // (Final|Native|Public|BlueprintCallable) // @ game+0
	void StopFullSkillAnimMontage(); // Function /Script/Game.AbilityComponentBase.StopFullSkillAnimMontage // (Final|Native|Public|BlueprintCallable) // @ game+0
	void StopAnimMontage(struct UAnimMontage* AnimMontage); // Function /Script/Game.AbilityComponentBase.StopAnimMontage // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void SkillFinish(__int32 ID, struct TArray<__int32>& OriginIDs); // Function /Script/Game.AbilityComponentBase.SkillFinish // (Native|Public|HasOutParms) // @ game+0
	void SkillEmit(__int32 ID); // Function /Script/Game.AbilityComponentBase.SkillEmit // (Native|Public) // @ game+0
	void SkillCancle(__int32 ID, struct TArray<__int32> OriginIDs, enum class ESkillInterruptedType InType); // Function /Script/Game.AbilityComponentBase.SkillCancle // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	float ShieldRecoverFunc(float InValue, struct UAbilityComponentBase* InLauncher); // Function /Script/Game.AbilityComponentBase.ShieldRecoverFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetSkillEnchantBulletInfo(__int32 InID, __int32 InOriginalID, float InPro, struct UAbilityComponentBase* InAbility, __int32 InLevel); // Function /Script/Game.AbilityComponentBase.SetSkillEnchantBulletInfo // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetPropertieValueFromString(struct FString RoleName, float fAttributeValue); // Function /Script/Game.AbilityComponentBase.SetPropertieValueFromString // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetInvalidSpecifiedSkill(__int32 InIndex); // Function /Script/Game.AbilityComponentBase.SetInvalidSpecifiedSkill // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void SetEndNewAbnormalControlStateCall(enum class EAbnormalState NewState); // Function /Script/Game.AbilityComponentBase.SetEndNewAbnormalControlStateCall // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetCurrentAbnormalInfo(struct FAbnormalInfo& Info); // Function /Script/Game.AbilityComponentBase.SetCurrentAbnormalInfo // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void SetBeginNewAbnormalControlStateCall(enum class EAbnormalState NewState); // Function /Script/Game.AbilityComponentBase.SetBeginNewAbnormalControlStateCall // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetAllowTickAbility(bool AllowTickAbility); // Function /Script/Game.AbilityComponentBase.SetAllowTickAbility // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0
	void SetAdvancedAction(enum class ESkillActionType nSkillActionType, float fRetainWeaponRaising, bool bKeepWeaponRaisingOnSkillStart); // Function /Script/Game.AbilityComponentBase.SetAdvancedAction // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void Server_CastSubSkillAtTrans(__int32 InID, __int32 Level, struct AActor* Launcher, enum class ESkillCastType InType, struct FTransform InOverrideSpawnTrans); // Function /Script/Game.AbilityComponentBase.Server_CastSubSkillAtTrans // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0
	void Server_CastSubSkill(__int32 InID, __int32 Level, struct AActor* Launcher, enum class ESkillCastType InType); // Function /Script/Game.AbilityComponentBase.Server_CastSubSkill // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0
	void RPC_Die(struct UAbilityComponentBase* InLauncher, struct FHealthChangeValue nChangeValueData); // Function /Script/Game.AbilityComponentBase.RPC_Die // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void RemoveSpecificEnchantInfo(__int32 ID); // Function /Script/Game.AbilityComponentBase.RemoveSpecificEnchantInfo // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveSkill(__int32 InID); // Function /Script/Game.AbilityComponentBase.RemoveSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveModifierFromTag(struct FGameplayTag& ModifierTag); // Function /Script/Game.AbilityComponentBase.RemoveModifierFromTag // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void RemoveModifierFromSkillID(__int32 SkillID); // Function /Script/Game.AbilityComponentBase.RemoveModifierFromSkillID // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveModifierFromRunTimeID(__int32 RunTimeID); // Function /Script/Game.AbilityComponentBase.RemoveModifierFromRunTimeID // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveModifierFromEmitter(struct USkillEmitter* Modifier); // Function /Script/Game.AbilityComponentBase.RemoveModifierFromEmitter // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveModifierFormModifierID(__int32 ModifierID, struct UAbilityComponentBase* SpecificAbility, struct UAbilityComponentBase* InLauncher); // Function /Script/Game.AbilityComponentBase.RemoveModifierFormModifierID // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveModifierByBuffer(struct UGameAbilityBuffer* InBuffer); // Function /Script/Game.AbilityComponentBase.RemoveModifierByBuffer // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveModifier(struct UModifier* Modifier, bool bRemoveAll); // Function /Script/Game.AbilityComponentBase.RemoveModifier // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveEnchantEmitter(__int32 InEmitterID); // Function /Script/Game.AbilityComponentBase.RemoveEnchantEmitter // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveEnchantDamageByName(struct FString NewDamageTypeName); // Function /Script/Game.AbilityComponentBase.RemoveEnchantDamageByName // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveEnchantDamage(enum class EModifyHPType NewDamageType); // Function /Script/Game.AbilityComponentBase.RemoveEnchantDamage // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveAllSkill(); // Function /Script/Game.AbilityComponentBase.RemoveAllSkill // (Native|Public|BlueprintCallable) // @ game+0
	void RemoveAllModifier(); // Function /Script/Game.AbilityComponentBase.RemoveAllModifier // (Native|Public|BlueprintCallable) // @ game+0
	void RemoveAbnormalStateForArray(enum class EAbnormalState InvalidState, __int32 InModifierRunTimeID); // Function /Script/Game.AbilityComponentBase.RemoveAbnormalStateForArray // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void RemoveAbnormalState(enum class EAbnormalState InvalidState, __int32 InModifierRunTimeID, bool bForceRemove); // Function /Script/Game.AbilityComponentBase.RemoveAbnormalState // (Native|Public|BlueprintCallable) // @ game+0
	bool ReceiveAbnormalState(enum class EAbnormalState NewState, struct FAbnormalInfo& AbnormalInfo, float Scale, bool bForceApply, bool bNewApply); // Function /Script/Game.AbilityComponentBase.ReceiveAbnormalState // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void PlayAnimMontage_JumpToSection(struct UAnimMontage* AnimMontage, struct FString Section); // Function /Script/Game.AbilityComponentBase.PlayAnimMontage_JumpToSection // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void PlayAnimMontage_JumpToPosition(struct UAnimMontage* AnimMontage, float Position); // Function /Script/Game.AbilityComponentBase.PlayAnimMontage_JumpToPosition // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void PlayAnimMontage(struct UAnimMontage* AnimMontage, bool StopAll, float InPlayRate, struct FName StartSectionName); // Function /Script/Game.AbilityComponentBase.PlayAnimMontage // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void OnRep_StateIDChange(); // Function /Script/Game.AbilityComponentBase.OnRep_StateIDChange // (Final|Native|Protected) // @ game+0
	void OnRep_SetAbnormalStateMask(); // Function /Script/Game.AbilityComponentBase.OnRep_SetAbnormalStateMask // (Final|Native|Public) // @ game+0
	void OnRep_AllSkillFixIds(); // Function /Script/Game.AbilityComponentBase.OnRep_AllSkillFixIds // (Final|Native|Public) // @ game+0
	float NormalEnergyRecoverFunc(float InValue); // Function /Script/Game.AbilityComponentBase.NormalEnergyRecoverFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	float NormalEnergyCostFunc(float InValue, __int32 SkillIndex); // Function /Script/Game.AbilityComponentBase.NormalEnergyCostFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	float ModifyHealth(struct UAbilityComponentBase* InLauncher, struct FHealthChangeValue& nChangeValueData, bool bFloatHp); // Function /Script/Game.AbilityComponentBase.ModifyHealth // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void LoadTrapInfoStatic(__int32 InID, struct FTrapSpawnInfo& OutTrapInfo, struct UAbilityComponentBase* InAbility); // Function /Script/Game.AbilityComponentBase.LoadTrapInfoStatic // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	void LoadEmitterStatic(__int32 InID, struct FEmitterInfo& Resultinfo, struct UAbilityComponentBase* InAbility); // Function /Script/Game.AbilityComponentBase.LoadEmitterStatic // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	void LoadBulletInfoStatic(__int32 InID, struct FBulletInfo& BulletInfo, struct UAbilityComponentBase* InAbility); // Function /Script/Game.AbilityComponentBase.LoadBulletInfoStatic // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	float LimitControlTime(float KeepTime); // Function /Script/Game.AbilityComponentBase.LimitControlTime // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FModifierDataInfo K2_LoadModifierInfoStatic(__int32 InID, struct UAbilityComponentBase* InAbility); // Function /Script/Game.AbilityComponentBase.K2_LoadModifierInfoStatic // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FSkillInfo K2_GetSkillInfoStatic(__int32 nSkillId, struct UAbilityComponentBase* InAbility); // Function /Script/Game.AbilityComponentBase.K2_GetSkillInfoStatic // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct FSkillFixInfo K2_GetSkillFixInfoStatic(__int32 nFixId); // Function /Script/Game.AbilityComponentBase.K2_GetSkillFixInfoStatic // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FEmitterInfo K2_GetFixEmitterStatic(__int32 InID, struct UAbilityComponentBase* InAbility); // Function /Script/Game.AbilityComponentBase.K2_GetFixEmitterStatic // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct FCharacterCardGrowTemplate K2_GetCardGrowTemplateData(); // Function /Script/Game.AbilityComponentBase.K2_GetCardGrowTemplateData // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool K2_FindOrAddSkill(__int32 InID, __int32 InLevel, bool bQTESkill); // Function /Script/Game.AbilityComponentBase.K2_FindOrAddSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool K2_ApplyAttributeValue(__int32 AttributeId, struct FApplyAttributeValueEvent& ApplyAttributeEvent); // Function /Script/Game.AbilityComponentBase.K2_ApplyAttributeValue // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void JumpSkill(__int32 InID, __int32 PreID, __int32 InLevel); // Function /Script/Game.AbilityComponentBase.JumpSkill // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0
	bool IsTurnable(); // Function /Script/Game.AbilityComponentBase.IsTurnable // (Native|Public|BlueprintCallable) // @ game+0
	enum class EQTESkillCastableType IsQTESkillEnable(); // Function /Script/Game.AbilityComponentBase.IsQTESkillEnable // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsPlayerActionInAbnormalBlock(enum class EPlayerAction PlayerAction); // Function /Script/Game.AbilityComponentBase.IsPlayerActionInAbnormalBlock // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsOpenControlProtection(); // Function /Script/Game.AbilityComponentBase.IsOpenControlProtection // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsMoveable(struct TArray<__int32>& InterruptSkill); // Function /Script/Game.AbilityComponentBase.IsMoveable // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	bool IsModifierHideFightWidget(enum class EFightWidgetPart Part); // Function /Script/Game.AbilityComponentBase.IsModifierHideFightWidget // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsModifierExistMark(__int32 ModifierID, struct FBoneResult& ApplyPartitionInfo, struct FBoneResult& ApplyPartInfo, struct UAbilityComponentBase* InLauncher); // Function /Script/Game.AbilityComponentBase.IsModifierExistMark // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsModifierExistByTagNameMark(struct FString TagName, struct FBoneResult& ApplyPartitionInfo, struct FBoneResult& ApplyPartInfo); // Function /Script/Game.AbilityComponentBase.IsModifierExistByTagNameMark // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsModifierExistByTagName(struct FString TagName); // Function /Script/Game.AbilityComponentBase.IsModifierExistByTagName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsModifierExistByTagMark(struct FGameplayTag& Tag, struct FBoneResult& ApplyPartitionInfo, struct FBoneResult& ApplyPartInfo); // Function /Script/Game.AbilityComponentBase.IsModifierExistByTagMark // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsModifierExistByTag(struct FGameplayTag& Tag); // Function /Script/Game.AbilityComponentBase.IsModifierExistByTag // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsModifierExist(__int32 ModifierID, struct UAbilityComponentBase* InLauncher); // Function /Script/Game.AbilityComponentBase.IsModifierExist // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInRootMotionSkill(); // Function /Script/Game.AbilityComponentBase.IsInRootMotionSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInputInAbnormalBlock(__int32 InputType, __int32 SkillIndex); // Function /Script/Game.AbilityComponentBase.IsInputInAbnormalBlock // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsInControlProtectionTimeCall(); // Function /Script/Game.AbilityComponentBase.IsInControlProtectionTimeCall // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsDerivedSkill(__int32 SkillID); // Function /Script/Game.AbilityComponentBase.IsDerivedSkill // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsControllable(); // Function /Script/Game.AbilityComponentBase.IsControllable // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsCharacterEnergyAttributeExist(); // Function /Script/Game.AbilityComponentBase.IsCharacterEnergyAttributeExist // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsCastingSkillInAnim(bool bIncludeAdditiveSkill); // Function /Script/Game.AbilityComponentBase.IsCastingSkillInAnim // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsCastingSkill(); // Function /Script/Game.AbilityComponentBase.IsCastingSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsCastingHalfSkill(); // Function /Script/Game.AbilityComponentBase.IsCastingHalfSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsAttributeLocked(enum class EAttributeType AttributeType, float LockRange); // Function /Script/Game.AbilityComponentBase.IsAttributeLocked // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsAimEnable(); // Function /Script/Game.AbilityComponentBase.IsAimEnable // (Final|Native|Public|BlueprintCallable) // @ game+0
	void InputIntteruptAbnormal(__int32 InputType, __int32 SkillIndex); // Function /Script/Game.AbilityComponentBase.InputIntteruptAbnormal // (Final|Native|Public|BlueprintCallable) // @ game+0
	void InitHitLagValue(struct FHitLag& HitLag); // Function /Script/Game.AbilityComponentBase.InitHitLagValue // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	bool HasShield(); // Function /Script/Game.AbilityComponentBase.HasShield // (Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	void HandleFlyImmuneControl(struct UAbilityComponentBase* InLauncher, struct FString& StrDesc); // Function /Script/Game.AbilityComponentBase.HandleFlyImmuneControl // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void HandleFlyHpOrShieldChange(struct FDamageInfo& Info); // Function /Script/Game.AbilityComponentBase.HandleFlyHpOrShieldChange // (Native|Public|HasOutParms) // @ game+0
	void HandleFlyDestroy(struct UAbilityComponentBase* InLauncher, struct FVector& ImpactPoint); // Function /Script/Game.AbilityComponentBase.HandleFlyDestroy // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	void HandleFlyAddShield(struct UAbilityComponentBase* InLauncher, float Value); // Function /Script/Game.AbilityComponentBase.HandleFlyAddShield // (Final|Native|Public|BlueprintCallable) // @ game+0
	void GMAttackMonitor(struct FGMRunDamageInfo InRunDamageInfo); // Function /Script/Game.AbilityComponentBase.GMAttackMonitor // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	struct UAvailableSkill* GetSkill(__int32 InID); // Function /Script/Game.AbilityComponentBase.GetSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	float GetRolePropertieValue(enum class EAttributeType AttrType, char Level); // Function /Script/Game.AbilityComponentBase.GetRolePropertieValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetRolePropertieMaxValue(enum class EAttributeType AttrType); // Function /Script/Game.AbilityComponentBase.GetRolePropertieMaxValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetRolePropertieClassValue(struct UAbilityAttribute* InAbility, char Level); // Function /Script/Game.AbilityComponentBase.GetRolePropertieClassValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetRolePropertieClassMaxValue(struct UAbilityAttribute* InAbility); // Function /Script/Game.AbilityComponentBase.GetRolePropertieClassMaxValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetRolePropertieBaseValue(enum class EAttributeType AttrType); // Function /Script/Game.AbilityComponentBase.GetRolePropertieBaseValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetPropertieValueFromString(struct FString RoleName); // Function /Script/Game.AbilityComponentBase.GetPropertieValueFromString // (Final|Native|Public|BlueprintCallable) // @ game+0
	float GetPropertieMaxValueFromString(struct FString RoleName); // Function /Script/Game.AbilityComponentBase.GetPropertieMaxValueFromString // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool GetPartBounceData(struct FBoneResult& PartResult, float& OutBouncePre, float& OutBounceExtraPre); // Function /Script/Game.AbilityComponentBase.GetPartBounceData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetMaxPriorityInCastingSkill(); // Function /Script/Game.AbilityComponentBase.GetMaxPriorityInCastingSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	__int32 GetInvalidSpecifiedSkill(); // Function /Script/Game.AbilityComponentBase.GetInvalidSpecifiedSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct TArray<__int32> GetEnchantEmitterIDs(); // Function /Script/Game.AbilityComponentBase.GetEnchantEmitterIDs // (Final|Native|Public|BlueprintCallable) // @ game+0
	void GetEnchantDamageTypes(struct TArray<enum class EModifyHPType>& DamageTypes, struct TArray<__int32>& EnchantIDs); // Function /Script/Game.AbilityComponentBase.GetEnchantDamageTypes // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<__int32> GetCastingSkillOriginIDs(); // Function /Script/Game.AbilityComponentBase.GetCastingSkillOriginIDs // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetCastingSkillIDInAnim(); // Function /Script/Game.AbilityComponentBase.GetCastingSkillIDInAnim // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<__int32> GetAllDeActiveDeriveSkills(); // Function /Script/Game.AbilityComponentBase.GetAllDeActiveDeriveSkills // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct TArray<__int32> GetAllActiveDeriveSkills(); // Function /Script/Game.AbilityComponentBase.GetAllActiveDeriveSkills // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct UAbilityAttribute* GetAbilityAttributeFromString(struct FString RoleName); // Function /Script/Game.AbilityComponentBase.GetAbilityAttributeFromString // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void ForceFinishSpecificSkill(__int32 SkillID); // Function /Script/Game.AbilityComponentBase.ForceFinishSpecificSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool FindQTESkill(__int32 ID); // Function /Script/Game.AbilityComponentBase.FindQTESkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<struct UModifier*> FindModifiersByTagName(struct FString TagName); // Function /Script/Game.AbilityComponentBase.FindModifiersByTagName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<struct UModifier*> FindModifiersByTag(struct FGameplayTag& Tag); // Function /Script/Game.AbilityComponentBase.FindModifiersByTag // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<struct UModifier*> FindModifiersByStateTagName(struct FString TagName, bool bExactMatch); // Function /Script/Game.AbilityComponentBase.FindModifiersByStateTagName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<struct UModifier*> FindModifiersByStateTag(struct FGameplayTag& Tag, bool bExactMatch); // Function /Script/Game.AbilityComponentBase.FindModifiersByStateTag // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct FModifierExhibitionData FindModifierDataInfoByRuntimeID(__int32 InRunTimeID); // Function /Script/Game.AbilityComponentBase.FindModifierDataInfoByRuntimeID // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FModifierExhibitionData FindModifierDataInfo(__int32 ID); // Function /Script/Game.AbilityComponentBase.FindModifierDataInfo // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct UModifier* FindModifierByRunTimeID(__int32 RunTimeID); // Function /Script/Game.AbilityComponentBase.FindModifierByRunTimeID // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct UModifier* FindModifierByID(__int32 ID, struct UAbilityComponentBase* InLauncher); // Function /Script/Game.AbilityComponentBase.FindModifierByID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<struct UModifier*> FindAllModifierByID(__int32 ID, struct UAbilityComponentBase* InLauncher); // Function /Script/Game.AbilityComponentBase.FindAllModifierByID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void FindAllModifier(struct TArray<struct UModifier*>& OutModifiers, struct UAbilityComponentBase* InLauncher); // Function /Script/Game.AbilityComponentBase.FindAllModifier // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void EndNewAbnormalControlStateNotify(float ProtectionDuration); // Function /Script/Game.AbilityComponentBase.EndNewAbnormalControlStateNotify // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void DealDamageEffect(bool bStart, struct FPreDamageResultData& PreDamageData); // Function /Script/Game.AbilityComponentBase.DealDamageEffect // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void DeActiveDeriveSkillByModifier(__int32 InModifierRunTimeID, struct TArray<__int32> DeriveSkillIDs); // Function /Script/Game.AbilityComponentBase.DeActiveDeriveSkillByModifier // (Final|Native|Public|BlueprintCallable) // @ game+0
	void Client_ShowCastSkillFailUMG(enum class EFightTipType InTipTyp); // Function /Script/Game.AbilityComponentBase.Client_ShowCastSkillFailUMG // (Net|Native|Event|Public|NetClient) // @ game+0
	void Client_RemoveAppliedModifier(struct FModifierExhibitionData Data); // Function /Script/Game.AbilityComponentBase.Client_RemoveAppliedModifier // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void Client_OverlaidAppliedModifier(struct FModifierSyncOverlapData Data); // Function /Script/Game.AbilityComponentBase.Client_OverlaidAppliedModifier // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void Client_OnPropertyChange(float CurrentVal, float MaxVal, enum class EAttributeType AttributeType, float OldValue, struct UAbilityComponentBase* InLauncher); // Function /Script/Game.AbilityComponentBase.Client_OnPropertyChange // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void Client_NotifyElemExplosionChange(struct AGamePlayerController* lpLuancherController, struct UAbilityComponentBase* lpOriginAbility, enum class EModifyHPType InType, float CurValue, float TriggerValue, float OutTime); // Function /Script/Game.AbilityComponentBase.Client_NotifyElemExplosionChange // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0
	void Client_NextXBulletAppliedModifier(__int32 ModifierID, __int32 NextXBullet); // Function /Script/Game.AbilityComponentBase.Client_NextXBulletAppliedModifier // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void Client_HitSound(struct UAbilityComponentBase* Target, __int32 ModifyResult, __int32 DamageOriginTypeID); // Function /Script/Game.AbilityComponentBase.Client_HitSound // (Net|Native|Event|Public|NetClient) // @ game+0
	void Client_HitPhysicalSimulated(struct UAbilityComponentBase* Target, struct FApplyHitPhysicalResultData HitPhysicalResult); // Function /Script/Game.AbilityComponentBase.Client_HitPhysicalSimulated // (Net|Native|Event|NetMulticast|Public) // @ game+0
	void Client_FreshModifierRemainTime(__int32 ModifierHashID, __int32 ModifierID, float RemainTime); // Function /Script/Game.AbilityComponentBase.Client_FreshModifierRemainTime // (Net|Native|Event|NetMulticast|Public) // @ game+0
	void Client_ClearAbnormalState(struct FString TypeName, bool bClearAll); // Function /Script/Game.AbilityComponentBase.Client_ClearAbnormalState // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void Client_AddAppliedModifier(struct FModifierExhibitionData Data); // Function /Script/Game.AbilityComponentBase.Client_AddAppliedModifier // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void ClearAllModifierOnDead(); // Function /Script/Game.AbilityComponentBase.ClearAllModifierOnDead // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ClearAbnormalState(struct FString TypeName, bool bClearAll); // Function /Script/Game.AbilityComponentBase.ClearAbnormalState // (Native|Public|BlueprintCallable) // @ game+0
	bool CheckSkillIDActive(__int32 InSkillId); // Function /Script/Game.AbilityComponentBase.CheckSkillIDActive // (Native|Public|BlueprintCallable) // @ game+0
	bool CheckModifyResultFlag(__int32 InResult, enum class EModifyHPResult InType); // Function /Script/Game.AbilityComponentBase.CheckModifyResultFlag // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool CheckInvalidSpecifiedSkill(__int32 InType); // Function /Script/Game.AbilityComponentBase.CheckInvalidSpecifiedSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool CheckEmitterIDActive(__int32 InEmitterID); // Function /Script/Game.AbilityComponentBase.CheckEmitterIDActive // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CheckEmitterActive(struct FEmitterInfo& InEmitter); // Function /Script/Game.AbilityComponentBase.CheckEmitterActive // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	float CharacterEnergyRecoverFunc(float InValue); // Function /Script/Game.AbilityComponentBase.CharacterEnergyRecoverFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	float CharacterEnergyDamageRecoverFunc(float HitEnergy, float CriticalHitEnergy, bool bCrit); // Function /Script/Game.AbilityComponentBase.CharacterEnergyDamageRecoverFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	float CharacterEnergyCostFunc(float InValue); // Function /Script/Game.AbilityComponentBase.CharacterEnergyCostFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	void CastSubSkill(__int32 InID, __int32 Level, struct AActor* Launcher, enum class ESkillCastType InType); // Function /Script/Game.AbilityComponentBase.CastSubSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void CastSkill(__int32 InID, enum class ESkillCastType InType, __int32 InLevel, bool bAutoCast, __int32 DelegateCastIndex); // Function /Script/Game.AbilityComponentBase.CastSkill // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0
	float BulletRecoverFunc(float InValue); // Function /Script/Game.AbilityComponentBase.BulletRecoverFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	float BullerCostFunc(float InValue); // Function /Script/Game.AbilityComponentBase.BullerCostFunc // (Final|Native|Public|BlueprintCallable) // @ game+0
	void BeginNewAbnormalControlStateNotify(); // Function /Script/Game.AbilityComponentBase.BeginNewAbnormalControlStateNotify // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	bool ApplyModifier(struct UModifier* Modifier); // Function /Script/Game.AbilityComponentBase.ApplyModifier // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct UAbilityComponentBase* ApplyAttributeChange(struct UAbilityComponentBase* TargetAbility, struct FAttributeChangeValue& ChangeInfo, struct FVector ApplyLocation, struct FVector OriginLocation); // Function /Script/Game.AbilityComponentBase.ApplyAttributeChange // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	void AppendHealthValue(struct UAbilityComponentBase* InLauncher, float fValue, struct FHealthChangeValue& HealthChange); // Function /Script/Game.AbilityComponentBase.AppendHealthValue // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void AddSpecificEnchantInfo(__int32 ID); // Function /Script/Game.AbilityComponentBase.AddSpecificEnchantInfo // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct TArray<struct UAvailableSkill*> AddSkill(__int32 InID, __int32 InLevel, bool bQTESkill, bool bWeaponSkill, __int32 InIndex); // Function /Script/Game.AbilityComponentBase.AddSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AddPartBounceData(struct FString& PartName, float InBouncePre, float InBounceExtraPre); // Function /Script/Game.AbilityComponentBase.AddPartBounceData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void AddEnmity(struct UAbilityComponentBase* TargetAbility, float Value, enum class EEnmityType Type, enum class EEnmityClearType ClearType); // Function /Script/Game.AbilityComponentBase.AddEnmity // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AddEnchantEmitter(__int32 InEmitterID, struct UAbilityComponentBase* EmitterSourceAbility, bool bApplyBySource, __int32 InLevel); // Function /Script/Game.AbilityComponentBase.AddEnchantEmitter // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AddEnchantDamageByName(struct FString NewDamageTypeName); // Function /Script/Game.AbilityComponentBase.AddEnchantDamageByName // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AddEnchantDamage(enum class EModifyHPType NewDamageType); // Function /Script/Game.AbilityComponentBase.AddEnchantDamage // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ActiveDeriveSkillByModifier(__int32 InModifierRunTimeID, struct TArray<__int32> DeriveSkillIDs); // Function /Script/Game.AbilityComponentBase.ActiveDeriveSkillByModifier // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AbilityComponent
// Size: 0x0 (Inherited: 0x0)
struct UAbilityComponent : UAbilityComponentBase {
	bool bCanFireNow; // 0x0(0x0)
	bool bAutoAimEnable; // 0x0(0x0)
	char pad_D5A[0x6]; // 0x0(0x0)
	struct FMulticastInlineDelegate OnCharacterDie; // 0x0(0x0)
	struct FMulticastInlineDelegate OnCharacterFire; // 0x0(0x0)
	struct FMulticastInlineDelegate OnCharacterFireStop; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAbnormalStateUpdate; // 0x0(0x0)
	struct FMulticastInlineDelegate FOnCurrentAbnormalStateReset; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAdditiveHitReceive; // 0x0(0x0)
	struct FMulticastInlineDelegate OnCastEnergyStorage; // 0x0(0x0)
	struct FMulticastInlineDelegate OnSkillReplace; // 0x0(0x0)
	struct FMulticastInlineDelegate OnCastSkillByIndex; // 0x0(0x0)
	char pad_DF0[0xC]; // 0x0(0x0)
	float RetainWeaponRaising; // 0x0(0x0)
	enum class ESkillActionType CurrentSkillActionType; // 0x0(0x0)
	bool bKeepWeaponRaisingOnSkillAnim; // 0x0(0x0)
	char pad_E02[0x6]; // 0x0(0x0)
	struct TArray<struct TWeakObjectPtr<struct UWeaponAbiliityComponent>> AccessoryAbilitys; // 0x0(0x0)
	__int32 ReloadSkill; // 0x0(0x0)
	char pad_E1C[0x4]; // 0x0(0x0)
	struct TArray<__int32> DodgeSkillIDs; // 0x0(0x0)
	struct TArray<__int32> CrossSkillIDs; // 0x0(0x0)
	struct TArray<__int32> BunkerInteractSkillIDs; // 0x0(0x0)
	struct TArray<__int32> BunkerEdgeBackSkillIDs; // 0x0(0x0)
	struct TArray<__int32> FireSkills; // 0x0(0x0)
	struct TArray<__int32> NormalSkillID1; // 0x0(0x0)
	struct TArray<__int32> NormalSkillID2; // 0x0(0x0)
	struct TArray<__int32> SupSkillID; // 0x0(0x0)
	struct TArray<__int32> ReplaceDodgeNormal; // 0x0(0x0)
	struct TArray<__int32> RushSkillID; // 0x0(0x0)
	struct TArray<__int32> SupportSkillID; // 0x0(0x0)
	struct TArray<struct FTempRelaceSkillData> TempReplaceSkill; // 0x0(0x0)
	struct TArray<struct FTempRelaceSkillData> DirtyTempSkill; // 0x0(0x0)
	char bIsSpawn : 1; // 0x0(0x0)
	char pad_EF0_1 : 7; // 0x0(0x0)
	char pad_EF1[0x7]; // 0x0(0x0)
	struct FTimerHandle PasueFrameCountdownTimerHandle; // 0x0(0x0)
	bool bPasueFrame; // 0x0(0x0)
	char pad_F01[0x13]; // 0x0(0x0)
	bool bWaitSKillBackBunker; // 0x0(0x0)
	char pad_F15[0x3]; // 0x0(0x0)

	void TickFreshExhibitionSkillInfo(float DeltaTime); // Function /Script/Game.AbilityComponent.TickFreshExhibitionSkillInfo // (Final|Native|Public|BlueprintCallable) // @ game+0
	void Server_CallOnCharacterFire(struct FFireInfo Info, bool bStartFire); // Function /Script/Game.AbilityComponent.Server_CallOnCharacterFire // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void ReplaceSkillAtIndex(__int32 ArrayIndex, __int32 SkillID, float ActiveTime, __int32 SymbiosisModifierID); // Function /Script/Game.AbilityComponent.ReplaceSkillAtIndex // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ReceiveAdditiveHitNotify(struct FVector HitDirection, float Strength, struct FString BoneName); // Function /Script/Game.AbilityComponent.ReceiveAdditiveHitNotify // (Net|Native|Event|NetMulticast|Public|HasDefaults) // @ game+0
	void ReceiveAbnormalNotify(struct FAbnormalInfo AbnormalInfo, bool bAdd, bool bNewApply, bool bForceRemove); // Function /Script/Game.AbilityComponent.ReceiveAbnormalNotify // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void PlayerExitBunkerLeaned(bool bFireStop, bool bAimStop); // Function /Script/Game.AbilityComponent.PlayerExitBunkerLeaned // (Final|Native|Public|BlueprintCallable) // @ game+0
	void PlayerEnterBunkerLeaned(); // Function /Script/Game.AbilityComponent.PlayerEnterBunkerLeaned // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsRushSkill(__int32 SkillID); // Function /Script/Game.AbilityComponent.IsRushSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool IsRunAdvancedAction(); // Function /Script/Game.AbilityComponent.IsRunAdvancedAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsReloadSkillForMontage(struct UAnimMontage* InMontage); // Function /Script/Game.AbilityComponent.IsReloadSkillForMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool IsReloadSkill(__int32 ID); // Function /Script/Game.AbilityComponent.IsReloadSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsQTESkill(__int32 ID); // Function /Script/Game.AbilityComponent.IsQTESkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInStaySkill(); // Function /Script/Game.AbilityComponent.IsInStaySkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsDodgeStopAdvance(); // Function /Script/Game.AbilityComponent.IsDodgeStopAdvance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsDodgeSkill(__int32 ID); // Function /Script/Game.AbilityComponent.IsDodgeSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsCrossSkill(__int32 ID); // Function /Script/Game.AbilityComponent.IsCrossSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsBunkerSkill(__int32 ID); // Function /Script/Game.AbilityComponent.IsBunkerSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsBunkerEdgeBackSkill(__int32 ID); // Function /Script/Game.AbilityComponent.IsBunkerEdgeBackSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsBlendToAdvanceAction(); // Function /Script/Game.AbilityComponent.IsBlendToAdvanceAction // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsAdvancedAction(); // Function /Script/Game.AbilityComponent.IsAdvancedAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void GetTempSkillRemainingActiveTime(__int32 Index, float& CurrentTime, float& MaxTime); // Function /Script/Game.AbilityComponent.GetTempSkillRemainingActiveTime // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	enum class ERecordSkillCostType GetSkillTypeOfRecord(__int32 SkillID); // Function /Script/Game.AbilityComponent.GetSkillTypeOfRecord // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetSkillIndexBySelf(__int32 SkillID); // Function /Script/Game.AbilityComponent.GetSkillIndexBySelf // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetSkillIndexByAll(__int32 SkillID); // Function /Script/Game.AbilityComponent.GetSkillIndexByAll // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetSkillIndex(__int32 SkillID); // Function /Script/Game.AbilityComponent.GetSkillIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<__int32> GetSkillGroupByIndex(__int32 Index); // Function /Script/Game.AbilityComponent.GetSkillGroupByIndex // (Final|Native|Public|BlueprintCallable) // @ game+0
	__int32 GetMasterSkillIndex(__int32 SkillID); // Function /Script/Game.AbilityComponent.GetMasterSkillIndex // (Final|Native|Public|BlueprintCallable) // @ game+0
	enum class ESkillCastFailType GetDodgeSkillCastFailType(__int32 DodgeIndex); // Function /Script/Game.AbilityComponent.GetDodgeSkillCastFailType // (Final|Native|Public|BlueprintCallable) // @ game+0
	enum class EButtonType GetButtonTypeByIndex(__int32 Index); // Function /Script/Game.AbilityComponent.GetButtonTypeByIndex // (Final|Native|Public|BlueprintCallable) // @ game+0
	enum class EButtonCastType GetButtonCastTypeByIndex(__int32 Index); // Function /Script/Game.AbilityComponent.GetButtonCastTypeByIndex // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct TArray<struct UWeaponAbiliityComponent*> GetAllAccessoryAbilities(); // Function /Script/Game.AbilityComponent.GetAllAccessoryAbilities // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CheckSkillCastableByIndex(__int32 Index); // Function /Script/Game.AbilityComponent.CheckSkillCastableByIndex // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CheckEnterBunkerSkillStop(__int32 InSkillId); // Function /Script/Game.AbilityComponent.CheckEnterBunkerSkillStop // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool CheckDodgeSkill(__int32 DodgeIndex); // Function /Script/Game.AbilityComponent.CheckDodgeSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CheckCrossSkill(__int32 CrossIndex); // Function /Script/Game.AbilityComponent.CheckCrossSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CheckBunkerInteractSkill(__int32 BunkerInteractIndex); // Function /Script/Game.AbilityComponent.CheckBunkerInteractSkill // (Final|Native|Public|BlueprintCallable) // @ game+0
	void CastSkillIgnoreSkillCondition(__int32 SkillID); // Function /Script/Game.AbilityComponent.CastSkillIgnoreSkillCondition // (Final|Native|Public|BlueprintCallable) // @ game+0
	void CastSkillByIndex(__int32 Index, enum class ESkillCastType InType, float PressTime); // Function /Script/Game.AbilityComponent.CastSkillByIndex // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void CastReloadSkill(bool bIsAutoReload); // Function /Script/Game.AbilityComponent.CastReloadSkill // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void CastFightPowerToRushFail(); // Function /Script/Game.AbilityComponent.CastFightPowerToRushFail // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CastFightPowerFail(__int32 SkillIndex); // Function /Script/Game.AbilityComponent.CastFightPowerFail // (Final|Native|Public|BlueprintCallable) // @ game+0
	void CastDodgeSkill(__int32 DodgeIndex); // Function /Script/Game.AbilityComponent.CastDodgeSkill // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void CastCrossSkill(__int32 CrossIndex); // Function /Script/Game.AbilityComponent.CastCrossSkill // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void CastBunkerInteractSkill(__int32 BunkerInteractIndex); // Function /Script/Game.AbilityComponent.CastBunkerInteractSkill // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void CastAccessorySkill(__int32 ID); // Function /Script/Game.AbilityComponent.CastAccessorySkill // (Native|Public|BlueprintCallable) // @ game+0
	void CallOnCharacterFire(struct FFireInfo Info, bool bStartFire); // Function /Script/Game.AbilityComponent.CallOnCharacterFire // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AbilityComponent_AI
// Size: 0x0 (Inherited: 0x0)
struct UAbilityComponent_AI : UAbilityComponent {
};

 // Class /Script/Game.AbilityComponent_Bunker
// Size: 0x0 (Inherited: 0x0)
struct UAbilityComponent_Bunker : UAbilityComponent {
};

 // Class /Script/Game.AbilityComponent_Destructible
// Size: 0x0 (Inherited: 0x0)
struct UAbilityComponent_Destructible : UAbilityComponentBase {
	struct UAbilityComponentBase* ParenAbility; // 0x0(0x0)
};

 // Class /Script/Game.AbilityComponent_KillZone
// Size: 0x0 (Inherited: 0x0)
struct UAbilityComponent_KillZone : UAbilityComponentBase {
};

 // Class /Script/Game.AbilityComponent_LevelDrop
// Size: 0x0 (Inherited: 0x0)
struct UAbilityComponent_LevelDrop : UAbilityComponentBase {
};

 // Class /Script/Game.MagicAssets
// Size: 0x0 (Inherited: 0x0)
struct UMagicAssets : UDataAsset {
	struct FString MagicName; // 0x0(0x0)
	struct FString MarkInfo; // 0x0(0x0)
	struct TArray<struct FParamInfo> Params; // 0x0(0x0)
	bool bOnBulletHit; // 0x0(0x0)
	bool bPreDeadExec; // 0x0(0x0)
	bool bDeadCheck; // 0x0(0x0)
	bool bCheckHitType; // 0x0(0x0)
	char pad_64[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.ModifierPostProcess
// Size: 0x0 (Inherited: 0x0)
struct UModifierPostProcess : UObject {
	enum class EPostProcessType ProcessType; // 0x0(0x0)
	char pad_29[0x7]; // 0x0(0x0)
	struct UPostProcessParams* Params; // 0x0(0x0)
};

 // Class /Script/Game.ModifierSpecialEffectObject
// Size: 0x0 (Inherited: 0x0)
struct UModifierSpecialEffectObject : UObject {
	char pad_28[0xC]; // 0x0(0x0)
	__int32 EffectType; // 0x0(0x0)
	struct TArray<struct FParamInfo> Params; // 0x0(0x0)
	struct TWeakObjectPtr<struct UAbilityComponentBase> Launcher; // 0x0(0x0)
	struct TWeakObjectPtr<struct UWeaponFireModifierEffect> FireModifierEffect; // 0x0(0x0)
	struct TWeakObjectPtr<struct UModifier> OwnerModifier; // 0x0(0x0)
	__int32 Level; // 0x0(0x0)
	char pad_64[0x4]; // 0x0(0x0)
	struct TArray<struct FModifierDamageEffect> BulletDamageEffects; // 0x0(0x0)
	struct TMap<unsigned __int32, struct UCastConditionCheck*> DamageEffectConditions; // 0x0(0x0)
	struct TArray<struct FAttributeChangeValue> CacheTempEffectChangeValue; // 0x0(0x0)

	void ReceiveOnWeaponFire(char ForceShootCount); // Function /Script/Game.ModifierSpecialEffectObject.ReceiveOnWeaponFire // (Event|Public|BlueprintEvent) // @ game+0
	void OnNotifyModifyHealth(bool bStart, struct FPreDamageResultData& PreDamageData, bool bClearTempAttribute); // Function /Script/Game.ModifierSpecialEffectObject.OnNotifyModifyHealth // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct AFireBullet* K2_WeaponSpawnSpecialBullet(struct AActor* lpOwner, struct UWeaponAbiliityComponent* AccessoryAbility, struct FVector& nStartPosition, struct FVector& nShootDirection, __int32 BulletID); // Function /Script/Game.ModifierSpecialEffectObject.K2_WeaponSpawnSpecialBullet // (Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	void K2_ReceiveTrigger(struct UAbilityComponentBase* InTarget, struct FVector& ApplyLocation, struct FQueryResult& Result); // Function /Script/Game.ModifierSpecialEffectObject.K2_ReceiveTrigger // (Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_ReceiveInitialize(struct TArray<struct FParamInfo>& Info); // Function /Script/Game.ModifierSpecialEffectObject.K2_ReceiveInitialize // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_ReceiveDeActive(); // Function /Script/Game.ModifierSpecialEffectObject.K2_ReceiveDeActive // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_ReceiveActive(); // Function /Script/Game.ModifierSpecialEffectObject.K2_ReceiveActive // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0
	void K2_OnNotifyActiveChanged(bool bNewActive); // Function /Script/Game.ModifierSpecialEffectObject.K2_OnNotifyActiveChanged // (Event|Public|BlueprintEvent) // @ game+0
	float K2_GetBulletExtraDamageScaler(); // Function /Script/Game.ModifierSpecialEffectObject.K2_GetBulletExtraDamageScaler // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	float K2_GetBulletExtraDamage(); // Function /Script/Game.ModifierSpecialEffectObject.K2_GetBulletExtraDamage // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	float K2_GetBulletExtraCritical(); // Function /Script/Game.ModifierSpecialEffectObject.K2_GetBulletExtraCritical // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	void K2_BulletHitTarger(struct UAbilityComponentBase* InTarget, struct FVector& ApplyLocation, struct FQueryResult& Result, bool bBeforeDamage, __int32 FireTimeId); // Function /Script/Game.ModifierSpecialEffectObject.K2_BulletHitTarger // (Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0
	struct UAbilityComponentBase* GetLuancher(enum class EModifierExecEmitterType InType); // Function /Script/Game.ModifierSpecialEffectObject.GetLuancher // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetBulletExtraDamageScaler(); // Function /Script/Game.ModifierSpecialEffectObject.GetBulletExtraDamageScaler // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetBulletExtraDamage(); // Function /Script/Game.ModifierSpecialEffectObject.GetBulletExtraDamage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetBulletExtraCritical(); // Function /Script/Game.ModifierSpecialEffectObject.GetBulletExtraCritical // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.CalcAttributeSpecialFunction
// Size: 0x0 (Inherited: 0x0)
struct UCalcAttributeSpecialFunction : UObject {

	float CaclValue(struct UAbilityComponentBase* InLauncher, struct UAbilityComponentBase* InTarget, struct TArray<struct FParamInfo>& Params, struct FPreDamageResultData& PreDamageData, __int32 InSkillLevel); // Function /Script/Game.CalcAttributeSpecialFunction.CaclValue // (Native|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0
};

 // Class /Script/Game.GMAttribute
// Size: 0x0 (Inherited: 0x0)
struct UGMAttribute : UObject {
	struct FString Name; // 0x0(0x0)
	struct FString CardNum; // 0x0(0x0)
	struct FString SupportNum; // 0x0(0x0)
	struct FString WeaponNum; // 0x0(0x0)
	struct FString TotalNum; // 0x0(0x0)
	struct FString TotalNum2; // 0x0(0x0)
};

 // Class /Script/Game.AbilityFunctionLibrary
// Size: 0x0 (Inherited: 0x0)
struct UAbilityFunctionLibrary : UBlueprintFunctionLibrary {

	void WriteKeyToCurveFloat(struct UCurveFloat* Curve, float Time, float Value); // Function /Script/Game.AbilityFunctionLibrary.WriteKeyToCurveFloat // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	float VerifyRealDistance(struct FVector& StartLoc, struct FQueryResult& QR, enum class ESearchTargetPartType PartType); // Function /Script/Game.AbilityFunctionLibrary.VerifyRealDistance // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool StateBlockTypeCheck(struct UAbilityComponentBase* CheckTarget, struct TArray<struct FString> BlockType); // Function /Script/Game.AbilityFunctionLibrary.StateBlockTypeCheck // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void SaveStringToSpecificFile(struct FString Filename, struct FString Content); // Function /Script/Game.AbilityFunctionLibrary.SaveStringToSpecificFile // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void ResetCurve(struct UCurveFloat* Curve); // Function /Script/Game.AbilityFunctionLibrary.ResetCurve // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsWithSquareInfo(struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Square& SquareInfo, struct UAbilityComponentBase* Querier, struct FTargetsQueryInfo& QueryInfo, struct FQueryExcuInfo& ExcuInfo); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsWithSquareInfo // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsWithEmitterInfoForTransform(struct UAbilityComponentBase* Querier, struct AActor* CastActor, struct AGameCharacter* Instigator, __int32 EmitterID); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsWithEmitterInfoForTransform // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsWithEmitterInfoForModifier(struct UAbilityComponentBase* Querier, struct AActor* CastActor, __int32 EmitterID, struct AActor* ModifierOwner); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsWithEmitterInfoForModifier // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsWithEmitterInfo(struct UAbilityComponentBase* Querier, struct AActor* CastActor, struct AGameCharacter* Instigator, __int32 EmitterID); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsWithEmitterInfo // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsWithCylinderInfo(struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Cylinder& CylinderInfo, struct UAbilityComponentBase* Querier, struct FTargetsQueryInfo& QueryInfo, struct FQueryExcuInfo& ExcuInfo); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsWithCylinderInfo // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsWithCircleInfoInCreateCollision(struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Circle& CircleInfo, struct UAbilityComponentBase* Querier, struct FTargetsQueryInfo& QueryInfo, struct FQueryExcuInfo& ExcuInfo); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsWithCircleInfoInCreateCollision // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsWithCircleInfo(struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Circle& CircleInfo, struct UAbilityComponentBase* Querier, struct FTargetsQueryInfo& QueryInfo, struct FQueryExcuInfo& ExcuInfo); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsWithCircleInfo // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsWithCapsuleInfo(struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Capsual& CapsuleInfo, struct UAbilityComponentBase* Querier, struct FTargetsQueryInfo& QueryInfo, struct FQueryExcuInfo& ExcuInfo); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsWithCapsuleInfo // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryTargetsInQuerierTrap(struct UAbilityComponentBase* Querier, enum class EApplyLocationType LocationType, float RandRadius); // Function /Script/Game.AbilityFunctionLibrary.QueryTargetsInQuerierTrap // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryRandomLocWithSquareInfo(__int32 Num, enum class EApplyLocationType LocationType, struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Square& SquareInfo, struct UAbilityComponentBase* Querier); // Function /Script/Game.AbilityFunctionLibrary.QueryRandomLocWithSquareInfo // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryRandomLocWithCylinder(__int32 Num, enum class EApplyLocationType LocationType, struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Cylinder& CylinderInfo, struct UAbilityComponentBase* Querier); // Function /Script/Game.AbilityFunctionLibrary.QueryRandomLocWithCylinder // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryRandomLocWithCircleInfo(__int32 Num, enum class EApplyLocationType LocationType, struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Circle& CircleInfo, struct UAbilityComponentBase* Querier); // Function /Script/Game.AbilityFunctionLibrary.QueryRandomLocWithCircleInfo // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FQueryResult> QueryRandomLocWithCapsule(__int32 Num, enum class EApplyLocationType LocationType, struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Capsual& CapsualInfo, struct UAbilityComponentBase* Querier); // Function /Script/Game.AbilityFunctionLibrary.QueryRandomLocWithCapsule // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool QueryEqual(struct FQueryResult& Query1, struct FQueryResult& Query2); // Function /Script/Game.AbilityFunctionLibrary.QueryEqual // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<struct AActor*> QueryCharacterAndAccessoryWithCircleInfo(struct FVector& CenterLocation, struct FRotator& Rotator, struct FSearchShape_Circle& CircleInfo, enum class ETargetType TargetType, struct UAbilityComponentBase* Querier, bool bUseRelationCheck, struct TArray<enum class ECampRelation> TargetRelations, struct FGameplayTagContainer AccessoryTagContainer); // Function /Script/Game.AbilityFunctionLibrary.QueryCharacterAndAccessoryWithCircleInfo // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool ProcessBpFunction(struct UObject* ObjectRef, struct FName& FuncName); // Function /Script/Game.AbilityFunctionLibrary.ProcessBpFunction // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FVector MultiLIneTraceToBlockLocation(struct USkillEmitter* EmitterRef, bool bApplyEffect, struct FTransform& Transform, struct FBulletInfo& RayInfo, float RayMaxDistance); // Function /Script/Game.AbilityFunctionLibrary.MultiLIneTraceToBlockLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct FQueryResult MakeQueryResult_SpecificLocation(struct AActor* Target, struct FVector Location); // Function /Script/Game.AbilityFunctionLibrary.MakeQueryResult_SpecificLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	struct FQueryResult MakeQueryResult_AdjustToTarget(struct AActor* Target, enum class EApplyLocationType LocationType, float RandRadius); // Function /Script/Game.AbilityFunctionLibrary.MakeQueryResult_AdjustToTarget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool LoadStringToSpecificFile(struct FString Filename, struct FString& Content); // Function /Script/Game.AbilityFunctionLibrary.LoadStringToSpecificFile // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FHitResult LineTraceSingle(struct FVector& StartLoc, struct FVector& EndLoc, enum class ECollisionChannel Channel, struct AActor* Launcher, struct TArray<struct AActor*>& IgnoreActors); // Function /Script/Game.AbilityFunctionLibrary.LineTraceSingle // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct TArray<struct FHitResult> LineTraceMulti(struct FVector& StartLoc, struct FVector& EndLoc, enum class ECollisionChannel Channel, struct AActor* Launcher, struct TArray<struct AActor*>& IgnoreActors, bool bOnlyCharacter); // Function /Script/Game.AbilityFunctionLibrary.LineTraceMulti // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool IsServer(struct AActor* Outer); // Function /Script/Game.AbilityFunctionLibrary.IsServer // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsRelavantSkill(__int32 SkillID1, __int32 SkillID2); // Function /Script/Game.AbilityFunctionLibrary.IsRelavantSkill // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsMasterSkill(struct UAbilityComponent* InAbility, __int32 InSkillId, __int32 InType); // Function /Script/Game.AbilityFunctionLibrary.IsMasterSkill // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsMainSkill(struct UAbilityComponent* InAbility, __int32 InSkillId, __int32 InType); // Function /Script/Game.AbilityFunctionLibrary.IsMainSkill // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsLocationInSquare(struct FVector& TargetLoc, struct FVector& CenterLoc, struct FRotator& Rotator, struct FSearchShape_Square& SquareInfo); // Function /Script/Game.AbilityFunctionLibrary.IsLocationInSquare // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool IsLocationInCylinder(struct FVector& TargetLoc, struct FVector& CenterLoc, struct FRotator& Rotator, struct FSearchShape_Cylinder& CylinderInfo); // Function /Script/Game.AbilityFunctionLibrary.IsLocationInCylinder // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool IsLocationInCircle(struct FVector& TargetLoc, struct FVector& CenterLoc, struct FRotator& Rotator, struct FSearchShape_Circle& CircleInfo); // Function /Script/Game.AbilityFunctionLibrary.IsLocationInCircle // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool IsLocationInCapsule(struct FVector& TargetLoc, struct FVector& CenterLoc, struct FRotator& Rotator, struct FSearchShape_Capsual& CapsualInfo); // Function /Script/Game.AbilityFunctionLibrary.IsLocationInCapsule // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool IsJustNeedModifierToState(struct UAbilityComponentBase* CheckTarget, struct FString StateName, __int32 ModifierID); // Function /Script/Game.AbilityFunctionLibrary.IsJustNeedModifierToState // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsJustNeedAbnormalToState(struct UAbilityComponentBase* CheckTarget, struct FString StateName, enum class EAbnormalState AbnormalState); // Function /Script/Game.AbilityFunctionLibrary.IsJustNeedAbnormalToState // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsIgnoreStateBlockTypes(struct UAbilityComponentBase* CheckTarget, struct TArray<struct FString> StateNames, bool bCheckAnd); // Function /Script/Game.AbilityFunctionLibrary.IsIgnoreStateBlockTypes // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsIgnoreOneStateBlockType(struct UAbilityComponentBase* CheckTarget, struct FString StateName); // Function /Script/Game.AbilityFunctionLibrary.IsIgnoreOneStateBlockType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsEnermy(struct AActor* Launcher, struct AActor* Target); // Function /Script/Game.AbilityFunctionLibrary.IsEnermy // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsClient(struct AActor* Outer); // Function /Script/Game.AbilityFunctionLibrary.IsClient // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsBpFunctionExsit(struct UObject* ObjectRef, struct FName& FuncName); // Function /Script/Game.AbilityFunctionLibrary.IsBpFunctionExsit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	bool IsActorBelongToTarget(struct AActor* CheckActor, struct AActor* CheckTarget); // Function /Script/Game.AbilityFunctionLibrary.IsActorBelongToTarget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool IsAbnormalModifierID(__int32 ModifierID); // Function /Script/Game.AbilityFunctionLibrary.IsAbnormalModifierID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct ACharacterAccessory* GetWeaponClass(__int32 WeaponID); // Function /Script/Game.AbilityFunctionLibrary.GetWeaponClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<struct FValueRangeInfo> GetValueRangeInfoArray(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetValueRangeInfoArray // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FSkillInfo GetSuperSkillInfoFromCharacterID(__int32 CharacterTemplateID); // Function /Script/Game.AbilityFunctionLibrary.GetSuperSkillInfoFromCharacterID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<float> GetStringfloatArrayValue(struct FString Info); // Function /Script/Game.AbilityFunctionLibrary.GetStringfloatArrayValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<struct FString> GetStringArrayValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetStringArrayValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FVector GetSocketLocationFromActor(struct FName Socket, struct AActor* Target); // Function /Script/Game.AbilityFunctionLibrary.GetSocketLocationFromActor // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	__int32 GetSkillDamageType(struct FString InStrSkillClass); // Function /Script/Game.AbilityFunctionLibrary.GetSkillDamageType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	__int32 GetSkillClassType(struct FString InStrSkillClass); // Function /Script/Game.AbilityFunctionLibrary.GetSkillClassType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	__int32 GetResizeNumParamsFromAbnormalState(enum class EAbnormalState AbnormalType); // Function /Script/Game.AbilityFunctionLibrary.GetResizeNumParamsFromAbnormalState // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	enum class ECampRelation GetRelationBetweenAWithB(struct AActor* TargetA, struct AActor* TargetB); // Function /Script/Game.AbilityFunctionLibrary.GetRelationBetweenAWithB // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	enum class ECampRelation GetRelation(struct AActor* Launcher, struct AActor* Target); // Function /Script/Game.AbilityFunctionLibrary.GetRelation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void GetQueryResultsFromHitResult(struct TArray<struct FHitResult>& HitResults, struct UAbilityComponentBase* Querier, struct FTargetsQueryInfo& QueryInfo, struct FQueryExcuInfo& ExcuInfo, struct TArray<struct FQueryResult>& QueryResults); // Function /Script/Game.AbilityFunctionLibrary.GetQueryResultsFromHitResult // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TMap<struct FVector2D, struct FColor> GetPictureRGBFromPath(struct FString Filename, __int32& XSize, __int32& YSize, __int32 Interval); // Function /Script/Game.AbilityFunctionLibrary.GetPictureRGBFromPath // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FBoneResult GetPartResult(struct FHitResult& HitResult); // Function /Script/Game.AbilityFunctionLibrary.GetPartResult // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FBoneResult GetPartitionResult(struct FHitResult& HitResult); // Function /Script/Game.AbilityFunctionLibrary.GetPartitionResult // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	__int32 GetParamintValueForLevel(struct FParamInfo& Info, __int32 InLevel); // Function /Script/Game.AbilityFunctionLibrary.GetParamintValueForLevel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetParamintValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetParamintValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<__int32> GetParamInt32ArrayValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetParamInt32ArrayValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	void GetParamGDPLValue(struct FParamInfo& Info, __int32& G, __int32& D, __int32& P, __int32& L); // Function /Script/Game.AbilityFunctionLibrary.GetParamGDPLValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	float GetParamfloatValueForLevel(struct FParamInfo& Info, __int32 InLevel); // Function /Script/Game.AbilityFunctionLibrary.GetParamfloatValueForLevel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0
	float GetParamfloatValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetParamfloatValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<float> GetParamfloatArrayValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetParamfloatArrayValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	bool GetParamboolValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetParamboolValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct AGameCharacter* GetOriginPlayerByAbility(struct UAbilityComponentBase* InAbility); // Function /Script/Game.AbilityFunctionLibrary.GetOriginPlayerByAbility // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct AGameCharacter* GetOriginPlayer(struct AGameCharacter* InCharacter); // Function /Script/Game.AbilityFunctionLibrary.GetOriginPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	__int64 GetObjectHashIndex(struct UObject* ObjectRef); // Function /Script/Game.AbilityFunctionLibrary.GetObjectHashIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetHitTypeForHit(struct FHitResult& InHit, float& DamageScale, bool bFindScaredCrow); // Function /Script/Game.AbilityFunctionLibrary.GetHitTypeForHit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	float GetHitType(struct AActor* InTarget, struct FBoneResult& InResult, enum class EEmitterDamageType OverrideDamageType, bool& bWeaknessDamage, bool& bInefficientDamage); // Function /Script/Game.AbilityFunctionLibrary.GetHitType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	__int32 GetHitPartType(struct AActor* InTarget, struct FBoneResult& InResult, float& DamageScale); // Function /Script/Game.AbilityFunctionLibrary.GetHitPartType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FVector GetFVectorValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetFVectorValue // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct FVector2D GetFVector2DValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetFVector2DValue // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct FRotator GetFRotatorValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetFRotatorValue // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool GetEmitterResult(struct UAbilityComponentBase* AbilityQuerier, __int32 SkillID, __int32 EmitterID, struct TArray<struct FQueryResult>& Queries); // Function /Script/Game.AbilityFunctionLibrary.GetEmitterResult // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FVector GetCheckActorLocation(enum class EHitOriginLocation HitLocationType, struct AActor* CheckActor, struct FString OriginSocketName); // Function /Script/Game.AbilityFunctionLibrary.GetCheckActorLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	struct USceneComponent* GetCharacterMeshComponentBySocket(struct FName Socket, struct AGameCharacter* Character); // Function /Script/Game.AbilityFunctionLibrary.GetCharacterMeshComponentBySocket // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<enum class ECampRelation> GetCampRelationValue(struct FParamInfo& Info); // Function /Script/Game.AbilityFunctionLibrary.GetCampRelationValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<struct UModifier*> GetBlockStateModifiersInTarget(struct UAbilityComponentBase* CheckTarget, struct TArray<struct FString> BlockType); // Function /Script/Game.AbilityFunctionLibrary.GetBlockStateModifiersInTarget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct TArray<enum class EAppointTargetType> GetAppointTargetType(struct AActor* Launcher, struct AActor* Target, bool& bHasResult); // Function /Script/Game.AbilityFunctionLibrary.GetAppointTargetType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<struct AGameCharacter*> GetAllAppendage(struct AGameCharacter* AppendageOwner); // Function /Script/Game.AbilityFunctionLibrary.GetAllAppendage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void GetAllAbility(struct UObject* WorldContextObject, struct TArray<struct UAbilityComponentBase*>& OutAllAbility); // Function /Script/Game.AbilityFunctionLibrary.GetAllAbility // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FString FormatRGBResultToString(__int32 XSize, __int32 YSize, struct TMap<struct FVector2D, struct FColor>& Points); // Function /Script/Game.AbilityFunctionLibrary.FormatRGBResultToString // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	bool FindTeleportSpot(struct AActor* TestActor, struct FVector TestLocation, struct FRotator TestRotation, struct FVector& ResultLoc); // Function /Script/Game.AbilityFunctionLibrary.FindTeleportSpot // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	struct FName FindTargetViewPoint(struct USceneComponent* TargetComponent, struct FVector& OutWorldLocation, struct FVector& OutOffsetLocaiton); // Function /Script/Game.AbilityFunctionLibrary.FindTargetViewPoint // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0
	struct FVector FindTargetFloorPoint(struct AActor* Target); // Function /Script/Game.AbilityFunctionLibrary.FindTargetFloorPoint // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	struct FVector FindLocationFloorPoint(struct AActor* QueryLauncher, struct FVector TargetLocation); // Function /Script/Game.AbilityFunctionLibrary.FindLocationFloorPoint // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	void FindCollisionClassAndFindAttachToTarget(struct USkeletalMeshComponent* MeshComp, struct FName& CollisionTag, __int32 SkillLevel, struct UAnimNotifyState_NewCollision* AnimNotifyState); // Function /Script/Game.AbilityFunctionLibrary.FindCollisionClassAndFindAttachToTarget // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	void FindAndDestroyCollisionComponent(struct USkeletalMeshComponent* MeshComp, struct FName& CollisionTag); // Function /Script/Game.AbilityFunctionLibrary.FindAndDestroyCollisionComponent // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FVector FindActorViewPoint(struct AActor* InActor); // Function /Script/Game.AbilityFunctionLibrary.FindActorViewPoint // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0
	bool CheckWeaknessPart(struct AActor* InTarget, struct FBoneResult& InResult); // Function /Script/Game.AbilityFunctionLibrary.CheckWeaknessPart // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	bool CheckSkillDamageType(enum class EModifyHPType DamageType, __int32 InType); // Function /Script/Game.AbilityFunctionLibrary.CheckSkillDamageType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool CheckSkillClassType(struct UAbilityComponent* InAbility, __int32 InSkillId, __int32 InType); // Function /Script/Game.AbilityFunctionLibrary.CheckSkillClassType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool CheckRelation(enum class ECampRelation Relation, struct AActor* Launcher, struct AActor* Target); // Function /Script/Game.AbilityFunctionLibrary.CheckRelation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct FVector CalcShootPosition(struct AGameCharacter* Querier); // Function /Script/Game.AbilityFunctionLibrary.CalcShootPosition // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	bool BoneResultEqual(struct FBoneResult& Query1, struct FBoneResult& Query2); // Function /Script/Game.AbilityFunctionLibrary.BoneResultEqual // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0
	struct TMap<struct FVector2D, struct FColor> AnalysisStringToRGBResult(struct FString Content, __int32& XSize, __int32& YSize); // Function /Script/Game.AbilityFunctionLibrary.AnalysisStringToRGBResult // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	void AddCharacterOffset(struct AGameCharacter* CharacterRef, struct FVector Offset); // Function /Script/Game.AbilityFunctionLibrary.AddCharacterOffset // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AbilityLibrary
// Size: 0x0 (Inherited: 0x0)
struct UAbilityLibrary : UBlueprintFunctionLibrary {

	void StartOrderTransparentMarking(struct AActor* TargetOwner, struct AActor* Marker); // Function /Script/Game.AbilityLibrary.StartOrderTransparentMarking // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void StartNoReceiveDecals(struct AActor* Actor); // Function /Script/Game.AbilityLibrary.StartNoReceiveDecals // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void RemoveCircleWarning(__int32 ID); // Function /Script/Game.AbilityLibrary.RemoveCircleWarning // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void ReleaceSkillDesc(struct FString FilePath, __int32 InHeaderLine, struct FString EndName); // Function /Script/Game.AbilityLibrary.ReleaceSkillDesc // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	__int32 MakeRenderStatePriority(__int32 EffectType, __int32 Priority); // Function /Script/Game.AbilityLibrary.MakeRenderStatePriority // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	__int32 MakePostProcessPriority(__int32 EffectType, __int32 Priority); // Function /Script/Game.AbilityLibrary.MakePostProcessPriority // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void KeepTwoValidDecimal(float InValue, struct FString& OutString); // Function /Script/Game.AbilityLibrary.KeepTwoValidDecimal // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<struct FSkillDescribeValue> GetSkillValueForArray(struct TArray<struct FString>& AllParams, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetSkillValueForArray // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<struct FSkillDescribeValue> GetSkillValue(struct FString InParam, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetSkillValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	struct FSoftObjectPath GetSkillIcon(__int32 InSkillId); // Function /Script/Game.AbilityLibrary.GetSkillIcon // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	struct FSoftObjectPath GetSkillFixInfoStaticId(__int32 nFixId); // Function /Script/Game.AbilityLibrary.GetSkillFixInfoStaticId // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
	struct FString GetSkillDescribe(struct FString InDesc, struct TArray<struct FString>& AllParams, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetSkillDescribe // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	float GetSkillCharacterEnergyCost(__int32 InSkillId, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetSkillCharacterEnergyCost // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	float GetMapValueForLevel(struct TMap<__int32, float>& InMapValue, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetMapValueForLevel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetIntMapValueForLevel(struct TMap<__int32, __int32>& InMapValue, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetIntMapValueForLevel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0
	float GetIntArrayValueForLevel(struct TArray<__int32>& Value, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetIntArrayValueForLevel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	float GetFloatValueStringForLevel(struct FString Value, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetFloatValueStringForLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	float GetFloatArrayValueForLevel(struct TArray<float>& Value, __int32 InLevel); // Function /Script/Game.AbilityLibrary.GetFloatArrayValueForLevel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct FString FormatDescribe(struct FString InDesc, struct TArray<struct FString>& InParams); // Function /Script/Game.AbilityLibrary.FormatDescribe // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	void EndOrderTransparentMarking(struct AActor* TargetOwner); // Function /Script/Game.AbilityLibrary.EndOrderTransparentMarking // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void EndNoReceiveDecals(struct AActor* Actor); // Function /Script/Game.AbilityLibrary.EndNoReceiveDecals // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	__int32 AddCircleWarning(struct FVector& Location, float Radius); // Function /Script/Game.AbilityLibrary.AddCircleWarning // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AbilityRunTimeInfoStorge
// Size: 0x0 (Inherited: 0x0)
struct AAbilityRunTimeInfoStorge : AActor {
	struct TArray<struct FSkillRunTimeInfo> RunTimeInfos; // 0x0(0x0)
	struct FBossStateDamage BossStateDamage; // 0x0(0x0)
	struct TArray<struct FRuntimeDamageInfo> RuntimeDamageInfo; // 0x0(0x0)
	char pad_2A8[0xA0]; // 0x0(0x0)
	struct TMap<struct AActor*, struct FPlayerRecordData> PlayerRecordData; // 0x0(0x0)
	struct FDestructibleRecordData DestructibleRecordData; // 0x0(0x0)
	__int32 KillZoneCount; // 0x0(0x0)
	struct FString PlayerInputOperate; // 0x0(0x0)
	float DropTreatHealth; // 0x0(0x0)
	__int32 DropTreatCount; // 0x0(0x0)
	float DropShieldValue; // 0x0(0x0)
	__int32 DropShieldCount; // 0x0(0x0)
	float ExplosiveContrlMonTime; // 0x0(0x0)
	__int32 ExplosiveContrlMonCount; // 0x0(0x0)
	float ExplosiveContrlPlayerTime; // 0x0(0x0)
	__int32 ExplosiveContrlPlayerCount; // 0x0(0x0)
	struct TArray<struct FLogShieldInfo> LogContrlInfos; // 0x0(0x0)
	struct TArray<struct FLogShieldInfo> LogExplosiveInfos; // 0x0(0x0)
	struct TArray<struct FLogShieldInfo> LogDamageInfos; // 0x0(0x0)
	struct TArray<struct FLogShieldInfo> LogShieldInfos; // 0x0(0x0)
	struct TArray<struct FLogShieldInfo> LogTreatInfo; // 0x0(0x0)

	struct AAbilityRunTimeInfoStorge* GetStorge(); // Function /Script/Game.AbilityRunTimeInfoStorge.GetStorge // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool GetSkillInfoByAbility(struct UAbilityComponentBase* Launcher, struct TArray<struct FSkillRunTimeInfo>& Results); // Function /Script/Game.AbilityRunTimeInfoStorge.GetSkillInfoByAbility // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	bool GetSkillInfo(struct UAbilityComponentBase* Launcher, __int32 SkillID, struct FSkillRunTimeInfo& Result); // Function /Script/Game.AbilityRunTimeInfoStorge.GetSkillInfo // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	float GetPlayerTotalDamage(struct AActor* PlayerController); // Function /Script/Game.AbilityRunTimeInfoStorge.GetPlayerTotalDamage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool GetPlayerData(__int32 Index, struct FPlayerRecordData& OutData); // Function /Script/Game.AbilityRunTimeInfoStorge.GetPlayerData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct TArray<struct FSkillRunTimeInfo> GetMonsterDamage(); // Function /Script/Game.AbilityRunTimeInfoStorge.GetMonsterDamage // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FDestructibleRecordData GetDestructibleData(); // Function /Script/Game.AbilityRunTimeInfoStorge.GetDestructibleData // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FBossStateDamage GetBossStateDamage(); // Function /Script/Game.AbilityRunTimeInfoStorge.GetBossStateDamage // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct TArray<struct FSkillRunTimeInfo> GetBossSkillDamage(); // Function /Script/Game.AbilityRunTimeInfoStorge.GetBossSkillDamage // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool GetAbilityComponentsByModifierID(__int32 ModifierID, struct TArray<struct UAbilityComponentBase*>& Abilities); // Function /Script/Game.AbilityRunTimeInfoStorge.GetAbilityComponentsByModifierID // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void CallGameEnd(); // Function /Script/Game.AbilityRunTimeInfoStorge.CallGameEnd // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AbilitySpecialAttribute
// Size: 0x0 (Inherited: 0x0)
struct UAbilitySpecialAttribute : UObject {
	char pad_28[0x4]; // 0x0(0x0)
	__int32 MinValue; // 0x0(0x0)
	__int32 MaxValue; // 0x0(0x0)
	__int32 CurValue; // 0x0(0x0)
	struct UAbilityAttribute* Attribute; // 0x0(0x0)
	char bIsAllowTick : 1; // 0x0(0x0)
	char pad_40_1 : 7; // 0x0(0x0)
	char pad_41[0x7]; // 0x0(0x0)
	struct UAbilityComponentBase* AbilityOwner; // 0x0(0x0)

	void SetIsAllowTick(bool V); // Function /Script/Game.AbilitySpecialAttribute.SetIsAllowTick // (Final|Native|Public|BlueprintCallable) // @ game+0
	void K2_ReceiveTick(float DeltaSeconds, struct UAbilityComponentBase* InOwner); // Function /Script/Game.AbilitySpecialAttribute.K2_ReceiveTick // (Event|Protected|BlueprintEvent) // @ game+0
	void K2_ReceiveDeActive(struct UGameAbilityComponent* Pawn); // Function /Script/Game.AbilitySpecialAttribute.K2_ReceiveDeActive // (Event|Protected|BlueprintEvent) // @ game+0
	void K2_ReceiveActive(struct UObject* Instigator); // Function /Script/Game.AbilitySpecialAttribute.K2_ReceiveActive // (Event|Protected|BlueprintEvent) // @ game+0
	bool IsAllowTick(); // Function /Script/Game.AbilitySpecialAttribute.IsAllowTick // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct AGameCharacter* GetOwnerCharacter(); // Function /Script/Game.AbilitySpecialAttribute.GetOwnerCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct UAbilityAttribute* GetAttributeClass(); // Function /Script/Game.AbilitySpecialAttribute.GetAttributeClass // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
};

 // Class /Script/Game.AbnormalAnimAsset
// Size: 0x0 (Inherited: 0x0)
struct UAbnormalAnimAsset : UDataAsset {
	struct TMap<enum class EAbnormalState, struct FAbnormalAnimList> AbnormalAnimMap; // 0x0(0x0)
};

 // Class /Script/Game.AbnormalAnimBase
// Size: 0x0 (Inherited: 0x0)
struct UAbnormalAnimBase : UCurveSequenceControllerAnimInstance {
	bool bCanWakeUp; // 0x0(0x0)
	bool bInParalysisReaction; // 0x0(0x0)
	char pad_422[0x6]; // 0x0(0x0)
	struct UAnimSequenceBase* IdleAnim; // 0x0(0x0)
	struct UAnimMontage* BunkerRepelStandMontage_Left; // 0x0(0x0)
	struct UAnimMontage* BunkerRepelStandMontage_Right; // 0x0(0x0)
	struct UAnimMontage* RepelStand1Montage; // 0x0(0x0)
	struct UAnimMontage* RepelStand2Montage; // 0x0(0x0)
	struct UAnimMontage* RepelStand3Montage; // 0x0(0x0)
	struct UAnimMontage* RepelStand4Montage; // 0x0(0x0)
	struct UAnimMontage* RepelStandMontage_Head; // 0x0(0x0)
	struct UAnimMontage* RepelMontage; // 0x0(0x0)
	struct UAnimMontage* FloatingMontage_Far; // 0x0(0x0)
	struct UAnimMontage* FloatingMontage_High; // 0x0(0x0)
	struct UAnimMontage* FloatingMontage; // 0x0(0x0)
	struct UAnimMontage* LieDownMontage; // 0x0(0x0)
	struct UAnimMontage* StandUpMontage; // 0x0(0x0)
	struct UAnimMontage* StunMontage; // 0x0(0x0)
	struct UAnimMontage* StunHitMontage; // 0x0(0x0)
	struct UAnimMontage* ParalysisMontage; // 0x0(0x0)
	struct UAnimMontage* ParalysisHitMontage; // 0x0(0x0)
	float ParalysisMontagePlayTime; // 0x0(0x0)
	char pad_4BC[0x4]; // 0x0(0x0)
	struct UAnimMontage* BreathlessMontage; // 0x0(0x0)
	struct AGameCharacter* Monster; // 0x0(0x0)
	struct UAnimMontage* AbnormalMontage; // 0x0(0x0)
	struct UAnimMontage* SubAbnormalMontage; // 0x0(0x0)
	char pad_4E0[0x60]; // 0x0(0x0)

	void UpdateAbnormalAnim(float DeltaTime); // Function /Script/Game.AbnormalAnimBase.UpdateAbnormalAnim // (Final|Native|Public) // @ game+0
	void OnAbnormalUpdate(struct FAbnormalInfo& InAbnormalInfo, bool bAdd, bool bNewApply, bool bForceRemove); // Function /Script/Game.AbnormalAnimBase.OnAbnormalUpdate // (Final|Native|Public|HasOutParms) // @ game+0
	void OnAbnormalStateReset(); // Function /Script/Game.AbnormalAnimBase.OnAbnormalStateReset // (Final|Native|Public) // @ game+0
	struct UAnimMontage* GetRepelMontageFromIndex(__int32 Index); // Function /Script/Game.AbnormalAnimBase.GetRepelMontageFromIndex // (Final|Native|Public) // @ game+0
	float GetRepelEndTime(); // Function /Script/Game.AbnormalAnimBase.GetRepelEndTime // (Final|Native|Public) // @ game+0
	float GetInAbnormalBlendAlpha(); // Function /Script/Game.AbnormalAnimBase.GetInAbnormalBlendAlpha // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
};

 // Class /Script/Game.AbnormalComponent
// Size: 0x0 (Inherited: 0x0)
struct UAbnormalComponent : UActorComponent {
	struct UAbnormalAnimAsset* AbnormalAnimAsset; // 0x0(0x0)
	struct UCurveFloat* RepelMotionCurve; // 0x0(0x0)
	bool bHaveStandUpMotion; // 0x0(0x0)
	bool bIsInAbnormal; // 0x0(0x0)
	char pad_C2[0x6]; // 0x0(0x0)
	struct UAbilityComponent* AbilityComponent; // 0x0(0x0)
	bool bCanWakeUp; // 0x0(0x0)
	char pad_D1[0x7]; // 0x0(0x0)

	void OnAbnormalStateReceive(struct FAbnormalInfo& AbnormalInfo, bool bAdd, bool bNewApply); // Function /Script/Game.AbnormalComponent.OnAbnormalStateReceive // (Final|Native|Public|HasOutParms) // @ game+0
	bool HaveStandUpMotion(); // Function /Script/Game.AbnormalComponent.HaveStandUpMotion // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	float GetStunRemainingTime(); // Function /Script/Game.AbnormalComponent.GetStunRemainingTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct UCurveFloat* GetRepeleMotionCurve(); // Function /Script/Game.AbnormalComponent.GetRepeleMotionCurve // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	float GetParalysisRemainingTime(); // Function /Script/Game.AbnormalComponent.GetParalysisRemainingTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetKeepAbnormalRemainingTime(enum class EAbnormalState& State); // Function /Script/Game.AbnormalComponent.GetKeepAbnormalRemainingTime // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool GetIsInStun(); // Function /Script/Game.AbnormalComponent.GetIsInStun // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInRepel_EndStage(); // Function /Script/Game.AbnormalComponent.GetIsInRepel_EndStage // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInRepel(); // Function /Script/Game.AbnormalComponent.GetIsInRepel // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInOutControl(); // Function /Script/Game.AbnormalComponent.GetIsInOutControl // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInLie(); // Function /Script/Game.AbnormalComponent.GetIsInLie // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInFloating_Rising(); // Function /Script/Game.AbnormalComponent.GetIsInFloating_Rising // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInFloating_Floating(); // Function /Script/Game.AbnormalComponent.GetIsInFloating_Floating // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInFloating_Down(); // Function /Script/Game.AbnormalComponent.GetIsInFloating_Down // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInFloating(); // Function /Script/Game.AbnormalComponent.GetIsInFloating // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInBreathless(); // Function /Script/Game.AbnormalComponent.GetIsInBreathless // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool GetIsInBackRepel(); // Function /Script/Game.AbnormalComponent.GetIsInBackRepel // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetIsInAbnormal(); // Function /Script/Game.AbnormalComponent.GetIsInAbnormal // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetInStandUp(); // Function /Script/Game.AbnormalComponent.GetInStandUp // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool GetCanWakeUp(); // Function /Script/Game.AbnormalComponent.GetCanWakeUp // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	float GetBreathlessRemainingTime(); // Function /Script/Game.AbnormalComponent.GetBreathlessRemainingTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	__int32 GetAnimType(); // Function /Script/Game.AbnormalComponent.GetAnimType // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
};

 // Class /Script/Game.CharacterAccessory
// Size: 0x0 (Inherited: 0x0)
struct ACharacterAccessory : AActor {
	char pad_220[0x20]; // 0x0(0x0)
	struct FName SocketName; // 0x0(0x0)
	struct FName AccessoryBlongToPartitionBoneName; // 0x0(0x0)
	struct FName PropName; // 0x0(0x0)
	char bIsChildren : 1; // 0x0(0x0)
	char pad_258_1 : 7; // 0x0(0x0)
	char pad_259[0x7]; // 0x0(0x0)
	struct UAnimMontage* AnimMontage; // 0x0(0x0)
	struct AAbilityCollisionEditor* AbilityCollisionExhibition; // 0x0(0x0)
	bool bResetLocAtTick; // 0x0(0x0)
	char pad_271[0x7]; // 0x0(0x0)
	struct AGameCharacter* OwnGameCharacter; // 0x0(0x0)
	struct FPawnViewData PawnViewData; // 0x0(0x0)
	struct TArray<struct FPawnViewData> PawnViewDataList; // 0x0(0x0)
	struct UUMGDataComponent* UMGDataComponent; // 0x0(0x0)
	struct UAnimMontage* RunStopMontage; // 0x0(0x0)
	struct UAnimMontage* RushStopMontage; // 0x0(0x0)
	struct UAnimMontage* LaunchMontage; // 0x0(0x0)
	struct UAnimMontage* RunPivotingMontage; // 0x0(0x0)
	struct UAnimMontage* RushPivotingMontage; // 0x0(0x0)
	struct TArray<struct USkeletalMeshComponent*> AllMesh; // 0x0(0x0)
	struct TArray<struct USkeletalMeshComponent*> NonePartitionSkeletalComp; // 0x0(0x0)
	struct TArray<struct USkeletalMeshComponent*> NoneBonePartSkeletalComp; // 0x0(0x0)
	struct TArray<struct USkeletalMeshComponent*> PartitionSkeletalComp; // 0x0(0x0)
	struct TArray<struct UBonePartitionBaseData*> PartitionDatas; // 0x0(0x0)
	struct TArray<struct UBonePartData*> BonePartDatas; // 0x0(0x0)

	void RPC_OnOwnerDie(); // Function /Script/Game.CharacterAccessory.RPC_OnOwnerDie // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void OnOwnerDiePerform(struct AGameCharacter* OwnerCharacter); // Function /Script/Game.CharacterAccessory.OnOwnerDiePerform // (Event|Public|BlueprintEvent) // @ game+0
	void OnOwnerCharacterDie(struct AGameCharacter* Character, struct AGameCharacter* Killer, struct FHealthChangeValue& HealthChangeValue); // Function /Script/Game.CharacterAccessory.OnOwnerCharacterDie // (Native|Public|HasOutParms) // @ game+0
	struct USkeletalMeshComponent* GetSkeletalMesh(); // Function /Script/Game.CharacterAccessory.GetSkeletalMesh // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0
	struct FBoneResult GetPartMainBone(struct FBoneResult& PartResult, bool bFindScaredCrow); // Function /Script/Game.CharacterAccessory.GetPartMainBone // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct AGameCharacter* GetGameCharacter(); // Function /Script/Game.CharacterAccessory.GetGameCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	char GetCurrentStateId(char StateMachineIdx); // Function /Script/Game.CharacterAccessory.GetCurrentStateId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.Accessory_ChracterSkill
// Size: 0x0 (Inherited: 0x0)
struct AAccessory_ChracterSkill : ACharacterAccessory {
	char pad_338[0x8]; // 0x0(0x0)
	struct TArray<struct FAnimStateEventInfo> ActiveAnimStateEvent; // 0x0(0x0)
	struct TArray<struct FollowPlaySkill> FollowPlayerSkillAnim; // 0x0(0x0)
	char pad_360[0x50]; // 0x0(0x0)
	struct UAnimMontage* FollowPlayerMontage; // 0x0(0x0)
	char pad_3B8[0x8]; // 0x0(0x0)

	void FollowPlayerStopAnim(__int32 InPlayerSkillId); // Function /Script/Game.Accessory_ChracterSkill.FollowPlayerStopAnim // (Final|Native|Public|BlueprintCallable) // @ game+0
	void FollowPlayerPlayAnim(__int32 InPlayerSkillId, float PlayRate, bool bStopAllMontages); // Function /Script/Game.Accessory_ChracterSkill.FollowPlayerPlayAnim // (Final|Native|Public|BlueprintCallable) // @ game+0
	void FollowPlayerEndStorageProgress(__int32 InPlayerSkillId, float Position); // Function /Script/Game.Accessory_ChracterSkill.FollowPlayerEndStorageProgress // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.Accessory_Destructible
// Size: 0x0 (Inherited: 0x0)
struct AAccessory_Destructible : ACharacterAccessory {
	struct UAbilityComponent_Destructible* Ability; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAccessoryDestructibleDeath; // 0x0(0x0)
	bool bAsBodyPendant; // 0x0(0x0)
	bool bAOESelectAsActor; // 0x0(0x0)
	bool bCheckModifierIncludeParent; // 0x0(0x0)
	bool bApplyToOwner; // 0x0(0x0)
	bool bApplyHitNotifyToOwner; // 0x0(0x0)
	bool bWeaknessPart; // 0x0(0x0)
	char pad_356[0x2]; // 0x0(0x0)
	float DamageScale; // 0x0(0x0)
	float DamageScaleOnDestroy; // 0x0(0x0)
	float DamageSelfScale; // 0x0(0x0)
	float BreathForOwner; // 0x0(0x0)
	float MaxHealth; // 0x0(0x0)
	__int32 CardGrowID; // 0x0(0x0)
	bool bUseDestroyValue; // 0x0(0x0)
	bool bCheckCharacterDeath; // 0x0(0x0)
	char pad_372[0x2]; // 0x0(0x0)
	__int32 DamageBlinkPriority; // 0x0(0x0)
	struct FFlexibleEnumValue DamageBlinkCharacterEffectType; // 0x0(0x0)
	char pad_37C[0x4]; // 0x0(0x0)
	struct UCurveFloat* DamageBlinkCurve; // 0x0(0x0)
	struct UAnimMontage* AccessoryBrokenAnim; // 0x0(0x0)
	struct USceneComponent* AssistTargetComponent; // 0x0(0x0)
	struct FGameplayTagContainer TagContainer; // 0x0(0x0)
	char pad_3B8[0x28]; // 0x0(0x0)

	void SetBlinkEnable(bool Value); // Function /Script/Game.Accessory_Destructible.SetBlinkEnable // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetAbilityEnable(bool Value); // Function /Script/Game.Accessory_Destructible.SetAbilityEnable // (Final|Native|Public|BlueprintCallable|Const) // @ game+0
	void RPC_Destructed(); // Function /Script/Game.Accessory_Destructible.RPC_Destructed // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void OnModifyHeath(float Value); // Function /Script/Game.Accessory_Destructible.OnModifyHeath // (Native|Event|Public|BlueprintEvent) // @ game+0
	void OnDestructed(); // Function /Script/Game.Accessory_Destructible.OnDestructed // (Native|Event|Public|BlueprintEvent) // @ game+0
	void OnDead(bool IsBreak, struct UAbilityComponentBase* InLauncher, struct FHealthChangeValue& HealthChangeData); // Function /Script/Game.Accessory_Destructible.OnDead // (Native|Public|HasOutParms) // @ game+0
	struct FBoneResult K2_GetPartitionMainPart(struct FString PartitionName); // Function /Script/Game.Accessory_Destructible.K2_GetPartitionMainPart // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FBoneResult K2_GetPartitionMainBone(struct FString PartitionName); // Function /Script/Game.Accessory_Destructible.K2_GetPartitionMainBone // (Final|Native|Public|BlueprintCallable) // @ game+0
	void Client_OnModifyHeath(float Value); // Function /Script/Game.Accessory_Destructible.Client_OnModifyHeath // (Net|Native|Event|NetMulticast|Public) // @ game+0
};

 // Class /Script/Game.Accessory_HeadBase
// Size: 0x0 (Inherited: 0x0)
struct AAccessory_HeadBase : ACharacterAccessory {
	struct USkeletalMesh* OriginHeadMesh; // 0x0(0x0)

	void StopFacialAnimation(); // Function /Script/Game.Accessory_HeadBase.StopFacialAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetOriginHeadMesh(struct USkeletalMesh* Mesh); // Function /Script/Game.Accessory_HeadBase.SetOriginHeadMesh // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetHeadTempMesh(struct FString HeadPath); // Function /Script/Game.Accessory_HeadBase.SetHeadTempMesh // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ResetHeadMesh(); // Function /Script/Game.Accessory_HeadBase.ResetHeadMesh // (Final|Native|Public|BlueprintCallable) // @ game+0
	void PlayFacialAnimation(struct UAnimSequenceBase* AnimAssset, bool bIsLooping); // Function /Script/Game.Accessory_HeadBase.PlayFacialAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AnimInstance_AccessoryBase
// Size: 0x0 (Inherited: 0x0)
struct UAnimInstance_AccessoryBase : UAnimInstance {
	struct UAnimInstanceBase* OwnerAnimInstance; // 0x0(0x0)

	char GetCurrentStateId(char StateMachineIdx); // Function /Script/Game.AnimInstance_AccessoryBase.GetCurrentStateId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	char GetBlackboardState(enum class ESMBlackboardMask Mask); // Function /Script/Game.AnimInstance_AccessoryBase.GetBlackboardState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.AccessoryAnimInstance
// Size: 0x0 (Inherited: 0x0)
struct UAccessoryAnimInstance : UAnimInstance_AccessoryBase {
	struct UGameCharacterAnimInstance* CharacterAnimInstance; // 0x0(0x0)
	char pad_2C8[0x8]; // 0x0(0x0)

	bool IsShooting(); // Function /Script/Game.AccessoryAnimInstance.IsShooting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsShootForced(); // Function /Script/Game.AccessoryAnimInstance.IsShootForced // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsMontagePlaying(struct FName SlotName); // Function /Script/Game.AccessoryAnimInstance.IsMontagePlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsLocallyControlled(); // Function /Script/Game.AccessoryAnimInstance.IsLocallyControlled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInHalfSkillMontage(); // Function /Script/Game.AccessoryAnimInstance.IsInHalfSkillMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool IsAdvancedAction(); // Function /Script/Game.AccessoryAnimInstance.IsAdvancedAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	enum class EWeaponState GetWeaponState(); // Function /Script/Game.AccessoryAnimInstance.GetWeaponState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct FVector2D GetMoveDirection(); // Function /Script/Game.AccessoryAnimInstance.GetMoveDirection // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0
	char GetDodgeAnimationId(); // Function /Script/Game.AccessoryAnimInstance.GetDodgeAnimationId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetCurrentShootAdditive(); // Function /Script/Game.AccessoryAnimInstance.GetCurrentShootAdditive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetCurrentPreFireTime(); // Function /Script/Game.AccessoryAnimInstance.GetCurrentPreFireTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct FVector2D GetAimOffset(); // Function /Script/Game.AccessoryAnimInstance.GetAimOffset // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool CheckCharacterActionState(enum class ECharacterActionState CharacterStateFlag); // Function /Script/Game.AccessoryAnimInstance.CheckCharacterActionState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.AccessoryAnimInstance_Head
// Size: 0x0 (Inherited: 0x0)
struct UAccessoryAnimInstance_Head : UAccessoryAnimInstance {
	struct TMap<struct FString, __int32> RandomFacialContainer; // 0x0(0x0)
	struct TMap<struct FName, __int32> AnimSlotGroupPriority; // 0x0(0x0)
	float RandomFacialCoolDown; // 0x0(0x0)
	float HurtFacialPR; // 0x0(0x0)
	struct UAnimSequence* Base_Act; // 0x0(0x0)
	struct UAnimSequence* Hurt; // 0x0(0x0)
	struct UAnimSequence* Base_Eye; // 0x0(0x0)
	struct FString SkinAnimNameSuffix; // 0x0(0x0)
	char pad_3A0[0x70]; // 0x0(0x0)
	struct TMap<struct FString, struct UAnimSequence*> AnimSequnceMap; // 0x0(0x0)
};

 // Class /Script/Game.ActiveAble
// Size: 0x0 (Inherited: 0x0)
struct UActiveAble : UInterface {

	void SetActive(bool Inactive); // Function /Script/Game.ActiveAble.SetActive // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0
	bool IsActive(); // Function /Script/Game.ActiveAble.IsActive // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.ActorPhysicalMaterialMask
// Size: 0x0 (Inherited: 0x0)
struct UActorPhysicalMaterialMask : UActorComponent {
	char pad_B0[0x8]; // 0x0(0x0)
	struct UPhysicalMaterial* PhysicalMaterial; // 0x0(0x0)
	bool bNeedTick; // 0x0(0x0)
	char pad_C1[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.ActorQueryLibrary
// Size: 0x0 (Inherited: 0x0)
struct UActorQueryLibrary : UBlueprintFunctionLibrary {

	bool SearchActorsInSphere(struct TArray<struct AActor*>& ActorResults, struct AGameCharacter* Player, struct FVector& Pos, float Radius, __int32 RelationMask, enum class ECollisionChannel CollisionType); // Function /Script/Game.ActorQueryLibrary.SearchActorsInSphere // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool SearchActorsInFan(struct TArray<struct AActor*>& ActorResults, struct AGameCharacter* Player, float Radius, float Angle, __int32 RelationMask, enum class ECollisionChannel CollisionType); // Function /Script/Game.ActorQueryLibrary.SearchActorsInFan // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0
	bool SearchActorsInBox(struct TArray<struct AActor*>& ActorResults, struct AGameCharacter* Player, struct FVector& Start, struct FVector& End, struct FVector2D& Size, __int32 RelationMask, enum class ECollisionChannel CollisionType); // Function /Script/Game.ActorQueryLibrary.SearchActorsInBox // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	bool IsBehindSomebody(struct AActor* lpPlayer, struct AActor* lpOtherPlayer, float fCheckAngle); // Function /Script/Game.ActorQueryLibrary.IsBehindSomebody // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.ActorRenderUtilities
// Size: 0x0 (Inherited: 0x0)
struct UActorRenderUtilities : UGameInstanceSubsystem {
};

 // Class /Script/Game.ActorShadowMapMask
// Size: 0x0 (Inherited: 0x0)
struct UActorShadowMapMask : UActorComponent {
	char pad_B0[0x1]; // 0x0(0x0)
	bool bShadowMapMask; // 0x0(0x0)
	bool bNeedTick; // 0x0(0x0)
	char pad_B3[0x5]; // 0x0(0x0)
	struct UTexture2D* DefaultTexture_Black; // 0x0(0x0)
	struct UTexture2D* DefaultTexture_White; // 0x0(0x0)
	char pad_C8[0x8]; // 0x0(0x0)
};

 // Class /Script/Game.AIDirectorObject
// Size: 0x0 (Inherited: 0x0)
struct UAIDirectorObject : UObject {
};

 // Class /Script/Game.AIDirectorEvent
// Size: 0x0 (Inherited: 0x0)
struct UAIDirectorEvent : UAIDirectorObject {

	void TriggerEvent(struct AGameAICharacter* AIChar); // Function /Script/Game.AIDirectorEvent.TriggerEvent // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnTrigger(struct AGameAICharacter* AIChar); // Function /Script/Game.AIDirectorEvent.OnTrigger // (Native|Event|Protected|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.ADEvent_SetFightSignal
// Size: 0x0 (Inherited: 0x0)
struct UADEvent_SetFightSignal : UAIDirectorEvent {
	enum class EAIFightSignalType SignalType; // 0x0(0x0)
	enum class EAIAttackAttitude AttackAttitude; // 0x0(0x0)
	enum class EAIMoveAttitude MoveAttitude; // 0x0(0x0)
	enum class EAIMoveSpeedType MoveSpeedType; // 0x0(0x0)
	char pad_2C[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AIDirectorGlobalEvent
// Size: 0x0 (Inherited: 0x0)
struct UAIDirectorGlobalEvent : UAIDirectorObject {

	void OnTrigger(); // Function /Script/Game.AIDirectorGlobalEvent.OnTrigger // (Native|Event|Public|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.ADGlobalEvent_MonstersTrigger
// Size: 0x0 (Inherited: 0x0)
struct UADGlobalEvent_MonstersTrigger : UAIDirectorGlobalEvent {
	struct TArray<struct UAICondition*> MonsterFilterConditions; // 0x0(0x0)
	struct UAIDirectorEvent* Event; // 0x0(0x0)
};

 // Class /Script/Game.AGameSpecialTrigger
// Size: 0x0 (Inherited: 0x0)
struct AAGameSpecialTrigger : AActor {
	char bHasFilter : 1; // 0x0(0x0)
	char pad_220_1 : 7; // 0x0(0x0)
	char pad_221[0x7]; // 0x0(0x0)
	struct TArray<struct APawn*> AllowPawnTypes; // 0x0(0x0)

	void OnPawnEndOverlap(struct APawn* Pawn); // Function /Script/Game.AGameSpecialTrigger.OnPawnEndOverlap // (Event|Protected|BlueprintEvent) // @ game+0
	void OnPawnBeginOverlap(struct APawn* Pawn); // Function /Script/Game.AGameSpecialTrigger.OnPawnBeginOverlap // (Event|Protected|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.HouseTestMontage
// Size: 0x0 (Inherited: 0x0)
struct AHouseTestMontage : AActor {
	__int32 NpcId; // 0x0(0x0)
	char pad_224[0x4]; // 0x0(0x0)
	struct FString MontageName; // 0x0(0x0)

	void CallNpc(); // Function /Script/Game.HouseTestMontage.CallNpc // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AIBaseStateParams
// Size: 0x0 (Inherited: 0x0)
struct UAIBaseStateParams : UObject {
};

 // Class /Script/Game.AIBaseState
// Size: 0x0 (Inherited: 0x0)
struct UAIBaseState : UDataAsset {
	struct FString StateName; // 0x0(0x0)
	struct UAIBaseStateParams* Params; // 0x0(0x0)
};

 // Class /Script/Game.AILogicComponent
// Size: 0x0 (Inherited: 0x0)
struct UAILogicComponent : UActorComponent {
};

 // Class /Script/Game.AICharControl
// Size: 0x0 (Inherited: 0x0)
struct UAICharControl : UObject {

	void OnTick(struct AGameAIController* Controller); // Function /Script/Game.AICharControl.OnTick // (Native|Event|Public|BlueprintEvent) // @ game+0
	void OnStart(struct AGameAIController* Controller); // Function /Script/Game.AICharControl.OnStart // (Native|Event|Public|BlueprintEvent) // @ game+0
	void OnEnd(struct AGameAIController* Controller); // Function /Script/Game.AICharControl.OnEnd // (Native|Event|Public|BlueprintEvent) // @ game+0
	enum class EAIFaceType CalcFaceType(struct AGameAIController* Controller); // Function /Script/Game.AICharControl.CalcFaceType // (Native|Event|Public|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.AICharControl_Base
// Size: 0x0 (Inherited: 0x0)
struct UAICharControl_Base : UAICharControl {
	enum class EAIFaceType FaceType; // 0x0(0x0)
	char pad_29[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AICharControl_Section
// Size: 0x0 (Inherited: 0x0)
struct UAICharControl_Section : UAICharControl {
	struct TSoftObjectPtr<UAnimMontage> Montage; // 0x0(0x0)
	struct TMap<struct FName, enum class EAIFaceType> SectionFaceType; // 0x0(0x0)
	struct TMap<struct FName, float> SectionRotateYawModify; // 0x0(0x0)
	char pad_F0[0x10]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition
// Size: 0x0 (Inherited: 0x0)
struct UAICondition : UObject {
	bool bInverse; // 0x0(0x0)
	char pad_29[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_AND
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_AND : UAICondition {
	struct TArray<struct UAICondition*> Conditions; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_OR
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_OR : UAICondition {
	struct TArray<struct UAICondition*> Conditions; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition : UObject {
	bool bInverse; // 0x0(0x0)
	char pad_29[0x3]; // 0x0(0x0)
	float Weight; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_AND
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_AND : UAIWeightCondition {
	struct TArray<struct UAICondition*> Conditions; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_OR
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_OR : UAIWeightCondition {
	struct TArray<struct UAICondition*> Conditions; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_AngleBetweenSkillPos2Forward
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_AngleBetweenSkillPos2Forward : UAICondition {
	struct FVector2D Range; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_AngleRangeForward2Target
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_AngleRangeForward2Target : UAICondition {
	struct FVector2D Range; // 0x0(0x0)
	bool bBoth; // 0x0(0x0)
	char pad_39[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_AngleRangeForward2Target
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_AngleRangeForward2Target : UAIWeightCondition {
	struct FVector2D Range; // 0x0(0x0)
	bool bBoth; // 0x0(0x0)
	char pad_39[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_AngleRangeSpecialForward2Target
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_AngleRangeSpecialForward2Target : UAICondition {
	struct FVector2D Range; // 0x0(0x0)
	bool bBoth; // 0x0(0x0)
	char pad_39[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_AngleRangeSpecialForward2Target
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_AngleRangeSpecialForward2Target : UAIWeightCondition {
	struct FVector2D Range; // 0x0(0x0)
	bool bBoth; // 0x0(0x0)
	char pad_39[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_BlueprintLogic
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_BlueprintLogic : UObject {

	bool PerformanceCheck(struct AGameCharacter* Who); // Function /Script/Game.AICondition_BlueprintLogic.PerformanceCheck // (Native|Event|Public|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.AICondition_Blueprint
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_Blueprint : UAICondition {
	struct UAICondition_BlueprintLogic* Logic; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_Blueprint
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_Blueprint : UAIWeightCondition {
	struct UAICondition_BlueprintLogic* Logic; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_CheckFightSignal
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_CheckFightSignal : UAICondition {
	enum class EAIFightSignalType SignalType; // 0x0(0x0)
	enum class EAIAttackAttitude AttackAttitude; // 0x0(0x0)
	enum class EAIMoveAttitude MoveAttitude; // 0x0(0x0)
	enum class EAIMoveSpeedType MoveSpeedType; // 0x0(0x0)
	char pad_34[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_CheckFightSignal
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_CheckFightSignal : UAIWeightCondition {
	enum class EAIFightSignalType SignalType; // 0x0(0x0)
	enum class EAIAttackAttitude AttackAttitude; // 0x0(0x0)
	enum class EAIMoveAttitude MoveAttitude; // 0x0(0x0)
	enum class EAIMoveSpeedType MoveSpeedType; // 0x0(0x0)
	char pad_34[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_Distance2DToTarget
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_Distance2DToTarget : UAICondition {
	struct FVector2D Range; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_Distance2DToTarget
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_Distance2DToTarget : UAIWeightCondition {
	struct FVector2D Range; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_DpsIn5s
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_DpsIn5s : UAICondition {
	bool bIsCaptain; // 0x0(0x0)
	bool bCheckActorTarget; // 0x0(0x0)
	bool bCheckOthersToSelf; // 0x0(0x0)
	char pad_33[0x1]; // 0x0(0x0)
	float DpsMoreThan; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_DpsIn5s
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_DpsIn5s : UAIWeightCondition {
	bool bIsCaptain; // 0x0(0x0)
	bool bCheckActorTarget; // 0x0(0x0)
	bool bCheckOthersToSelf; // 0x0(0x0)
	char pad_33[0x1]; // 0x0(0x0)
	float DpsMoreThan; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_FightCastSuccess
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_FightCastSuccess : UAICondition {
	bool bIsCaptain; // 0x0(0x0)
	char pad_31[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_FightCastSuccess
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_FightCastSuccess : UAIWeightCondition {
	bool bIsCaptain; // 0x0(0x0)
	char pad_31[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_HasSkillState
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_HasSkillState : UAICondition {
	__int32 ModifierID; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_35[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_HasSkillState
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_HasSkillState : UAIWeightCondition {
	__int32 ModifierID; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_35[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_Hearth
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_Hearth : UAICondition {
	float Value; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	enum class EOperationType OpeType; // 0x0(0x0)
	char pad_36[0x2]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_Hearth
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_Hearth : UAIWeightCondition {
	float Value; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	enum class EOperationType OpeType; // 0x0(0x0)
	char pad_36[0x2]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_Hearth_Acc
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_Hearth_Acc : UAICondition {
	float Value; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	enum class EOperationType OpeType; // 0x0(0x0)
	char pad_36[0x2]; // 0x0(0x0)
	struct ACharacterAccessory* AccType; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_Hearth_Acc
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_Hearth_Acc : UAIWeightCondition {
	float Value; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	enum class EOperationType OpeType; // 0x0(0x0)
	char pad_36[0x2]; // 0x0(0x0)
	struct ACharacterAccessory* AccType; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_InPreSkill
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_InPreSkill : UAICondition {
	__int32 SkillID; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_35[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_InPreSkill
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_InPreSkill : UAIWeightCondition {
	__int32 SkillID; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_35[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_IsAutoAimTarget
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_IsAutoAimTarget : UAICondition {
	bool bIsCaptain; // 0x0(0x0)
	bool bIsFire; // 0x0(0x0)
	char pad_32[0x6]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_IsAutoAimTarget
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_IsAutoAimTarget : UAIWeightCondition {
	bool bIsCaptain; // 0x0(0x0)
	bool bIsFire; // 0x0(0x0)
	char pad_32[0x6]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_IsCastingSkill
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_IsCastingSkill : UAICondition {
	__int32 SkillID; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_35[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_IsCastingSkill
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_IsCastingSkill : UAIWeightCondition {
	__int32 SkillID; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_35[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_MonsterTag
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_MonsterTag : UAICondition {
	struct FName MonsterTag; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_Ray2Target
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_Ray2Target : UAICondition {
	enum class ECollisionChannel Channel; // 0x0(0x0)
	char pad_31[0x3]; // 0x0(0x0)
	float Radius; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_Ray2Target
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_Ray2Target : UAIWeightCondition {
	enum class ECollisionChannel Channel; // 0x0(0x0)
	char pad_31[0x3]; // 0x0(0x0)
	float Radius; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_SkillTimes
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_SkillTimes : UAICondition {
	__int32 SkillID; // 0x0(0x0)
	__int32 Times; // 0x0(0x0)
	__int32 EmitterIndex; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_3D[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_SkillTimes
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_SkillTimes : UAIWeightCondition {
	__int32 SkillID; // 0x0(0x0)
	__int32 Times; // 0x0(0x0)
	__int32 EmitterIndex; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_3D[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_Speed
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_Speed : UAICondition {
	float Value; // 0x0(0x0)
	char pad_34[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_Speed
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_Speed : UAIWeightCondition {
	float Value; // 0x0(0x0)
	char pad_34[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_TeamCharNum
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_TeamCharNum : UAICondition {
	__int32 Template; // 0x0(0x0)
	__int32 Times; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_TeamCharNum
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_TeamCharNum : UAIWeightCondition {
	__int32 Template; // 0x0(0x0)
	__int32 Times; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_TimeAfterCastSkill
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_TimeAfterCastSkill : UAICondition {
	__int32 SkillID; // 0x0(0x0)
	float Time; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_39[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_TimeAfterCastSkill
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_TimeAfterCastSkill : UAIWeightCondition {
	__int32 SkillID; // 0x0(0x0)
	float Time; // 0x0(0x0)
	bool bIsCaptain; // 0x0(0x0)
	char pad_39[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AICondition_TimeAfterTeamMemberCastSkillNative
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_TimeAfterTeamMemberCastSkillNative : UAICondition_BlueprintLogic {

	bool DoLogic(struct AGameCharacter* Who, __int32 SkillIdVal, float TimeVal, enum class EOperationType OperationTypeVal); // Function /Script/Game.AICondition_TimeAfterTeamMemberCastSkillNative.DoLogic // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AICondition_TimeToLastDps
// Size: 0x0 (Inherited: 0x0)
struct UAICondition_TimeToLastDps : UAICondition {
	bool bIsCaptain; // 0x0(0x0)
	bool bDps2Self; // 0x0(0x0)
	char pad_32[0x2]; // 0x0(0x0)
	float Time; // 0x0(0x0)
	enum class EOperationType OpeType; // 0x0(0x0)
	char pad_39[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AIWeightCondition_TimeToLastDps
// Size: 0x0 (Inherited: 0x0)
struct UAIWeightCondition_TimeToLastDps : UAIWeightCondition {
	bool bIsCaptain; // 0x0(0x0)
	bool bDps2Self; // 0x0(0x0)
	char pad_32[0x2]; // 0x0(0x0)
	float Time; // 0x0(0x0)
	enum class EOperationType OpeType; // 0x0(0x0)
	char pad_39[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AIControlDataComponent
// Size: 0x0 (Inherited: 0x0)
struct UAIControlDataComponent : UActorComponent {
	__int32 ID; // 0x0(0x0)
	struct TWeakObjectPtr<struct AAITeamLogic> Team; // 0x0(0x0)
	char pad_BC[0x4]; // 0x0(0x0)
	struct FAIControlParam AIControlPara; // 0x0(0x0)
	struct TWeakObjectPtr<struct APatrolPathDefiner> PatrolPath; // 0x0(0x0)
	__int32 PatrolRegionId; // 0x0(0x0)
	__int32 PatrolLineId; // 0x0(0x0)
	struct TWeakObjectPtr<struct APatrolPoint_New> PatrolPoint; // 0x0(0x0)
	float OwEndFightRange; // 0x0(0x0)
	float OwEndFightNotAttackedRange; // 0x0(0x0)
	char pad_170[0x1]; // 0x0(0x0)
	bool InOwEndFight; // 0x0(0x0)
	char pad_172[0x2]; // 0x0(0x0)
	struct TWeakObjectPtr<struct ACollapseTeamTriggerBox> CollapseTeamBox; // 0x0(0x0)
	struct TWeakObjectPtr<struct UFollowSocketComponent> FollowSocket; // 0x0(0x0)
	struct FVector Forward; // 0x0(0x0)
	enum class EAIFaceType FaceType; // 0x0(0x0)
	char pad_191[0x7]; // 0x0(0x0)
	struct TArray<__int32> AIEntries; // 0x0(0x0)
	struct AActor* TargetActor; // 0x0(0x0)
	struct UBunkerPointComponent* TargetBunkerPoint; // 0x0(0x0)
	struct FHighestDpsInfo HighestDps2Other; // 0x0(0x0)
	struct FHighestDpsInfo HighestDps2Self; // 0x0(0x0)
	struct TMap<__int32, struct FAISkillTargets> SkillTargets; // 0x0(0x0)
	struct TArray<struct UAISkillTargetTracker*> SkillTargetTracker; // 0x0(0x0)
	char pad_230[0xF0]; // 0x0(0x0)
	enum class EAIAttackAttitude AttackAttitude; // 0x0(0x0)
	enum class EAIMoveAttitude MoveAttitude; // 0x0(0x0)
	enum class EAIMoveSpeedType MoveSpeedType; // 0x0(0x0)
	char pad_323[0x25]; // 0x0(0x0)
	enum class EPatrolMode PatrolMode; // 0x0(0x0)
	char pad_349[0x3]; // 0x0(0x0)
	struct FName PatrolAreaTag; // 0x0(0x0)
	char pad_354[0x4]; // 0x0(0x0)

	void UpdateAISkillTargets(__int32 SkillID, struct FVector& Pos); // Function /Script/Game.AIControlDataComponent.UpdateAISkillTargets // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	void SetTargetActor(struct AActor* InTargetActor); // Function /Script/Game.AIControlDataComponent.SetTargetActor // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetPatrolPoint(struct APatrolPoint_New* InPatrolPoint); // Function /Script/Game.AIControlDataComponent.SetPatrolPoint // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetOWEnterFightPos(struct FVector InPos); // Function /Script/Game.AIControlDataComponent.SetOWEnterFightPos // (Final|Native|Public|HasDefaults) // @ game+0
	void SetOWEndFightRange(float InOwEndFightNotAttackedRange, float InOwEndFightRange); // Function /Script/Game.AIControlDataComponent.SetOWEndFightRange // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetInOwEndFight(bool IsIn); // Function /Script/Game.AIControlDataComponent.SetInOwEndFight // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetAICacheData(__int32 InID, struct FString Name, float Value); // Function /Script/Game.AIControlDataComponent.SetAICacheData // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetAdvancedStateTargetTag(enum class EAIAdvancedState AdState, struct FString TargetTag); // Function /Script/Game.AIControlDataComponent.SetAdvancedStateTargetTag // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetAdvancedStateFlag(enum class EAIAdvancedState AdState, bool bFlag); // Function /Script/Game.AIControlDataComponent.SetAdvancedStateFlag // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveAISkillTargetTracker(struct UAISkillTargetTracker* InAISkillTracker); // Function /Script/Game.AIControlDataComponent.RemoveAISkillTargetTracker // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnSkillStart(__int32 SkillID); // Function /Script/Game.AIControlDataComponent.OnSkillStart // (Final|Native|Protected) // @ game+0
	void OnSkillEnd(__int32 SkillID); // Function /Script/Game.AIControlDataComponent.OnSkillEnd // (Final|Native|Protected) // @ game+0
	void OnSkillCancel(__int32 SkillID, enum class ESkillInterruptedType InType); // Function /Script/Game.AIControlDataComponent.OnSkillCancel // (Final|Native|Protected) // @ game+0
	struct APatrolPoint_New* NextPatrolPoint(); // Function /Script/Game.AIControlDataComponent.NextPatrolPoint // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool HasAIEntry(__int32 EntryID); // Function /Script/Game.AIControlDataComponent.HasAIEntry // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct AActor* GetTargetActor(); // Function /Script/Game.AIControlDataComponent.GetTargetActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct FVector GetOWEnterFightPos(); // Function /Script/Game.AIControlDataComponent.GetOWEnterFightPos // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0
	struct FAISkillTargets GetCurrSkillTargetLoc(); // Function /Script/Game.AIControlDataComponent.GetCurrSkillTargetLoc // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FAISkillTargets GetAISkillTargets(__int32 SkillID, bool& bOk); // Function /Script/Game.AIControlDataComponent.GetAISkillTargets // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetAICacheData(__int32 InID, struct FString Name); // Function /Script/Game.AIControlDataComponent.GetAICacheData // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FName GetAdvancedStateTargetTag(enum class EAIAdvancedState AdState); // Function /Script/Game.AIControlDataComponent.GetAdvancedStateTargetTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool GetAdvancedStateFlag(enum class EAIAdvancedState AdState); // Function /Script/Game.AIControlDataComponent.GetAdvancedStateFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void ClearOWEndFightInfoOnSkillCast(__int32 SkillID, struct TArray<__int32>& OriginSkills, struct UGameAbilityComponent* AbilityRef); // Function /Script/Game.AIControlDataComponent.ClearOWEndFightInfoOnSkillCast // (Final|Native|Public|HasOutParms) // @ game+0
	void ClearOWEndFightInfo(); // Function /Script/Game.AIControlDataComponent.ClearOWEndFightInfo // (Final|Native|Public) // @ game+0
	void AddAISkillTargetTracker(struct UAISkillTargetTracker* InAISkillTracker); // Function /Script/Game.AIControlDataComponent.AddAISkillTargetTracker // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AIDirectorCondition
// Size: 0x0 (Inherited: 0x0)
struct UAIDirectorCondition : UAIDirectorObject {

	bool Check(); // Function /Script/Game.AIDirectorCondition.Check // (Native|Event|Public|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.AIDirectorConfigAsset
// Size: 0x0 (Inherited: 0x0)
struct UAIDirectorConfigAsset : UDataAsset {
	__int32 BunkerToken; // 0x0(0x0)
	char pad_34[0x4]; // 0x0(0x0)
	struct UBunkerQueryAsset* BunkerQuery; // 0x0(0x0)
	struct TArray<struct FAIDirectorConditionGlobalEvent> ConditionTriggerEvents; // 0x0(0x0)
	struct TArray<struct FAIDirectorGroup> Groups; // 0x0(0x0)
};

 // Class /Script/Game.GameWorldSubsystem
// Size: 0x0 (Inherited: 0x0)
struct UGameWorldSubsystem : UWorldSubsystem {
	char pad_30[0x8]; // 0x0(0x0)
	struct TArray<struct FString> IgnoredLevelNames; // 0x0(0x0)
};

 // Class /Script/Game.GameTickableWorldSubsystem
// Size: 0x0 (Inherited: 0x0)
struct UGameTickableWorldSubsystem : UGameWorldSubsystem {
	char pad_48[0x10]; // 0x0(0x0)
};

 // Class /Script/Game.AIDirectorSystem
// Size: 0x0 (Inherited: 0x0)
struct UAIDirectorSystem : UGameTickableWorldSubsystem {
	bool bDebugBunkerInfo; // 0x0(0x0)
	char pad_59[0x7]; // 0x0(0x0)
	struct TMap<struct UAIDirectorGlobalEvent*, float> AIDirectorEventCDMap; // 0x0(0x0)
	struct UAIDirectorConfigAsset* Config; // 0x0(0x0)
	struct FTokenNum BunkerToken; // 0x0(0x0)
	char pad_C4[0x4]; // 0x0(0x0)
	struct TMap<__int32, struct FAIDirectorGroup> ActiveGroups; // 0x0(0x0)
	struct TArray<struct FAIDirectorCDGroup> CDGroups; // 0x0(0x0)
	struct TMap<__int32, struct FAIDirectorGroup> DeactiveGroups; // 0x0(0x0)
	char pad_178[0x58]; // 0x0(0x0)
	struct TArray<struct ABunker*> AvalidBunkers; // 0x0(0x0)
	struct TArray<struct UBunkerPointComponent*> AvalidBunkerPoints; // 0x0(0x0)
	struct TArray<struct UBunkerPointComponent*> OccupiedBunkerPoints; // 0x0(0x0)
	struct TArray<struct UBunkerPointComponent*> FreeBunkerPoints; // 0x0(0x0)
	struct TArray<struct UBunkerPointComponent*> SafeBunkerPoints; // 0x0(0x0)
	char pad_220[0x8]; // 0x0(0x0)

	void SetGroupTokenCD(__int32 GroupId, enum class ESkillRangeType SkillType, float CD); // Function /Script/Game.AIDirectorSystem.SetGroupTokenCD // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetGroupToken(__int32 GroupId, struct TMap<enum class ESkillRangeType, struct FTokenNum> TokenConfig); // Function /Script/Game.AIDirectorSystem.SetGroupToken // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetGroupEliteTokenRatio(__int32 GroupId, __int32 Ratio); // Function /Script/Game.AIDirectorSystem.SetGroupEliteTokenRatio // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetBunkerToken(__int32 TokenNum); // Function /Script/Game.AIDirectorSystem.SetBunkerToken // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetAllGroupTokenCD(enum class ESkillRangeType SkillType, float CD); // Function /Script/Game.AIDirectorSystem.SetAllGroupTokenCD // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct TArray<struct AGameAICharacter*> GetMembersByGroupID(__int32 GroupId); // Function /Script/Game.AIDirectorSystem.GetMembersByGroupID // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetGroupIDOfMonster(struct AGameAICharacter* InAIChar); // Function /Script/Game.AIDirectorSystem.GetGroupIDOfMonster // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FAIDirectorGroup GetGroupConfigOfMonster(struct AGameAICharacter* InAIChar); // Function /Script/Game.AIDirectorSystem.GetGroupConfigOfMonster // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FAIDirectorGroup GetGroupConfigByID(__int32 GroupId); // Function /Script/Game.AIDirectorSystem.GetGroupConfigByID // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FTokenNum GetBunkerToken(); // Function /Script/Game.AIDirectorSystem.GetBunkerToken // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct TArray<struct AGameAICharacter*> GetAllMonsters(); // Function /Script/Game.AIDirectorSystem.GetAllMonsters // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	void DeactiveGroup(__int32 GroupId); // Function /Script/Game.AIDirectorSystem.DeactiveGroup // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CanRequestSkillToken(struct AGameAICharacter* AIChar, enum class ESkillRangeType SkillType); // Function /Script/Game.AIDirectorSystem.CanRequestSkillToken // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	void AddNewGroup(struct TArray<struct AGameAICharacter*> GroupMembers, struct FAIDirectorGroup& GroupConfig); // Function /Script/Game.AIDirectorSystem.AddNewGroup // (Final|Native|Public|HasOutParms) // @ game+0
	void ActiveGroup(__int32 GroupId); // Function /Script/Game.AIDirectorSystem.ActiveGroup // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AIEvent
// Size: 0x0 (Inherited: 0x0)
struct UAIEvent : UObject {
	char pad_28[0x8]; // 0x0(0x0)
	bool bFinished; // 0x0(0x0)
	char pad_31[0x7]; // 0x0(0x0)
	struct FString Param0; // 0x0(0x0)
	struct FString Param1; // 0x0(0x0)
	struct FString Param2; // 0x0(0x0)
	struct FString Param3; // 0x0(0x0)
	struct FString Param4; // 0x0(0x0)
	struct FString Param5; // 0x0(0x0)
	struct TWeakObjectPtr<struct AGameAICharacter> AICharacter; // 0x0(0x0)
	struct TWeakObjectPtr<struct AGameAIController> AIController; // 0x0(0x0)

	void OnTick(float DeltaTime); // Function /Script/Game.AIEvent.OnTick // (Event|Public|BlueprintEvent) // @ game+0
	void OnFinish(); // Function /Script/Game.AIEvent.OnFinish // (Event|Public|BlueprintEvent) // @ game+0
	void OnExecute(struct AGameCharacter* Character); // Function /Script/Game.AIEvent.OnExecute // (Native|Event|Public|BlueprintEvent) // @ game+0
	bool IsStopMovement(); // Function /Script/Game.AIEvent.IsStopMovement // (Native|Event|Public|BlueprintEvent) // @ game+0
	bool IsPersistentEvent(); // Function /Script/Game.AIEvent.IsPersistentEvent // (Native|Event|Public|BlueprintEvent) // @ game+0
	void EventFinish(); // Function /Script/Game.AIEvent.EventFinish // (Native|Public|BlueprintCallable) // @ game+0
	bool CanInterruptFight(); // Function /Script/Game.AIEvent.CanInterruptFight // (Native|Event|Public|BlueprintEvent) // @ game+0
};

 // Class /Script/Game.AIEvent_AreaRandomMove
// Size: 0x0 (Inherited: 0x0)
struct UAIEvent_AreaRandomMove : UAIEvent {
	struct AActor* MoveCenter; // 0x0(0x0)
	float MoveRadius; // 0x0(0x0)
	__int32 RequestMoveTime; // 0x0(0x0)
	bool bCanInterruptFight; // 0x0(0x0)
	char pad_B9[0xF]; // 0x0(0x0)

	void OnMoveCompleted(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function /Script/Game.AIEvent_AreaRandomMove.OnMoveCompleted // (Final|Native|Public) // @ game+0
};

 // Class /Script/Game.AIEvent_FollowSceneTargetBase
// Size: 0x0 (Inherited: 0x0)
struct UAIEvent_FollowSceneTargetBase : UAIEvent {
	char pad_A8[0x40]; // 0x0(0x0)

	void OnMoveCompleted(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function /Script/Game.AIEvent_FollowSceneTargetBase.OnMoveCompleted // (Final|Native|Public) // @ game+0
};

 // Class /Script/Game.AIEvent_MoveToBunkerPoint
// Size: 0x0 (Inherited: 0x0)
struct UAIEvent_MoveToBunkerPoint : UAIEvent {
	struct ABunker* TargetBunkerActor; // 0x0(0x0)
	__int32 BunkerPointIndex; // 0x0(0x0)
	bool bForceMove; // 0x0(0x0)
	char pad_B5[0x3]; // 0x0(0x0)
	float SpeedModify; // 0x0(0x0)
	bool bCancelAllSkill; // 0x0(0x0)
	char pad_BD[0x1B]; // 0x0(0x0)

	void OnMoveCompleted(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function /Script/Game.AIEvent_MoveToBunkerPoint.OnMoveCompleted // (Final|Native|Public) // @ game+0
};

 // Class /Script/Game.AIEvent_RandomMoveBase
// Size: 0x0 (Inherited: 0x0)
struct UAIEvent_RandomMoveBase : UAIEvent {
	struct AActor* SearchCenter; // 0x0(0x0)
	char pad_B0[0x48]; // 0x0(0x0)

	void ConditionalPerformMove(); // Function /Script/Game.AIEvent_RandomMoveBase.ConditionalPerformMove // (Final|Native|Protected) // @ game+0
};

 // Class /Script/Game.AIGlobalStatistic
// Size: 0x0 (Inherited: 0x0)
struct AAIGlobalStatistic : AInfo {
	bool bDisplayEnmityDebugData; // 0x0(0x0)
	bool bDisplayDpsDebugData; // 0x0(0x0)
	char pad_222[0x6]; // 0x0(0x0)
	struct TMap<struct AGameCharacter*, struct AEnmityReplaceActor*> StealthChars; // 0x0(0x0)
	char pad_278[0x8]; // 0x0(0x0)
	struct TMap<struct TWeakObjectPtr<struct AActor>, struct UAIStatisticData*> PersonalFightData; // 0x0(0x0)
	struct TMap<struct TWeakObjectPtr<struct AAITeamLogic>, struct UAIStatisticData*> TeamFightData; // 0x0(0x0)
	struct TMap<struct TWeakObjectPtr<struct AActor>, struct FAIArray> AITargetData; // 0x0(0x0)

	void SwitchActorEnmity(struct AActor* InActor, struct AActor* ToActor); // Function /Script/Game.AIGlobalStatistic.SwitchActorEnmity // (Final|Native|Public|BlueprintCallable) // @ game+0
	void QueryTeamTargets(struct AActor* Char, struct TArray<struct AActor*>& OutTargets); // Function /Script/Game.AIGlobalStatistic.QueryTeamTargets // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void QueryTargets(struct AActor* Char, struct TArray<struct AActor*>& OutTargets); // Function /Script/Game.AIGlobalStatistic.QueryTargets // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float QueryLastEmitSkillTimeById(struct AActor* Char, __int32 SkillID); // Function /Script/Game.AIGlobalStatistic.QueryLastEmitSkillTimeById // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float QueryLastEmitSkillTime(struct AActor* Char); // Function /Script/Game.AIGlobalStatistic.QueryLastEmitSkillTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void QueryHighestDPS2Self(struct AActor* Char, struct AActor*& OutWho, float& OutValue); // Function /Script/Game.AIGlobalStatistic.QueryHighestDPS2Self // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsBeingTargetSpecify(struct AActor* SourcActor, struct AActor* TargetActor); // Function /Script/Game.AIGlobalStatistic.IsBeingTargetSpecify // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsBeingTarget(struct AActor* InActor); // Function /Script/Game.AIGlobalStatistic.IsBeingTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool HasDps2Self(struct AActor* Char); // Function /Script/Game.AIGlobalStatistic.HasDps2Self // (Final|Native|Public|BlueprintCallable) // @ game+0
	void GetHasSameTargetActors(struct AActor* InTargetActor, struct TArray<struct AActor*>& OutActors); // Function /Script/Game.AIGlobalStatistic.GetHasSameTargetActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void GetAllTeams(struct TArray<struct AAITeamLogic*>& OutTeams); // Function /Script/Game.AIGlobalStatistic.GetAllTeams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	struct AAIGlobalStatistic* Get(struct UObject* WorldContextObject); // Function /Script/Game.AIGlobalStatistic.Get // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
};

 // Class /Script/Game.AIStatisticData
// Size: 0x0 (Inherited: 0x0)
struct UAIStatisticData : UObject {
	char pad_28[0x300]; // 0x0(0x0)
};

 // Class /Script/Game.AILibrary
// Size: 0x0 (Inherited: 0x0)
struct UAILibrary : UBlueprintFunctionLibrary {

	void UpdateAllPlayersFightCheckResult(struct UObject* WorldContext); // Function /Script/Game.AILibrary.UpdateAllPlayersFightCheckResult // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void UpdateAIControlParam(struct AActor* AIActor, __int32 InParamID); // Function /Script/Game.AILibrary.UpdateAIControlParam // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void StartStealthToAI(struct AGameCharacter* StealthChar); // Function /Script/Game.AILibrary.StartStealthToAI // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void RemoveFollower(struct AGameCharacter* Leader, struct AGameCharacter* Who); // Function /Script/Game.AILibrary.RemoveFollower // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	bool GetPlayersFightCheckResult(struct UObject* WorldContext); // Function /Script/Game.AILibrary.GetPlayersFightCheckResult // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct AGameAIController* GetGameAIController(struct USMInstance* Instance); // Function /Script/Game.AILibrary.GetGameAIController // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FBulletInfo GetBulletInfoInSkill(__int32 SkillID); // Function /Script/Game.AILibrary.GetBulletInfoInSkill // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct AActor* GetActorByString(struct UObject* Context, struct FString inString); // Function /Script/Game.AILibrary.GetActorByString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct UActorComponent* FindOrAddComponent(struct AActor* Actor, struct UActorComponent* Class); // Function /Script/Game.AILibrary.FindOrAddComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void EndStealthToAI(struct AGameCharacter* StealthChar); // Function /Script/Game.AILibrary.EndStealthToAI // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void AddFollower(struct AGameCharacter* Leader, struct AGameCharacter* Who); // Function /Script/Game.AILibrary.AddFollower // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void AddEnmityInLoc(struct AActor* Target, struct FVector Loc, float Radius, float Value, enum class EEnmityType Type, enum class EEnmityClearType ClearType); // Function /Script/Game.AILibrary.AddEnmityInLoc // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AIMove
// Size: 0x0 (Inherited: 0x0)
struct UAIMove : UObject {
	struct FString Remark; // 0x0(0x0)
	float Time; // 0x0(0x0)
	float RandomDeviation; // 0x0(0x0)
	float Weight; // 0x0(0x0)
	float SpeedModify; // 0x0(0x0)
	enum class EAIFaceType FaceType; // 0x0(0x0)
	bool bCastUpperSkill; // 0x0(0x0)
	bool bCastFullBodySkill; // 0x0(0x0)
	char pad_4B[0x5]; // 0x0(0x0)
	struct TArray<struct UAIWeightCondition*> Conditions; // 0x0(0x0)
	bool bNeedInterruptBunkerState; // 0x0(0x0)
	char pad_61[0x1F]; // 0x0(0x0)
};

 // Class /Script/Game.AIMove_BunkerPoint
// Size: 0x0 (Inherited: 0x0)
struct UAIMove_BunkerPoint : UAIMove {
	struct UBunkerQueryAsset* BunkerQueryAsset; // 0x0(0x0)
};

 // Class /Script/Game.AIMove_EQS
// Size: 0x0 (Inherited: 0x0)
struct UAIMove_EQS : UAIMove {
	struct FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x0(0x0)
	struct AActor* EQSRequester; // 0x0(0x0)
	char pad_D0[0x10]; // 0x0(0x0)
};

 // Class /Script/Game.AIMove_SafeArea
// Size: 0x0 (Inherited: 0x0)
struct UAIMove_SafeArea : UAIMove {
	struct FVector2D Range; // 0x0(0x0)
	bool bCustomEQS; // 0x0(0x0)
	char pad_89[0x7]; // 0x0(0x0)
	struct UEnvQuery* QueryTemplate; // 0x0(0x0)
	char pad_98[0x18]; // 0x0(0x0)
};

 // Class /Script/Game.AIMove_Simple
// Size: 0x0 (Inherited: 0x0)
struct UAIMove_Simple : UAIMove {
	struct FVector2D Angle; // 0x0(0x0)
	struct FVector2D Distance; // 0x0(0x0)
	enum class EAISimpleMoveForwardType ForwardType; // 0x0(0x0)
	char pad_91[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AIMove_Stand
// Size: 0x0 (Inherited: 0x0)
struct UAIMove_Stand : UAIMove {
};

 // Class /Script/Game.AIMove_TrackingTarget
// Size: 0x0 (Inherited: 0x0)
struct UAIMove_TrackingTarget : UAIMove {
};

 // Class /Script/Game.AIMove_SceneTarget
// Size: 0x0 (Inherited: 0x0)
struct UAIMove_SceneTarget : UAIMove {
};

 // Class /Script/Game.AIPerformanceComponent
// Size: 0x0 (Inherited: 0x0)
struct UAIPerformanceComponent : UActorComponent {
	struct APerformanceManager* PerformanceManager; // 0x0(0x0)
	char pad_B8[0x8]; // 0x0(0x0)
	struct UCharacterMovementComponent* MovComp; // 0x0(0x0)
	struct ACharacter* Char; // 0x0(0x0)
	struct USkeletalMeshComponent* CharMesh; // 0x0(0x0)
	struct AGameTaskActor* TaskActor; // 0x0(0x0)
	char pad_E0[0x1]; // 0x0(0x0)
	bool bControlAnimationPerformance; // 0x0(0x0)
	char pad_E2[0xE]; // 0x0(0x0)
	struct FVector4 MoveLODIntervals; // 0x0(0x0)
	struct FVector4 ScreenPercetage; // 0x0(0x0)
	__int32 Lod0SkipFrame; // 0x0(0x0)
	__int32 Lod1SkipFrame; // 0x0(0x0)
	__int32 Lod2SkipFrame; // 0x0(0x0)
	__int32 Lod3SkipFrame; // 0x0(0x0)
	bool bIgnoreMoveOptimization; // 0x0(0x0)
	bool bUseScreenPercentage; // 0x0(0x0)
	bool bForceSuspendAITick; // 0x0(0x0)
	char pad_123[0xD]; // 0x0(0x0)

	float GetCurrentScreenPercentage(); // Function /Script/Game.AIPerformanceComponent.GetCurrentScreenPercentage // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetCurrentLODLevel(); // Function /Script/Game.AIPerformanceComponent.GetCurrentLODLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
};

 // Class /Script/Game.AISkillCaster
// Size: 0x0 (Inherited: 0x0)
struct UAISkillCaster : UObject {
	bool bCustomBT; // 0x0(0x0)
	char pad_29[0x7]; // 0x0(0x0)
	struct FSoftObjectPath BT; // 0x0(0x0)
	float AbandonTime; // 0x0(0x0)
	float SpeedModify; // 0x0(0x0)
	struct UAICondition* EmitChecker; // 0x0(0x0)
	struct UAICondition* InterruptChecker; // 0x0(0x0)
	struct UAIEvent* FightEventAfterInterrupt; // 0x0(0x0)
	struct UAICondition* EndChecker; // 0x0(0x0)
	struct UAICondition* CasterEndChecker; // 0x0(0x0)
};

 // Class /Script/Game.AISkillEmitter_EQS
// Size: 0x0 (Inherited: 0x0)
struct UAISkillEmitter_EQS : UAISkillCaster {
	float Range; // 0x0(0x0)
	char pad_7C[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AISkillEmitter_EQS_Chase
// Size: 0x0 (Inherited: 0x0)
struct UAISkillEmitter_EQS_Chase : UAISkillEmitter_EQS {
};

 // Class /Script/Game.AISkillEmitter_EQS_Rotate
// Size: 0x0 (Inherited: 0x0)
struct UAISkillEmitter_EQS_Rotate : UAISkillEmitter_EQS {
};

 // Class /Script/Game.AISkillEmitter_Immediate
// Size: 0x0 (Inherited: 0x0)
struct UAISkillEmitter_Immediate : UAISkillCaster {
};

 // Class /Script/Game.AISkillTargetTracker
// Size: 0x0 (Inherited: 0x0)
struct UAISkillTargetTracker : UObject {
	__int32 SkillID; // 0x0(0x0)
	char pad_2C[0x4]; // 0x0(0x0)
	struct TArray<__int32> SubSkillId; // 0x0(0x0)
	float PerceptionSeconed; // 0x0(0x0)
	char pad_44[0x4]; // 0x0(0x0)

	void TickEvent(struct UAIControlDataComponent* AIControlData, float DeltaTime); // Function /Script/Game.AISkillTargetTracker.TickEvent // (Event|Public|BlueprintEvent) // @ game+0
	bool ShouldDestroy(); // Function /Script/Game.AISkillTargetTracker.ShouldDestroy // (Native|Public|BlueprintCallable) // @ game+0
	void OnTick(struct UAIControlDataComponent* AIControlData, float DeltaTime); // Function /Script/Game.AISkillTargetTracker.OnTick // (Native|Public|BlueprintCallable) // @ game+0
	void OnStart(struct UAIControlDataComponent* AIControlData); // Function /Script/Game.AISkillTargetTracker.OnStart // (Native|Public|BlueprintCallable) // @ game+0
	void OnEnd(struct UAIControlDataComponent* AIControlData); // Function /Script/Game.AISkillTargetTracker.OnEnd // (Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AISkillTargetTracker_SelfForward
// Size: 0x0 (Inherited: 0x0)
struct UAISkillTargetTracker_SelfForward : UAISkillTargetTracker {
};

 // Class /Script/Game.AISkillTargetTracker_SelfForward_AimTarget
// Size: 0x0 (Inherited: 0x0)
struct UAISkillTargetTracker_SelfForward_AimTarget : UAISkillTargetTracker {
	float Speed; // 0x0(0x0)
	struct FVector2D Range; // 0x0(0x0)
	char pad_54[0xC]; // 0x0(0x0)
};

 // Class /Script/Game.AISkillTargetTracker_Target
// Size: 0x0 (Inherited: 0x0)
struct UAISkillTargetTracker_Target : UAISkillTargetTracker {
	enum class EAI_STT_TargetType TargetType; // 0x0(0x0)
	char pad_49[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AISkillTargetTracker_TargetSocket
// Size: 0x0 (Inherited: 0x0)
struct UAISkillTargetTracker_TargetSocket : UAISkillTargetTracker {
	bool bIntervalRandom; // 0x0(0x0)
	char pad_49[0x3]; // 0x0(0x0)
	float Interval; // 0x0(0x0)
	float Ratio; // 0x0(0x0)
	char pad_54[0x4]; // 0x0(0x0)
	struct TMap<struct FName, __int32> Weights; // 0x0(0x0)
	char pad_A8[0x60]; // 0x0(0x0)
};

 // Class /Script/Game.AISMInstance
// Size: 0x0 (Inherited: 0x0)
struct UAISMInstance : USMInstance {

	void SetCharacterEvent(char idx, char Event); // Function /Script/Game.AISMInstance.SetCharacterEvent // (Final|Native|Public|BlueprintCallable|Const) // @ game+0
	float PartHearth(struct ACharacterAccessory* AccessoryClass); // Function /Script/Game.AISMInstance.PartHearth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInBunker(); // Function /Script/Game.AISMInstance.IsInBunker // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool IsDead(); // Function /Script/Game.AISMInstance.IsDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsAlive(); // Function /Script/Game.AISMInstance.IsAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool HasTargetBunkerPoint(); // Function /Script/Game.AISMInstance.HasTargetBunkerPoint // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool HasTarget(); // Function /Script/Game.AISMInstance.HasTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool HasPatrolPath(); // Function /Script/Game.AISMInstance.HasPatrolPath // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool GetAdvancedStateFlag(enum class EAIAdvancedState AdState); // Function /Script/Game.AISMInstance.GetAdvancedStateFlag // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct AGameCharacter* GameCharacter(); // Function /Script/Game.AISMInstance.GameCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct AGameAIController* GameAIController(); // Function /Script/Game.AISMInstance.GameAIController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool CheckHasTrapActorTarget(); // Function /Script/Game.AISMInstance.CheckHasTrapActorTarget // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CheckHasSceneTarget(); // Function /Script/Game.AISMInstance.CheckHasSceneTarget // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CheckHasCharacterActorTarget(); // Function /Script/Game.AISMInstance.CheckHasCharacterActorTarget // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool CanInFight(); // Function /Script/Game.AISMInstance.CanInFight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.AIStateMachineComponent
// Size: 0x0 (Inherited: 0x0)
struct UAIStateMachineComponent : USMStateMachineComponent {
};

 // Class /Script/Game.AIStateParams_Fight
// Size: 0x0 (Inherited: 0x0)
struct UAIStateParams_Fight : UAIBaseStateParams {
	bool bCustomTCQ; // 0x0(0x0)
	char pad_29[0x7]; // 0x0(0x0)
	struct UEnvQuery* TargetChooseQuery; // 0x0(0x0)
	struct FAISkillConf Skills; // 0x0(0x0)
	struct FAIMoveConf MoveConf; // 0x0(0x0)
	struct TArray<struct FFightAIEventConf> FightAIEventConfs; // 0x0(0x0)
};

 // Class /Script/Game.PatrolPoint
// Size: 0x0 (Inherited: 0x0)
struct APatrolPoint : AActor {
	struct UCapsuleComponent* Capsule; // 0x0(0x0)
};

 // Class /Script/Game.PatrolPathDefiner
// Size: 0x0 (Inherited: 0x0)
struct APatrolPathDefiner : AActor {
	struct TArray<struct FPatrolSection> Sections; // 0x0(0x0)
};

 // Class /Script/Game.AIStateParams_Patrol
// Size: 0x0 (Inherited: 0x0)
struct UAIStateParams_Patrol : UAIBaseStateParams {
	float SpeedModify; // 0x0(0x0)
	char pad_2C[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AITeamLogic
// Size: 0x0 (Inherited: 0x0)
struct AAITeamLogic : AActor {
	struct UArrowComponent* ArrowComponent; // 0x0(0x0)
	struct FTeamSafeAreaStoreInfo TeamSafeAreaStoreInfo; // 0x0(0x0)
	struct TArray<struct AGameCharacter*> TeamMembers; // 0x0(0x0)
	__int32 MembersMaxNum; // 0x0(0x0)
	char pad_254[0x4]; // 0x0(0x0)
	struct FString Name; // 0x0(0x0)
	struct TArray<struct AAITeamSlot*> Slots; // 0x0(0x0)
	enum class ESlotTowardType SlotTowardType; // 0x0(0x0)
	char pad_279[0x3]; // 0x0(0x0)
	float SlotRotationRate; // 0x0(0x0)
	bool bIsCaptainFiring; // 0x0(0x0)
	char pad_281[0x7]; // 0x0(0x0)
	struct FFireInfo CaptainFireInfo; // 0x0(0x0)
	struct UAITeamSlotConfigAsset* TeamSlotConfig; // 0x0(0x0)
	struct UAITeamSlotConfigAsset* SpecialTeamSlotConfig; // 0x0(0x0)
	char pad_2D8[0x58]; // 0x0(0x0)
	bool bTeamHadInFight; // 0x0(0x0)
	char pad_331[0x7]; // 0x0(0x0)
	struct TArray<struct TWeakObjectPtr<struct AGameCharacter>> CustomTeamMembers; // 0x0(0x0)
	char pad_348[0x10]; // 0x0(0x0)

	void UpdateSlotConfig(); // Function /Script/Game.AITeamLogic.UpdateSlotConfig // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetTeamSlotConfig(struct FString ConfigName); // Function /Script/Game.AITeamLogic.SetTeamSlotConfig // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetSpecialTeamSlotConfig(struct UAITeamSlotConfigAsset* InAITeamSlotConfig); // Function /Script/Game.AITeamLogic.SetSpecialTeamSlotConfig // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetCaptain(struct AGameCharacter* Char); // Function /Script/Game.AITeamLogic.SetCaptain // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveMember(struct AGameCharacter* Char); // Function /Script/Game.AITeamLogic.RemoveMember // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool RefreshMembersMaxNum(); // Function /Script/Game.AITeamLogic.RefreshMembersMaxNum // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnTeamMemberDie(struct AGameCharacter* InCharacter, struct AGameCharacter* Killer, struct FHealthChangeValue& HealthChangeValue); // Function /Script/Game.AITeamLogic.OnTeamMemberDie // (Final|Native|Protected|HasOutParms) // @ game+0
	void OnTeamMemberDestroy(struct AActor* DestroyedActor); // Function /Script/Game.AITeamLogic.OnTeamMemberDestroy // (Final|Native|Protected) // @ game+0
	void OnCaptainStopFire(); // Function /Script/Game.AITeamLogic.OnCaptainStopFire // (Final|Native|Protected) // @ game+0
	void OnCaptainFire(struct FFireInfo Info, bool bStartFire); // Function /Script/Game.AITeamLogic.OnCaptainFire // (Final|Native|Protected) // @ game+0
	bool IsSlotEmpty(__int32 SlotIndex, float CheckEmptyRadius); // Function /Script/Game.AITeamLogic.IsSlotEmpty // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FString GetTeamName(); // Function /Script/Game.AITeamLogic.GetTeamName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct FTransform GetSlotTransformByIndex(__int32 SlotIndex); // Function /Script/Game.AITeamLogic.GetSlotTransformByIndex // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0
	struct FTransform GetNextEmptySlotTrans(); // Function /Script/Game.AITeamLogic.GetNextEmptySlotTrans // (Final|Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0
	__int32 GetMembersMaxNum(); // Function /Script/Game.AITeamLogic.GetMembersMaxNum // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct UAITeamSlotConfigAsset* GetCurrentTeamSlotConfig(); // Function /Script/Game.AITeamLogic.GetCurrentTeamSlotConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool GetCaptainIsFiring(); // Function /Script/Game.AITeamLogic.GetCaptainIsFiring // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct FFireInfo GetCaptainFireInfo(); // Function /Script/Game.AITeamLogic.GetCaptainFireInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	struct AGameCharacter* GetCaptain(); // Function /Script/Game.AITeamLogic.GetCaptain // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<struct AGameCharacter*> GetAllMembersPtr(bool bNotCaptain); // Function /Script/Game.AITeamLogic.GetAllMembersPtr // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void ClearTemporaryMembers(struct AActor* InOwner); // Function /Script/Game.AITeamLogic.ClearTemporaryMembers // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ClearForeverMembers(struct AActor* InOwner); // Function /Script/Game.AITeamLogic.ClearForeverMembers // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct TArray<__int32> ClearExcessMembers(__int32 ClearNum); // Function /Script/Game.AITeamLogic.ClearExcessMembers // (Final|Native|Public|BlueprintCallable) // @ game+0
	void CleanSpecialTeamSlotConfig(); // Function /Script/Game.AITeamLogic.CleanSpecialTeamSlotConfig // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AddMember(struct AGameCharacter* Char, __int32 ForceIndex); // Function /Script/Game.AITeamLogic.AddMember // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AITeamSlotConfig
// Size: 0x0 (Inherited: 0x0)
struct AAITeamSlotConfig : AActor {
	struct TArray<struct USlotConfigComponent*> SlotComponents; // 0x0(0x0)
};

 // Class /Script/Game.SlotConfigComponent
// Size: 0x0 (Inherited: 0x0)
struct USlotConfigComponent : UArrowComponent {
	__int32 Index; // 0x0(0x0)
};

 // Class /Script/Game.AITeamSlot
// Size: 0x0 (Inherited: 0x0)
struct AAITeamSlot : AActor {
	struct USlotConfigComponent* SlotConfigComponent; // 0x0(0x0)
	char pad_228[0x18]; // 0x0(0x0)
};

 // Class /Script/Game.AITeamSlotConfigAsset
// Size: 0x0 (Inherited: 0x0)
struct UAITeamSlotConfigAsset : UDataAsset {
	struct TArray<struct FTeamSlotConfigInfo> TeamSlotConfigInfos; // 0x0(0x0)
};

 // Class /Script/Game.AlphaCanvasPanel
// Size: 0x0 (Inherited: 0x0)
struct UAlphaCanvasPanel : UCanvasPanel {
	struct FSlateBrush MaskTexture; // 0x0(0x0)
};

 // Class /Script/Game.AlphaMaskImage
// Size: 0x0 (Inherited: 0x0)
struct UAlphaMaskImage : UImage {
	struct FString PaintingType; // 0x0(0x0)
	bool bApplyAlphaMask; // 0x0(0x0)
	char pad_239[0x17]; // 0x0(0x0)
};

 // Class /Script/Game.AnimCurveBackup
// Size: 0x0 (Inherited: 0x0)
struct UAnimCurveBackup : UDataAsset {
	struct TArray<struct FFloatCurve> Curves; // 0x0(0x0)
};

 // Class /Script/Game.AnimInstance_Drone
// Size: 0x0 (Inherited: 0x0)
struct UAnimInstance_Drone : UAnimInstance {
	struct UAnimSequenceBase* Base_Move; // 0x0(0x0)
	struct UAimOffsetBlendSpace* AO_MoveBlendSpace; // 0x0(0x0)
	float RightSpeed; // 0x0(0x0)
	float ForwardAcceleration; // 0x0(0x0)
	float CaclAccelarationSpeedScale; // 0x0(0x0)
	float InterpSpeed; // 0x0(0x0)
	float LastForwardSpeed; // 0x0(0x0)
};

 // Class /Script/Game.AnimInstance_Fishing
// Size: 0x0 (Inherited: 0x0)
struct UAnimInstance_Fishing : UAnimInstance {
	struct UAnimSequenceBase* Idle; // 0x0(0x0)
	struct UAnimSequenceBase* Wait; // 0x0(0x0)
	struct UAnimSequenceBase* Battle; // 0x0(0x0)
	struct UAnimSequenceBase* Throw; // 0x0(0x0)
	struct UAnimSequenceBase* PullStart; // 0x0(0x0)
	struct UAnimSequenceBase* PullEnd; // 0x0(0x0)
	struct AGameCharacter* OwnerCharacter; // 0x0(0x0)
	struct UCurveSequenceControllerAnimInstance* MainAnimInstance; // 0x0(0x0)
	enum class EFishingStage FishingStage; // 0x0(0x0)

	void OnFishingEvent(enum class EFishingEvent NewEvent); // Function /Script/Game.AnimInstance_Fishing.OnFishingEvent // (Final|Native|Public) // @ game+0
};

 // Class /Script/Game.AnimInstanceBase
// Size: 0x0 (Inherited: 0x0)
struct UAnimInstanceBase : UCurveSequenceControllerAnimInstance {
	struct USMStateMachineComponent* StateMachine; // 0x0(0x0)
	struct FVector HitDirection; // 0x0(0x0)
	bool bIsWeaponHandOff; // 0x0(0x0)
	bool bEnableTargetWarping; // 0x0(0x0)
	char pad_436[0x72]; // 0x0(0x0)
	struct TArray<struct UAnimNotifyState_HandOffWeapon*> WeaponOffNotifys; // 0x0(0x0)
	char pad_4B8[0x58]; // 0x0(0x0)

	void StopMontageBySlotGroup(struct FString InGroupSlotName); // Function /Script/Game.AnimInstanceBase.StopMontageBySlotGroup // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool SetStateEventId(char StateMachineIdx, char EventId); // Function /Script/Game.AnimInstanceBase.SetStateEventId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void SetHitDirection(struct FVector Direction); // Function /Script/Game.AnimInstanceBase.SetHitDirection // (Native|Public|HasDefaults) // @ game+0
	void ReplaceMontageByVariableName(struct FString OldVariableName, struct FString NewVariableName, bool bLoadAnim_External); // Function /Script/Game.AnimInstanceBase.ReplaceMontageByVariableName // (Native|Public|BlueprintCallable) // @ game+0
	void ReplaceBlendSpaceByVariableName(struct FString OldVariableName, struct FString NewVariableName, bool bLoadAnim_External); // Function /Script/Game.AnimInstanceBase.ReplaceBlendSpaceByVariableName // (Native|Public|BlueprintCallable) // @ game+0
	void ReplaceBlendSpace1DByVariableName(struct FString OldVariableName, struct FString NewVariableName, bool bLoadAnim_External); // Function /Script/Game.AnimInstanceBase.ReplaceBlendSpace1DByVariableName // (Native|Public|BlueprintCallable) // @ game+0
	void ReplaceAnimSequenceByVariableName(struct FString OldVariableName, struct FString NewVariableName, bool bLoadAnim_External); // Function /Script/Game.AnimInstanceBase.ReplaceAnimSequenceByVariableName // (Native|Public|BlueprintCallable) // @ game+0
	void OnMontageStartedHandler(struct UAnimMontage* Montage); // Function /Script/Game.AnimInstanceBase.OnMontageStartedHandler // (Final|Native|Protected) // @ game+0
	void OnMontageEndedHandler(struct UAnimMontage* Montage, bool bInterrupted); // Function /Script/Game.AnimInstanceBase.OnMontageEndedHandler // (Native|Protected) // @ game+0
	void OnMontageBlendingOutHandler(struct UAnimMontage* Montage, bool bInterrupted); // Function /Script/Game.AnimInstanceBase.OnMontageBlendingOutHandler // (Final|Native|Protected) // @ game+0
	void OnCharacterHit(struct FVector Direction, float Strength, struct FString BoneName); // Function /Script/Game.AnimInstanceBase.OnCharacterHit // (Native|Public|HasDefaults) // @ game+0
	void LoadMontageAndPlay(struct FString MontageName); // Function /Script/Game.AnimInstanceBase.LoadMontageAndPlay // (Final|Native|Public|BlueprintCallable) // @ game+0
	void LoadAnimSequanceAndPlayBySlotGroup(struct FString SequenceName, struct FString InGroupSlotName, __int32 LoopCount); // Function /Script/Game.AnimInstanceBase.LoadAnimSequanceAndPlayBySlotGroup // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsInFightState(); // Function /Script/Game.AnimInstanceBase.IsInFightState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsAlive(); // Function /Script/Game.AnimInstanceBase.IsAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool HasTarget(); // Function /Script/Game.AnimInstanceBase.HasTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool HasPatrolPath(); // Function /Script/Game.AnimInstanceBase.HasPatrolPath // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetPartHearth(struct ACharacterAccessory* AccessoryClass); // Function /Script/Game.AnimInstanceBase.GetPartHearth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	char GetCurrentStateId(char StateMachineIdx); // Function /Script/Game.AnimInstanceBase.GetCurrentStateId // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	char GetBlackboardState(enum class ESMBlackboardMask Mask); // Function /Script/Game.AnimInstanceBase.GetBlackboardState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float GetAnimMontageCurveData(struct UAnimMontage* InAnimMontage, struct FName InCurveName); // Function /Script/Game.AnimInstanceBase.GetAnimMontageCurveData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.MonsterAnimInstance
// Size: 0x0 (Inherited: 0x0)
struct UMonsterAnimInstance : UAnimInstanceBase {
	struct UAnimInstance* AnimLinkLayerClass; // 0x0(0x0)

	void ClampAimOffset_Yaw(struct FVector2D& AimoffsetRange_Yaw, struct FRotator& OutAimOffset); // Function /Script/Game.MonsterAnimInstance.ClampAimOffset_Yaw // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0
	void ClampAimOffset_Pitch(struct FVector2D& AimoffsetRange_Pitch, struct FRotator& OutAimOffset); // Function /Script/Game.MonsterAnimInstance.ClampAimOffset_Pitch // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0
	struct FVector CalcBoneLookAt(struct FName& BoneName, struct FVector& Offset1, struct FVector& Offset2, bool bTrans, bool bComponentTrans); // Function /Script/Game.MonsterAnimInstance.CalcBoneLookAt // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.AnimInstance_Humanoid
// Size: 0x0 (Inherited: 0x0)
struct UAnimInstance_Humanoid : UMonsterAnimInstance {
	struct TArray<struct UAnimSequence*> IdleAnims; // 0x0(0x0)
	struct TArray<struct UAnimSequence*> RandomIdleAnims; // 0x0(0x0)
	struct FVector2D AimoffsetRange_Yaw; // 0x0(0x0)
	struct FVector2D AimoffsetRange_Pitch; // 0x0(0x0)
	struct FName CharEyeSocketName; // 0x0(0x0)
	bool bUseBoneTransAsCharEye; // 0x0(0x0)
	bool bUseProjectAimoffset; // 0x0(0x0)
	char pad_54A[0x2]; // 0x0(0x0)
	float AimTargetHeightOffset; // 0x0(0x0)
	struct FVector AimRightVector; // 0x0(0x0)
	struct FVector AimUpVector; // 0x0(0x0)
	struct FVector2D MoveDirection; // 0x0(0x0)
	float Speed; // 0x0(0x0)
	struct FRotator AimOffset; // 0x0(0x0)
	bool bInWalking; // 0x0(0x0)
	char pad_581[0x3]; // 0x0(0x0)
	float RepelKeepTime; // 0x0(0x0)
	float HitStrength; // 0x0(0x0)
	float GetUpTime; // 0x0(0x0)
	enum class EAbnormalState AbnormalState; // 0x0(0x0)
	char pad_591[0x3]; // 0x0(0x0)
	struct FVector HeadIkOffSet1; // 0x0(0x0)
	struct FVector HeadIkOffSet2; // 0x0(0x0)
	bool bTrans; // 0x0(0x0)
	bool bUseComponentLookAt; // 0x0(0x0)
	char pad_5AE[0x6]; // 0x0(0x0)
	bool bIsFalling; // 0x0(0x0)
	bool bIsCastingSkillInAnim; // 0x0(0x0)
	bool bIsInOutControl; // 0x0(0x0)
	bool bIsInAbnormal; // 0x0(0x0)
	bool bIsUnactivatedIdle; // 0x0(0x0)
	bool bDisableHeadIK; // 0x0(0x0)
	bool bIsMoving; // 0x0(0x0)
	bool bIsStand_OutsideBunker; // 0x0(0x0)
	struct FVector HeadIkTarget; // 0x0(0x0)
	struct UAnimSequence* UsedIdleAnim; // 0x0(0x0)

	void OnAdditiveHit(struct FVector InHitDirection, float Strength, struct FString BoneName); // Function /Script/Game.AnimInstance_Humanoid.OnAdditiveHit // (Final|Native|Protected|HasDefaults) // @ game+0
	void OnAbnormalUpdate(struct FAbnormalInfo& Info, bool bAdd, bool bNewApply, bool bForceRemove); // Function /Script/Game.AnimInstance_Humanoid.OnAbnormalUpdate // (Final|Native|Protected|HasOutParms) // @ game+0
	struct UAnimInstance_Locomotion* GetLocomotionAnimInstance(); // Function /Script/Game.AnimInstance_Humanoid.GetLocomotionAnimInstance // (Final|Native|Public) // @ game+0
	bool GetIsInBunker(); // Function /Script/Game.AnimInstance_Humanoid.GetIsInBunker // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0
	struct UAnimSequence* GetIdleAnim(); // Function /Script/Game.AnimInstance_Humanoid.GetIdleAnim // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0
	struct FVector2D DirectionFilter(struct FVector2D& Direction, float MinValue); // Function /Script/Game.AnimInstance_Humanoid.DirectionFilter // (Final|Native|Static|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0
};

 // Class /Script/Game.AnimInstance_Locomotion
// Size: 0x0 (Inherited: 0x0)
struct UAnimInstance_Locomotion : UAnimInstance {
	struct UAnimSequenceBase* Falling_Fight_Stand; // 0x0(0x0)
	struct UAnimSequenceBase* Falling_Loop; // 0x0(0x0)
	struct UAnimSequenceBase* Falling_End; // 0x0(0x0)
	struct UAnimSequenceBase* Bunker_Start_Left; // 0x0(0x0)
	struct UAnimSequenceBase* Bunker_Loop_Left; // 0x0(0x0)
	struct UAnimSequenceBase* Bunker_End_Left; // 0x0(0x0)
	struct UAnimSequenceBase* Bunker_Start_Right; // 0x0(0x0)
	struct UAnimSequenceBase* Bunker_Loop_Right; // 0x0(0x0)
	struct UAnimSequenceBase* Bunker_End_Right; // 0x0(0x0)
	struct UBlendSpaceBase* Move_Fight; // 0x0(0x0)
	struct UBlendSpaceBase* Move_Base; // 0x0(0x0)
	enum class EMoveBlendToggleType MoveBlendToggleType; // 0x0(0x0)
	struct ACharacterAccessory* WeaponClass; // 0x0(0x0)
	struct UAnimMontage* Stop_Montage; // 0x0(0x0)
	struct UAnimMontage* Launch_Montage; // 0x0(0x0)
	bool bIsInBunker; // 0x0(0x0)
	bool bIsEnteringBunker; // 0x0(0x0)
	bool bIsLeavingBunker; // 0x0(0x0)
	float BunkerDistRatio; // 0x0(0x0)
	enum class EBunkerAnimType BunkerAnimType; // 0x0(0x0)
	char pad_339[0x3]; // 0x0(0x0)
	float Speed; // 0x0(0x0)
	bool bIsFaceToMoveDir; // 0x0(0x0)
	char pad_341[0x3]; // 0x0(0x0)
	float MoveToControllerAngle; // 0x0(0x0)
	bool bIsCastingSkill; // 0x0(0x0)
	char pad_349[0x3]; // 0x0(0x0)
	float MaxSpeed; // 0x0(0x0)
	bool bIsFalling; // 0x0(0x0)
	bool bIsFighting; // 0x0(0x0)
	bool bHasGun; // 0x0(0x0)
	bool bToggleMoveBlend; // 0x0(0x0)
	float ScaleHorizontalSpeed; // 0x0(0x0)
	float HorizontalSpeed; // 0x0(0x0)
	char pad_35C[0x4]; // 0x0(0x0)

	struct AGameAICharacter* GetAIOwner(); // Function /Script/Game.AnimInstance_Locomotion.GetAIOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
};

 // Class /Script/Game.AnimInstance_PostProcess
// Size: 0x0 (Inherited: 0x0)
struct UAnimInstance_PostProcess : UCurveSequenceControllerAnimInstance {
	struct UAnimSequenceBase* HitReactAnim; // 0x0(0x0)
	struct TMap<enum class EHitDirectionType, struct FHitReactSectionInfo> HitReactAnimContainer; // 0x0(0x0)
	struct TArray<struct FBoneReference> ExcludBoneContainer; // 0x0(0x0)
	struct FSeasunInputBlendPose CustomLayerSetup; // 0x0(0x0)
	float HitReactionCoolDownTime; // 0x0(0x0)
	float HitReactionDuration; // 0x0(0x0)
	float BlendInTime; // 0x0(0x0)
	float BlendOutTime; // 0x0(0x0)
	float PlayRate; // 0x0(0x0)
	float AlphaScale; // 0x0(0x0)
	struct FName SlotName; // 0x0(0x0)
	struct TMap<enum class EHitReactPerformance, struct FHitReactPerformanceData> HitReactPerformanceContainer; // 0x0(0x0)
	struct AGameCharacter* OwnerCharacter; // 0x0(0x0)
	struct UCurveSequenceControllerAnimInstance* MainAnimInstance; // 0x0(0x0)
	float HitReactElapsedTime; // 0x0(0x0)
	float HitReactCoolDownElapsedTime; // 0x0(0x0)
	float HitReactAlpha; // 0x0(0x0)
	char pad_524[0x4]; // 0x0(0x0)
	struct FHitReactPerformanceData CurHitReactPerformanceData; // 0x0(0x0)
	char pad_5B8[0x8]; // 0x0(0x0)

	void OnOwenerDoHitReaction(struct FApplyHitPhysicalResultData& HitDamage); // Function /Script/Game.AnimInstance_PostProcess.OnOwenerDoHitReaction // (Final|Native|Protected|HasOutParms) // @ game+0
};

 // Class /Script/Game.AnimMoveStateBase
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateBase : UObject {
	struct AGamePlayer* Player; // 0x0(0x0)
	struct UGameCharacterAnimInstance* AnimInstance; // 0x0(0x0)
	char pad_38[0x38]; // 0x0(0x0)
	struct TArray<struct FAccesoryInstanceInfo> AccessoyInfos; // 0x0(0x0)

	void Update(float DeltaTime); // Function /Script/Game.AnimMoveStateBase.Update // (Native|Public|BlueprintCallable) // @ game+0
	void Start(); // Function /Script/Game.AnimMoveStateBase.Start // (Native|Public|BlueprintCallable) // @ game+0
	void Exit(); // Function /Script/Game.AnimMoveStateBase.Exit // (Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AnimMoveStateBunker
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateBunker : UAnimMoveStateBase {
	char pad_80[0x10]; // 0x0(0x0)
};

 // Class /Script/Game.AnimMoveStateDistanceMap
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateDistanceMap : UAnimMoveStateBase {
	float EnableLerpTimeProgress; // 0x0(0x0)
	float CurrentAccDirBlendSpd; // 0x0(0x0)
	char pad_88[0xE8]; // 0x0(0x0)
};

 // Class /Script/Game.AnimMoveStateIdle
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateIdle : UAnimMoveStateBase {
	float PlayIdleIntervale; // 0x0(0x0)
	__int32 IdleSwitchCount; // 0x0(0x0)
	char pad_88[0x8]; // 0x0(0x0)
	struct UAnimMontage* IdleMontage; // 0x0(0x0)
	char pad_98[0x8]; // 0x0(0x0)
};

 // Class /Script/Game.AnimMoveStateLaunch
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateLaunch : UAnimMoveStateDistanceMap {
	struct TMap<struct FString, struct FMontageSectionInfo> LaunchSectionInfos; // 0x0(0x0)
};

 // Class /Script/Game.AnimMoveStatePivot
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStatePivot : UAnimMoveStateDistanceMap {
	struct TMap<struct FString, struct FMontageSectionInfo> RunSectionInfos; // 0x0(0x0)
	struct TMap<struct FString, struct FMontageSectionInfo> RushSectionInfos; // 0x0(0x0)
	float RushReEntryTime_TurnLeft; // 0x0(0x0)
	float RushReEntryTime_TurnRight; // 0x0(0x0)
	float RunReEntryTime_TurnLeft; // 0x0(0x0)
	float RunReEntryTime_TurnRight; // 0x0(0x0)
	float PivotReEntryTime; // 0x0(0x0)
	bool bPivotingKeepEnterAcc; // 0x0(0x0)
	char pad_225[0x3]; // 0x0(0x0)
	float fPivotAccLerpSpd; // 0x0(0x0)
	float fPivotAccLerpAngle; // 0x0(0x0)
	char pad_230[0x10]; // 0x0(0x0)
};

 // Class /Script/Game.AnimMoveStateRun
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateRun : UAnimMoveStateBase {
};

 // Class /Script/Game.AnimMoveStateRush
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateRush : UAnimMoveStateBase {
	struct FName LeftSectionName; // 0x0(0x0)
	struct FName RightSectionName; // 0x0(0x0)
	struct FName LoopSectionName; // 0x0(0x0)
};

 // Class /Script/Game.AnimMoveStateSkill
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateSkill : UAnimMoveStateBase {
};

 // Class /Script/Game.AnimMoveStateStop
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateStop : UAnimMoveStateBase {
	struct UAnimMontage* StopMontage; // 0x0(0x0)
	char pad_88[0x4]; // 0x0(0x0)
	float RushStopTime; // 0x0(0x0)
	struct UAnimMontage* RunMontage; // 0x0(0x0)
	struct UAnimMontage* RushMontage; // 0x0(0x0)
};

 // Class /Script/Game.AnimMoveStateTurnInPlace
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateTurnInPlace : UAnimMoveStateBase {
	float TurnDelay; // 0x0(0x0)
	float FastTurnAngle; // 0x0(0x0)
	struct UAnimMontage* CurrentMontage; // 0x0(0x0)
	char pad_90[0x40]; // 0x0(0x0)
};

 // Class /Script/Game.AnimMoveStateWalk
// Size: 0x0 (Inherited: 0x0)
struct UAnimMoveStateWalk : UAnimMoveStateBase {
};

 // Class /Script/Game.CustomAnimNotify
// Size: 0x0 (Inherited: 0x0)
struct UCustomAnimNotify : UAnimNotify {
	char pad_38[0x1]; // 0x0(0x0)
	char bIsClient : 1; // 0x0(0x0)
	char bClientAndServer : 1; // 0x0(0x0)
	char bIsLocalClient : 1; // 0x0(0x0)
	char pad_39_3 : 5; // 0x0(0x0)
	char pad_3A[0x6]; // 0x0(0x0)

	void ReceiveNotify(struct AActor* Character, struct AGameSkill* GameSkill); // Function /Script/Game.CustomAnimNotify.ReceiveNotify // (Event|Protected|BlueprintCallable|BlueprintEvent|Const) // @ game+0
};

 // Class /Script/Game.AnimNotify_AbilityNotify
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_AbilityNotify : UCustomAnimNotify {
	struct FString ParamName; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_BulletLoaded
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_BulletLoaded : UAnimNotify {
	struct FString NotifyName; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_Camera
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_Camera : UAnimNotify_AbilityNotify {
	struct FName CameraSocketName; // 0x0(0x0)
	char bActiveSocketAnimation : 1; // 0x0(0x0)
	char pad_58_1 : 7; // 0x0(0x0)
	char pad_59[0x3]; // 0x0(0x0)
	float MaxCameraTime; // 0x0(0x0)
	float CameraBlendInTime; // 0x0(0x0)
	float CameraBlendOutTime; // 0x0(0x0)
	bool bApplySceneTranslucent; // 0x0(0x0)
	char pad_69[0x7]; // 0x0(0x0)
	struct UCurveFloat* FOVCurve; // 0x0(0x0)
	struct FVector TargetCameraPosition; // 0x0(0x0)
	bool bStopTempCamera; // 0x0(0x0)
	char pad_85[0x3]; // 0x0(0x0)
	float EndTime; // 0x0(0x0)
	bool bUseTempCameraPosition; // 0x0(0x0)
	char pad_8D[0x3]; // 0x0(0x0)
	float WaitTimeEnd; // 0x0(0x0)
	bool bCancelSkillStopCamera; // 0x0(0x0)
	char pad_95[0x3]; // 0x0(0x0)
	float TempArmLengthOffset; // 0x0(0x0)
	float TempCameraFOVOffset; // 0x0(0x0)
	struct FVector TempSocketOffset; // 0x0(0x0)
	struct FVector TempArmPosition; // 0x0(0x0)
	float TempLerpSpeed; // 0x0(0x0)
	char pad_BC[0x4]; // 0x0(0x0)
	struct FRuntimeFloatCurve FadeIn; // 0x0(0x0)
	struct FRuntimeFloatCurve FadeOut; // 0x0(0x0)
	bool bLockCamera; // 0x0(0x0)
	char pad_1D1[0x7]; // 0x0(0x0)
	struct FRuntimeFloatCurve LagCurve; // 0x0(0x0)
	float MaxLagDistance; // 0x0(0x0)
	float LagWaitTimeEnd; // 0x0(0x0)
	char bInLockCamera : 1; // 0x0(0x0)
	char bInTempCamera : 1; // 0x0(0x0)
	char pad_268_2 : 6; // 0x0(0x0)
	char pad_269[0x7]; // 0x0(0x0)

	void StopCameraCurve(struct AGameCharacter* Character); // Function /Script/Game.AnimNotify_Camera.StopCameraCurve // (Final|Native|Protected|Const) // @ game+0
};

 // Class /Script/Game.AnimNotify_CameraAnimation
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_CameraAnimation : UAnimNotify_AbilityNotify {
	enum class ECameraAnimationType AnimationType; // 0x0(0x0)
	enum class ECameraTargetMode CameraTargetMode; // 0x0(0x0)
	char Priority; // 0x0(0x0)
	bool bHideBunker; // 0x0(0x0)
	enum class EEnableBunker EnableInBunker; // 0x0(0x0)
	enum class EEnableBunkerMode FullBunkerMode; // 0x0(0x0)
	bool bIgnoreBunkerEffect; // 0x0(0x0)
	bool bDoCollisionTest; // 0x0(0x0)
	bool bStopAnimWhenInterrupted; // 0x0(0x0)
	bool bUseBaseCameraBlendIn; // 0x0(0x0)
	bool bCancelAnimationAtTheEndOfTime; // 0x0(0x0)
	bool bUseCameraOffset; // 0x0(0x0)
	bool bFollowControlRotation; // 0x0(0x0)
	bool bEnableLocationLag; // 0x0(0x0)
	char LagSpeed; // 0x0(0x0)
	char pad_5F[0x1]; // 0x0(0x0)
	float MaxLagDistance; // 0x0(0x0)
	char pad_64[0x4]; // 0x0(0x0)
	struct UCurveFloat* LagSpeedCurve; // 0x0(0x0)
	float fLerpSpeed; // 0x0(0x0)
	char pad_74[0x4]; // 0x0(0x0)
	struct UCurveFloat* LerpSpeedCurve; // 0x0(0x0)
	float fLagBlendOutTime; // 0x0(0x0)
	char pad_84[0x4]; // 0x0(0x0)
	struct FAlphaBlend BlendIn; // 0x0(0x0)
	struct FAlphaBlend BlendOut; // 0x0(0x0)
	float BlendTriggerTime; // 0x0(0x0)
	struct FName CameraSocketName; // 0x0(0x0)
	char pad_F4[0x4]; // 0x0(0x0)
	struct UCurveFloat* FOVCurve; // 0x0(0x0)
	struct UCurveFloat* LocationXCurve; // 0x0(0x0)
	float LocationOffsetX; // 0x0(0x0)
	float RecoverTime; // 0x0(0x0)
	struct UGameCameraAnimMetaData* CustomAnimationAsset; // 0x0(0x0)
	float TargetFOV; // 0x0(0x0)
	float TargetFOVOffset; // 0x0(0x0)
	struct FVector TargetAnimationPosition; // 0x0(0x0)
	bool bLockCamera; // 0x0(0x0)
	bool bApplySceneTranslucent; // 0x0(0x0)
	bool bAllowCameraOffset; // 0x0(0x0)
	char pad_12F[0x9]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_CameraAnimation_NotifyAll
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_CameraAnimation_NotifyAll : UAnimNotify_AbilityNotify {
	float CameraArmLength; // 0x0(0x0)
	struct FVector CameraSocketOffset; // 0x0(0x0)
	struct FVector CameraArmPosition; // 0x0(0x0)
	float CameraFOV; // 0x0(0x0)
	float BlendInSpeed; // 0x0(0x0)
	float BlendOutSpeed; // 0x0(0x0)
	float BlendOutTime; // 0x0(0x0)
	bool bIsBlendOut; // 0x0(0x0)
	char pad_7D[0x3]; // 0x0(0x0)
	float ViewPitchMinAdditive; // 0x0(0x0)
	float ViewPitchMaxAdditive; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_CameraPitchInterp
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_CameraPitchInterp : UAnimNotify {
	float InterpTime; // 0x0(0x0)
	float PitchValue; // 0x0(0x0)
	float YawValue; // 0x0(0x0)
	char pad_44[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_CameraShake
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_CameraShake : UAnimNotify {
	struct UCameraShakeBase* CameraShakeClass; // 0x0(0x0)
	struct FString NotifyName; // 0x0(0x0)
	float ShakeMaxValidDistance; // 0x0(0x0)
	bool bAttenuation; // 0x0(0x0)
	bool bEffectSelf; // 0x0(0x0)
	char pad_56[0x2]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_CameraYawClampControl
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_CameraYawClampControl : UAnimNotify_AbilityNotify {
	struct FString NotifyName; // 0x0(0x0)
	float MaxYawOffset; // 0x0(0x0)
	bool bCameraStopYawClamp; // 0x0(0x0)
	char pad_65[0x3]; // 0x0(0x0)
	float MaxPitchOffset; // 0x0(0x0)
	bool bCameraStopPitchClamp; // 0x0(0x0)
	char bInClampCamera : 1; // 0x0(0x0)
	char pad_6D_1 : 7; // 0x0(0x0)
	char pad_6E[0x2]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_ChessNpcInteractEnd
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_ChessNpcInteractEnd : UAnimNotify {
};

 // Class /Script/Game.AnimNotify_CustomMotionState
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_CustomMotionState : UAnimNotifyState {
	struct FAnimMotionCustomData MotionData; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_EmitterArray
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_EmitterArray : UAnimNotify_AbilityNotify {
	struct TArray<__int32> EmitterIDs; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_EmitterNotify
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_EmitterNotify : UAnimNotify_AbilityNotify {
	__int32 EmitterID; // 0x0(0x0)
	bool bMarkSkillCastSuccess; // 0x0(0x0)
	char pad_55[0x13]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_EndSkill
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_EndSkill : UAnimNotify_AbilityNotify {
	struct FString NotifyName; // 0x0(0x0)
	bool bNormalMove; // 0x0(0x0)
	bool bAutoEnd_Aiming; // 0x0(0x0)
	bool bForceSkillEnd; // 0x0(0x0)
	bool bForceReplayShootMontage; // 0x0(0x0)
	float fReplayShootMontagePlayRate; // 0x0(0x0)
	enum class EWeaponState ReplayShootMontageWeaponState; // 0x0(0x0)
	char pad_69[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_EnergyStorageEndPosition
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_EnergyStorageEndPosition : UAnimNotify_AbilityNotify {
	struct FString NotifyName; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_OnChessFootLanding
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_OnChessFootLanding : UAnimNotify {
};

 // Class /Script/Game.AnimNotify_PlayEffect
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayEffect : UAnimNotify_PlayParticleEffect {
	enum class EAttachLocation AttachLocation; // 0x0(0x0)
	char bLockLocation : 1; // 0x0(0x0)
	char bLockRotation : 1; // 0x0(0x0)
	char bHideInGame : 1; // 0x0(0x0)
	char bReplaceEffect : 1; // 0x0(0x0)
	char pad_91_4 : 4; // 0x0(0x0)
	enum class EParticleEndPlayTriggerType EndPlayTriggerType; // 0x0(0x0)
	enum class EParticleDisappearType DisappearType; // 0x0(0x0)
	float PlayRate; // 0x0(0x0)
	enum class EGPSCPoolMethod PoolMethod; // 0x0(0x0)
	bool bSolo; // 0x0(0x0)
	bool bDeattachWhenSwitch; // 0x0(0x0)
	bool bAimNoSpawn; // 0x0(0x0)
	struct TWeakObjectPtr<struct UFXSystemComponent> SpawnedEffect; // 0x0(0x0)
	char pad_A4[0xC]; // 0x0(0x0)

	struct UFXSystemComponent* GetSpawnedEffect(); // Function /Script/Game.AnimNotify_PlayEffect.GetSpawnedEffect // (Final|Native|Public|BlueprintCallable|Const) // @ game+0
};

 // Class /Script/Game.AnimNotify_PlayEffect_Niagara
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayEffect_Niagara : UAnimNotify_PlayNiagaraEffect {
	enum class EAttachLocation AttachLocation; // 0x0(0x0)
	char bLockLocation : 1; // 0x0(0x0)
	char bLockRotation : 1; // 0x0(0x0)
	char bHideInGame : 1; // 0x0(0x0)
	char bReplaceEffect : 1; // 0x0(0x0)
	char pad_91_4 : 4; // 0x0(0x0)
	enum class EParticleEndPlayTriggerType EndPlayTriggerType; // 0x0(0x0)
	enum class EParticleDisappearType DisappearType; // 0x0(0x0)
	float PlayRate; // 0x0(0x0)
	enum class EGPSCPoolMethod PoolMethod; // 0x0(0x0)
	bool bSolo; // 0x0(0x0)
	bool bDeattachWhenSwitch; // 0x0(0x0)
	bool bAimNoSpawn; // 0x0(0x0)
	char pad_9C[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_PlayEffect_Niagara_InBunker
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayEffect_Niagara_InBunker : UAnimNotify_PlayEffect_Niagara {
	bool bUseBunkerRot; // 0x0(0x0)
	char pad_A1[0xF]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_PlayEffectActor
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayEffectActor : UAnimNotify {
	struct FSoftClassPath EffectActorClassesPath; // 0x0(0x0)
	float EffectActorKeepTime; // 0x0(0x0)
	char pad_54[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_PlayFacialAnim
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayFacialAnim : UAnimNotifyState {
	__int32 FacialAnimDataID; // 0x0(0x0)
	char pad_34[0x24]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_PlayFacialAnim_Skm
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayFacialAnim_Skm : UAnimNotify {
	struct FString FacialAnimName; // 0x0(0x0)
	bool bUseWeaponName; // 0x0(0x0)
	char pad_49[0x3]; // 0x0(0x0)
	struct FName SlotName; // 0x0(0x0)
	float BlendTime; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_PlayVoice
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayVoice : UAnimNotify {
	struct FString VoiceID; // 0x0(0x0)
	__int32 CharacterID; // 0x0(0x0)
	bool bAttached; // 0x0(0x0)
	char pad_4D[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_PlayWeaponEffect
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayWeaponEffect : UAnimNotify_PlayParticleEffect {
};

 // Class /Script/Game.AnimNotify_PlayWeaponNiagaraEffect
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayWeaponNiagaraEffect : UAnimNotify_PlayNiagaraEffect {
};

 // Class /Script/Game.AnimNotify_PlayWwise
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_PlayWwise : UAnimNotify {
	struct FString EventName; // 0x0(0x0)
	char bAttached : 1; // 0x0(0x0)
	char pad_48_1 : 7; // 0x0(0x0)
	char pad_49[0x3]; // 0x0(0x0)
	struct FName SocketName; // 0x0(0x0)
	__int32 SwitchState; // 0x0(0x0)
	enum class EParticleEndPlayTriggerType EndPlayTriggerType; // 0x0(0x0)
	char pad_59[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_SamePriorityBreakPoint
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_SamePriorityBreakPoint : UAnimNotify_AbilityNotify {
	struct FString NotifyName; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_SelectorTrigger
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_SelectorTrigger : UAnimNotify_AbilityNotify {
	struct FString NotifyName; // 0x0(0x0)
	float JumpToTime; // 0x0(0x0)
	char pad_64[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_SetAccessoryMaterial
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_SetAccessoryMaterial : UAnimNotify {
	struct TMap<__int32, struct UMaterialInterface*> Materials; // 0x0(0x0)
	struct ACharacterAccessory* AccessoryClass; // 0x0(0x0)
};

 // Class /Script/Game.CustomAnimNotifyState
// Size: 0x0 (Inherited: 0x0)
struct UCustomAnimNotifyState : UAnimNotifyState {
	char pad_30[0x3]; // 0x0(0x0)
	char bIsClient : 1; // 0x0(0x0)
	char bClientAndServer : 1; // 0x0(0x0)
	char bIsLocalClient : 1; // 0x0(0x0)
	char bUniversalWheelTip : 1; // 0x0(0x0)
	char pad_33_4 : 4; // 0x0(0x0)
	char pad_34[0xC]; // 0x0(0x0)

	void ReceiveTick(struct AActor* Character, struct UAnimSequenceBase* Animation, float FrameDeltaTime, struct AGameSkill* GameSkillRef, __int32 HashValue); // Function /Script/Game.CustomAnimNotifyState.ReceiveTick // (Event|Protected|BlueprintCallable|BlueprintEvent|Const) // @ game+0
	void ReceiveStop(struct AActor* Character, struct UAnimSequenceBase* Animation, struct AGameSkill* GameSkillRef, __int32 HashValue); // Function /Script/Game.CustomAnimNotifyState.ReceiveStop // (Event|Protected|BlueprintCallable|BlueprintEvent|Const) // @ game+0
	void ReceiveActive(struct AActor* Character, struct UAnimSequenceBase* AnimSquence, float TotalDuration, struct AGameSkill* GameSkillRef, __int32 HashValue); // Function /Script/Game.CustomAnimNotifyState.ReceiveActive // (Event|Protected|BlueprintCallable|BlueprintEvent|Const) // @ game+0
	void CheckUniversalWheelTip(struct AActor* Character, float TotalDuration); // Function /Script/Game.CustomAnimNotifyState.CheckUniversalWheelTip // (Final|Native|Protected|Const) // @ game+0
};

 // Class /Script/Game.AnimNotifyState_Base
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_Base : UCustomAnimNotifyState {
	bool bSkillCanceled; // 0x0(0x0)
	char pad_41[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_ShowTraceWarningTips
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_ShowTraceWarningTips : UAnimNotifyState_Base {
	struct FString SocketName; // 0x0(0x0)
	struct FSoftObjectPath TraceParticlePath; // 0x0(0x0)
	struct FSoftObjectPath HitPointParticlePath; // 0x0(0x0)
	struct FSoftObjectPath HitPointBlinkParticlePath; // 0x0(0x0)
	float TraceLength; // 0x0(0x0)
	float WarningTime; // 0x0(0x0)
	float BlinkTime; // 0x0(0x0)
	enum class ECollisionChannel BulletChannel; // 0x0(0x0)
	char pad_AD[0x3]; // 0x0(0x0)
	struct FSoftClassPath PathClass; // 0x0(0x0)
	bool bIgnoreFriendly; // 0x0(0x0)
	char pad_C9[0x7]; // 0x0(0x0)
	struct TMap<struct AActor*, struct TWeakObjectPtr<struct ARayPathWarning>> PathRefMap; // 0x0(0x0)
	char pad_120[0x8]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_ShowTraceWarningTipsForEmitter
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_ShowTraceWarningTipsForEmitter : UAnimNotifyState_Base {
	struct FString SocketName; // 0x0(0x0)
	__int32 EmitterID; // 0x0(0x0)
	bool bTickSearch; // 0x0(0x0)
	char pad_5D[0x3]; // 0x0(0x0)
	struct FSoftObjectPath TraceParticlePath; // 0x0(0x0)
	struct FSoftObjectPath HitPointParticlePath; // 0x0(0x0)
	struct FSoftObjectPath HitPointBlinkParticlePath; // 0x0(0x0)
	float WarningTime; // 0x0(0x0)
	float BlinkTime; // 0x0(0x0)
	enum class ECollisionChannel BulletChannel; // 0x0(0x0)
	char pad_B1[0x7]; // 0x0(0x0)
	struct FSoftClassPath PathClass; // 0x0(0x0)
	bool bIgnoreFriendly; // 0x0(0x0)
	char pad_D1[0x7]; // 0x0(0x0)
	struct FQueryResult Target; // 0x0(0x0)
	struct TMap<struct AActor*, struct TWeakObjectPtr<struct ARayPathWarning>> PathRefMap; // 0x0(0x0)
	char pad_198[0x8]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_UniversalWheelTip
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_UniversalWheelTip : UAnimNotifyState_Base {
};

 // Class /Script/Game.RayPathWarning
// Size: 0x0 (Inherited: 0x0)
struct ARayPathWarning : AActor {
	struct TWeakObjectPtr<struct AActor> RayPathOwner; // 0x0(0x0)
	struct FString SocketName; // 0x0(0x0)
	struct FSoftObjectPath TraceParticlePath; // 0x0(0x0)
	struct FSoftObjectPath HitPointParticlePath; // 0x0(0x0)
	struct FSoftObjectPath HitPointBlinkParticlePath; // 0x0(0x0)
	float BlinkTime; // 0x0(0x0)
	float TraceLength; // 0x0(0x0)
	enum class ECollisionChannel BulletChannel; // 0x0(0x0)
	bool bIgnoreFriendly; // 0x0(0x0)
	char pad_28A[0x6]; // 0x0(0x0)
	struct FQueryResult AimTarget; // 0x0(0x0)
	struct UFXSystemComponent* RayParticleRef; // 0x0(0x0)
	struct UFXSystemComponent* RayHitParticleRef; // 0x0(0x0)
	char pad_310[0x8]; // 0x0(0x0)

	void K2_ShowHitRayParticle(struct AActor* RayOwner, struct FHitResult& HitResult); // Function /Script/Game.RayPathWarning.K2_ShowHitRayParticle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0
	void K2_RayParticleDeactive(); // Function /Script/Game.RayPathWarning.K2_RayParticleDeactive // (Event|Public|BlueprintEvent) // @ game+0
	void K2_FreshRayParticle(struct AActor* RayOwner, float DeltaTime); // Function /Script/Game.RayPathWarning.K2_FreshRayParticle // (Event|Public|BlueprintEvent) // @ game+0
	void K2_CreateRayParticle(struct AActor* RayOwner); // Function /Script/Game.RayPathWarning.K2_CreateRayParticle // (Event|Public|BlueprintEvent) // @ game+0
	void FreshAimTarget(struct FQueryResult Result); // Function /Script/Game.RayPathWarning.FreshAimTarget // (Net|Native|Event|NetMulticast|Public) // @ game+0
};

 // Class /Script/Game.AnimNotify_SkeletalMeshAnim
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_SkeletalMeshAnim : UAnimNotify_AbilityNotify {
	struct USkeletalMesh* SkeletalMesh; // 0x0(0x0)
	struct UAnimationAsset* Sequence; // 0x0(0x0)
	bool bAttach; // 0x0(0x0)
	char pad_61[0x3]; // 0x0(0x0)
	struct FName Socket; // 0x0(0x0)
	struct FVector LocationOffset; // 0x0(0x0)
	struct FRotator RotatorOffset; // 0x0(0x0)
	char pad_84[0x4]; // 0x0(0x0)
	struct FSoftClassPath SkeletalMeshAgentClass; // 0x0(0x0)
	enum class EEnableBunker EnableInBunker; // 0x0(0x0)
	enum class EEnableBunkerMode FullBunkerMode; // 0x0(0x0)
	char pad_A2[0x6]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_SkeletalMeshAnimState
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_SkeletalMeshAnimState : UAnimNotifyState_Base {
	struct USkeletalMesh* SkeletalMesh; // 0x0(0x0)
	struct UAnimationAsset* Sequence; // 0x0(0x0)
	bool bLoop; // 0x0(0x0)
	bool bAttach; // 0x0(0x0)
	char pad_5A[0x2]; // 0x0(0x0)
	struct FName Socket; // 0x0(0x0)
	struct FVector LocationOffset; // 0x0(0x0)
	struct FRotator RotatorOffset; // 0x0(0x0)
	struct FVector Scale; // 0x0(0x0)
	struct FSoftClassPath SkeletalMeshAgentClass; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveFloat*> FloatParameters; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveLinearColor*> ColorParameters; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveVector*> VectorParameters; // 0x0(0x0)
	enum class ECharacterRenderStateType StateType; // 0x0(0x0)
	bool bIsCharacterMaterial; // 0x0(0x0)
	char pad_192[0x6]; // 0x0(0x0)
	struct FMaterialStateParameter Parameters; // 0x0(0x0)
	enum class EEnableBunker EnableInBunker; // 0x0(0x0)
	enum class EEnableBunkerMode FullBunkerMode; // 0x0(0x0)
	char pad_1DA[0xE]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_SpeedWarpingState
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_SpeedWarpingState : UAnimNotifyState {
};

 // Class /Script/Game.AnimNotify_StartEnergyStorage
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_StartEnergyStorage : UAnimNotify_AbilityNotify {
	struct FString NotifyName; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_StorageCharacterTransform
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_StorageCharacterTransform : UAnimNotify_AbilityNotify {
	enum class EStorageRotationType TurnType; // 0x0(0x0)
	char pad_51[0x17]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotify_WeaponTempYawOffsetClamp
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotify_WeaponTempYawOffsetClamp : UAnimNotify_AbilityNotify {
	struct FString NotifyName; // 0x0(0x0)
	bool bStopTempOffset; // 0x0(0x0)
	char pad_61[0x3]; // 0x0(0x0)
	float TempAimOffset; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyBackup
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyBackup : UDataAsset {
	struct TArray<struct FSavedAnimNotify> Data; // 0x0(0x0)
};

 // Class /Script/Game.AnimSyncMarkerBackup
// Size: 0x0 (Inherited: 0x0)
struct UAnimSyncMarkerBackup : UDataAsset {
	struct TArray<struct FSavedAnimSyncMarker> Data; // 0x0(0x0)
};

 // Class /Script/Game.SkeletonSocketBackup
// Size: 0x0 (Inherited: 0x0)
struct USkeletonSocketBackup : UDataAsset {
	struct TArray<struct FSaveSkeletonSocket> Data; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_AbilityBuffer
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_AbilityBuffer : UAnimNotifyState {
	struct TArray<struct UGameAbilityBuffer*> ActiveBufferClasses; // 0x0(0x0)
	struct TArray<struct UGameAbilityBuffer*> ActiveBufferes; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_AimWithSkill
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_AimWithSkill : UAnimNotifyState_Base {
};

 // Class /Script/Game.AnimNotifyState_CameraLag
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_CameraLag : UAnimNotifyState_Base {
	struct UCurveFloat* LagCurve; // 0x0(0x0)
	float MaxLagDistance; // 0x0(0x0)
	char pad_54[0x4]; // 0x0(0x0)
	__int32 IndexTest; // 0x0(0x0)
	char pad_5C[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_CamLookTarget
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_CamLookTarget : UAnimNotifyState_Base {
	enum class EFaceToTargetType TargetType; // 0x0(0x0)
	char pad_49[0x3]; // 0x0(0x0)
	__int32 EmitterID; // 0x0(0x0)
	char pad_50[0x10]; // 0x0(0x0)
	struct TMap<struct AGameCharacter*, struct AActor*> TargetActorMap; // 0x0(0x0)
	struct TMap<struct AGameCharacter*, struct FBoneResult> EmitterTargetMap; // 0x0(0x0)
	struct TMap<struct AGameCharacter*, struct FVector> TargetLocMap; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_ChangeBoundsScale
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_ChangeBoundsScale : UAnimNotifyState_Base {
	float ChangeBoundsScale; // 0x0(0x0)
	char pad_4C[0x4]; // 0x0(0x0)
	struct TMap<struct USkeletalMeshComponent*, float> BoundsMap; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_CheckLocationValid
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_CheckLocationValid : UAnimNotifyState_Base {
	struct TArray<enum class EObjectTypeQuery> InvalidObjectTypes; // 0x0(0x0)
	struct FString NotifyName; // 0x0(0x0)
	char pad_68[0x38]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_CheckReloadEnd
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_CheckReloadEnd : UAnimNotifyState_Base {
	struct FName Section; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_CurveControlBase
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_CurveControlBase : UAnimNotifyState_Base {
	struct FSoftObjectPath CurveDataPath; // 0x0(0x0)
	char pad_60[0x10]; // 0x0(0x0)
	struct UCurveFloat* CurveData; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_AddRotation
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_AddRotation : UAnimNotifyState_CurveControlBase {
};

 // Class /Script/Game.AnimNotifyState_DisableAimOffsetLag
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_DisableAimOffsetLag : UAnimNotifyState {
	char pad_30[0x8]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_DisablePhysicalAnim
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_DisablePhysicalAnim : UAnimNotifyState {
};

 // Class /Script/Game.AnimNotifyState_DodgeBreakable
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_DodgeBreakable : UAnimNotifyState_Base {
	struct FString NotifyName; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_Dodgging
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_Dodgging : UAnimNotifyState {
};

 // Class /Script/Game.DropClipSettings
// Size: 0x0 (Inherited: 0x0)
struct UDropClipSettings : UObject {
	struct TArray<struct FDropClipRule> DropClipRules; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_DropClip
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_DropClip : UAnimNotifyState {
	char pad_30[0x8]; // 0x0(0x0)
	struct FName SocketName; // 0x0(0x0)
	float MinWeaponClipLifeTime; // 0x0(0x0)
	float MaxWeaponClipLifeTime; // 0x0(0x0)
	float RandomDropSpeed; // 0x0(0x0)
	char bImmediately : 1; // 0x0(0x0)
	char pad_4C_1 : 7; // 0x0(0x0)
	char pad_4D[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_EmitterNotify
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_EmitterNotify : UAnimNotifyState_Base {
	__int32 EmitterID; // 0x0(0x0)
	bool bKeepRunning; // 0x0(0x0)
	bool bNeedJumpToEndPosition; // 0x0(0x0)
	char pad_4E[0x12]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_EnableDerivedSkill
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_EnableDerivedSkill : UAnimNotifyState_Base {
	struct FString NotifyName; // 0x0(0x0)
	struct TArray<__int32> DerivedSkills; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_EnablePriorityBreakableSkill
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_EnablePriorityBreakableSkill : UAnimNotifyState_Base {
	struct FString NotifyName; // 0x0(0x0)
	struct TArray<__int32> SkillIDs; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_EnergyStorageParticle
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_EnergyStorageParticle : UAnimNotifyState_Base {
	struct TArray<struct FEnergyStorageEffect> Effects; // 0x0(0x0)
	struct TArray<struct FEnergyStorageEffect> KeepParticles; // 0x0(0x0)
	struct TMap<struct AGameSkill*, struct FEffectStorage> EffectGameRefMap; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_EnermySlomo
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_EnermySlomo : UAnimNotifyState_Base {
	struct FString CurveName; // 0x0(0x0)
	enum class ESlomoTarget TargetType; // 0x0(0x0)
	bool bScaleSlomo; // 0x0(0x0)
	enum class ESlomPriority SlomPriority; // 0x0(0x0)
	char pad_5B[0x15]; // 0x0(0x0)
	float CurrentTimeDilation; // 0x0(0x0)
	char pad_74[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_ExternalKawaiiPhysicSetting
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_ExternalKawaiiPhysicSetting : UAnimNotifyState {
	struct UCachedKawaiiPhysicsSettings* ExternalKawaiiPhysicsSettings; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_FaceToAimLoc
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_FaceToAimLoc : UAnimNotifyState_Base {
	enum class EFaceToTargetType TargetType; // 0x0(0x0)
	bool SkillUseCtrl; // 0x0(0x0)
	char pad_4A[0x2]; // 0x0(0x0)
	__int32 EmitterID; // 0x0(0x0)
	float RotatorSpeed; // 0x0(0x0)
	float LerpThreahold; // 0x0(0x0)
	bool bFaceApplyInBunker; // 0x0(0x0)
	char pad_59[0x17]; // 0x0(0x0)
	struct TMap<struct AGameCharacter*, struct AActor*> TargetActorMap; // 0x0(0x0)
	struct TMap<struct AGameCharacter*, struct FBoneResult> EmitterTargetMap; // 0x0(0x0)
	struct TMap<struct AGameCharacter*, struct FVector> TargetLocMap; // 0x0(0x0)
	float RotDuration; // 0x0(0x0)
	struct FRotator LastTargetRotator; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_HandIKCorrection
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_HandIKCorrection : UAnimNotifyState {
	struct FHandIKCorrectionBoneIno CorrectionData; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_HandOffWeapon
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_HandOffWeapon : UAnimNotifyState {
};

 // Class /Script/Game.AnimNotifyState_SetWeaponInvisible
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_SetWeaponInvisible : UAnimNotifyState_HandOffWeapon {
};

 // Class /Script/Game.AnimNotifyState_HideFightCross
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_HideFightCross : UAnimNotifyState {
};

 // Class /Script/Game.AnimNotifyState_InterruptEmitter
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_InterruptEmitter : UAnimNotifyState_Base {
	__int32 EmitterID; // 0x0(0x0)
	bool bEndExecute; // 0x0(0x0)
	char pad_4D[0x13]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_ModifyCustomRotationParam
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_ModifyCustomRotationParam : UAnimNotifyState_Base {
	struct FVector RotationSpeed_Add; // 0x0(0x0)
	char pad_54[0x4]; // 0x0(0x0)
	struct FRuntimeFloatCurve RatationRatio_AngleDiffCurve; // 0x0(0x0)
	float RatationRatio; // 0x0(0x0)
	float DecelerationRatio; // 0x0(0x0)
	float AecelerationRatio; // 0x0(0x0)
	char pad_EC[0x4]; // 0x0(0x0)
	struct TArray<enum class ESimpleMoveType> ExcludeMoveTypeContainer; // 0x0(0x0)
	char pad_100[0x8]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_NewCollision
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_NewCollision : UAnimNotifyState_Base {
	struct FName CollisionTag; // 0x0(0x0)
	bool bApplyEffect; // 0x0(0x0)
	char pad_51[0x3]; // 0x0(0x0)
	__int32 EffectEmitterID; // 0x0(0x0)
	struct TArray<__int32> EffectEmitterIDs; // 0x0(0x0)
	struct TArray<struct FCastEmitterCondition> ConditionEmitters; // 0x0(0x0)
	bool bUseGroup; // 0x0(0x0)
	char pad_79[0x3]; // 0x0(0x0)
	__int32 CollisionQueryTimes; // 0x0(0x0)
	enum class EANS_MarkSkillCastSuccessType MarkCastSuccessType; // 0x0(0x0)
	char pad_81[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_Niagara_AimHide
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_Niagara_AimHide : UAnimNotifyState_TimedNiagaraEffect {
};

 // Class /Script/Game.AnimNotifyState_ParametersChangeOnMat
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_ParametersChangeOnMat : UAnimNotifyState {
	char bUseForAllMat : 1; // 0x0(0x0)
	char bUseForAllMesh : 1; // 0x0(0x0)
	char pad_30_2 : 6; // 0x0(0x0)
	char pad_31[0x7]; // 0x0(0x0)
	struct TArray<__int32> Indexs; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveFloat*> FloatParameters; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveLinearColor*> ColorParameters; // 0x0(0x0)
	struct TMap<struct FName, float> EndFloatParameters; // 0x0(0x0)
	struct TMap<struct FName, struct FLinearColor> EndColorParameters; // 0x0(0x0)
	bool bReset; // 0x0(0x0)
	char pad_189[0x3]; // 0x0(0x0)
	float CurrentTime; // 0x0(0x0)
	float TotalTime; // 0x0(0x0)
	char pad_194[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_PauseLevelTime
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_PauseLevelTime : UAnimNotifyState {
};

 // Class /Script/Game.AnimNotifyState_PlayEffectActor
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_PlayEffectActor : UAnimNotifyState {
	struct FSoftClassPath EffectActorClassesPath; // 0x0(0x0)
	struct TArray<struct ACustomEffectActor*> EffectActors; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_PlayWwise
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_PlayWwise : UAnimNotifyState {
	struct FString EventName; // 0x0(0x0)
	char bAttached : 1; // 0x0(0x0)
	char pad_40_1 : 7; // 0x0(0x0)
	char pad_41[0x3]; // 0x0(0x0)
	struct FName SocketName; // 0x0(0x0)
	char pad_4C[0xC]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_PostProcess
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_PostProcess : UAnimNotifyState_Base {
	enum class EPostProcessType ProcessType; // 0x0(0x0)
	char pad_49[0x3]; // 0x0(0x0)
	struct FName Linker; // 0x0(0x0)
	char pad_54[0x4]; // 0x0(0x0)
	struct UPostProcessParams* Params; // 0x0(0x0)
	char pad_60[0x8]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_CharacterEffect
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_CharacterEffect : UAnimNotifyState_Base {
	bool bApplyStart; // 0x0(0x0)
	bool bApplyTick; // 0x0(0x0)
	bool bApplyEnd; // 0x0(0x0)
	char pad_4B[0x1]; // 0x0(0x0)
	struct FName EffectName; // 0x0(0x0)
	enum class ECharacterRenderStateType StateType; // 0x0(0x0)
	char pad_55[0x3]; // 0x0(0x0)
	struct FFlexibleEnumValue CharacterEffectType; // 0x0(0x0)
	__int32 Priority; // 0x0(0x0)
	__int32 Slot; // 0x0(0x0)
	bool bIgnoreTranslucent2Mask; // 0x0(0x0)
	char pad_65[0x3]; // 0x0(0x0)
	float OutlineBlendTime; // 0x0(0x0)
	bool bUseCustomDepth; // 0x0(0x0)
	bool bCustomDepth; // 0x0(0x0)
	bool bUseCustomStencil; // 0x0(0x0)
	char pad_6F[0x1]; // 0x0(0x0)
	__int32 CustomStencil; // 0x0(0x0)
	__int32 SecondarySlot; // 0x0(0x0)
	struct UMaterialInterface* SecondaryMaterial; // 0x0(0x0)
	struct UCurveFloat* Curve; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveFloat*> FloatParameters; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveLinearColor*> ColorParameters; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveVector*> VectorParameters; // 0x0(0x0)
	struct FMaterialStateParameter Parameters; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_CharacterEffect2
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_CharacterEffect2 : UAnimNotifyState {
	bool bApplyStart; // 0x0(0x0)
	bool bApplyTick; // 0x0(0x0)
	bool bApplyEnd; // 0x0(0x0)
	enum class ECharacterRenderStateType StateType; // 0x0(0x0)
	bool bUseCustomDepth; // 0x0(0x0)
	bool bCustomDepth; // 0x0(0x0)
	bool bUseCustomStencil; // 0x0(0x0)
	char pad_37[0x1]; // 0x0(0x0)
	__int32 CustomStencil; // 0x0(0x0)
	char pad_3C[0x4]; // 0x0(0x0)
	struct UCurveFloat* Curve; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveFloat*> FloatParameters; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveLinearColor*> ColorParameters; // 0x0(0x0)
	struct TMap<struct FName, struct UCurveVector*> VectorParameters; // 0x0(0x0)
	struct FMaterialStateParameter Parameters; // 0x0(0x0)
	char pad_178[0x18]; // 0x0(0x0)
};

 // Class /Script/Game.CustomAnimNotify_NiagaraSpeed
// Size: 0x0 (Inherited: 0x0)
struct UCustomAnimNotify_NiagaraSpeed : UAnimNotify_AbilityNotify {
	struct FString Tag; // 0x0(0x0)
	float Speed; // 0x0(0x0)
	char pad_64[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.CustomAnimNotify_UMGEffect
// Size: 0x0 (Inherited: 0x0)
struct UCustomAnimNotify_UMGEffect : UAnimNotifyState {
	struct UUserWidget* UMG; // 0x0(0x0)
	struct UUserWidget* Widget; // 0x0(0x0)
};

 // Class /Script/Game.CustomAnimNotify_CameraNearPlane
// Size: 0x0 (Inherited: 0x0)
struct UCustomAnimNotify_CameraNearPlane : UAnimNotifyState {
	float Value; // 0x0(0x0)
	char pad_34[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.CustomAnimNotify_CloseExponentialHeightFog
// Size: 0x0 (Inherited: 0x0)
struct UCustomAnimNotify_CloseExponentialHeightFog : UAnimNotifyState_Base {
};

 // Class /Script/Game.CustomAnimNotify_CallBlueprintEvent
// Size: 0x0 (Inherited: 0x0)
struct UCustomAnimNotify_CallBlueprintEvent : UAnimNotify {
	struct FString EventName; // 0x0(0x0)
	struct AActor* Class; // 0x0(0x0)
	bool bForceCall; // 0x0(0x0)
	char pad_51[0x7]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_PreReloading
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_PreReloading : UAnimNotifyState_Base {
	char pad_48[0x10]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_ReloadBullet
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_ReloadBullet : UAnimNotifyState_Base {
	__int32 BulletCount; // 0x0(0x0)
	float AheadCompleteTime; // 0x0(0x0)
	bool bLoopReload; // 0x0(0x0)
	char pad_51[0x17]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_Reloading
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_Reloading : UAnimNotifyState_Base {
	bool bStopAllowInterruptReload; // 0x0(0x0)
	char pad_49[0x3]; // 0x0(0x0)
	float CanStopReloadTime; // 0x0(0x0)
	bool bIsShotGun; // 0x0(0x0)
	char pad_51[0x3]; // 0x0(0x0)
	float CurrentReloadDuration; // 0x0(0x0)
	float ReloadTotalDuration; // 0x0(0x0)
	char pad_5C[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_ReloadState
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_ReloadState : UAnimNotifyState_Base {
};

 // Class /Script/Game.AnimNotifyState_RenewClip
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_RenewClip : UAnimNotifyState {
	char pad_30[0x8]; // 0x0(0x0)
	struct FName SocketName; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_SetBunkerExitTime
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_SetBunkerExitTime : UAnimNotifyState_Base {
	float ExitTime; // 0x0(0x0)
	char pad_4C[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_SetCollProfile
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_SetCollProfile : UAnimNotifyState_Base {
	struct FCollisionProfileName CollisionPresets; // 0x0(0x0)
	bool bEndReset; // 0x0(0x0)
	char pad_51[0x7]; // 0x0(0x0)
	struct FString NotifyName; // 0x0(0x0)
	char pad_68[0x28]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_SetSkeletonAimTargetLoc
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_SetSkeletonAimTargetLoc : UAnimNotifyState_Base {
	__int32 EmitterID; // 0x0(0x0)
	char pad_4C[0x14]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_SkillAimOffset
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_SkillAimOffset : UAnimNotifyState_Base {
	struct FSkillAimOffsetData CorrectionData; // 0x0(0x0)
	float fBlendOutTime; // 0x0(0x0)
	bool bUseSkillBlendOut; // 0x0(0x0)
	char pad_1A5[0x3]; // 0x0(0x0)
};

 // Class /Script/Game.AnimNotifyState_TargetWarping
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_TargetWarping : UAnimNotifyState {
	struct UMotionCurveModifier* MotionCurveModifier; // 0x0(0x0)
	bool bEnableMotionCurveNinjaMode; // 0x0(0x0)
	bool bLockPlayerMove; // 0x0(0x0)
	bool bLockPlayerControl; // 0x0(0x0)
	bool bLockPlayerFireAndAim; // 0x0(0x0)
	bool bMatchTargetLocationWhenNotifyEnd; // 0x0(0x0)
	char pad_3D[0x3]; // 0x0(0x0)

	void OnWarpUpdate(struct UTargetWarpingComponent* MotionWarpingComp, struct UMotionCurveModifier* Modifier); // Function /Script/Game.AnimNotifyState_TargetWarping.OnWarpUpdate // (Event|Public|BlueprintEvent|Const) // @ game+0
	void OnWarpEnd(struct UTargetWarpingComponent* MotionWarpingComp, struct UMotionCurveModifier* Modifier); // Function /Script/Game.AnimNotifyState_TargetWarping.OnWarpEnd // (Event|Public|BlueprintEvent|Const) // @ game+0
	void OnWarpBegin(struct UTargetWarpingComponent* MotionWarpingComp, struct UMotionCurveModifier* Modifier); // Function /Script/Game.AnimNotifyState_TargetWarping.OnWarpBegin // (Event|Public|BlueprintEvent|Const) // @ game+0
	void OnMotionCurveModifierUpdate(struct UTargetWarpingComponent* MotionWarpingComp, struct UMotionCurveModifier* Modifier, enum class EMotionCurveModifierState MotionCurveModifierState); // Function /Script/Game.AnimNotifyState_TargetWarping.OnMotionCurveModifierUpdate // (Final|Native|Public|Const) // @ game+0
	void OnMotionCurveModifierDeactivate(struct UTargetWarpingComponent* MotionWarpingComp, struct UMotionCurveModifier* Modifier, enum class EMotionCurveModifierState MotionCurveModifierState); // Function /Script/Game.AnimNotifyState_TargetWarping.OnMotionCurveModifierDeactivate // (Final|Native|Public|Const) // @ game+0
	void OnMotionCurveModifierActivate(struct UTargetWarpingComponent* MotionWarpingComp, struct UMotionCurveModifier* Modifier, enum class EMotionCurveModifierState MotionCurveModifierState); // Function /Script/Game.AnimNotifyState_TargetWarping.OnMotionCurveModifierActivate // (Final|Native|Public|Const) // @ game+0
	struct UMotionCurveModifier* AddMotionCurveModifier(struct UTargetWarpingComponent* MotionWarpingComp, struct UAnimSequenceBase* Animation, float StartTime, float EndTime); // Function /Script/Game.AnimNotifyState_TargetWarping.AddMotionCurveModifier // (Native|Event|Public|BlueprintEvent|Const) // @ game+0
};

 // Class /Script/Game.AnimNotifyState_WeaponReload
// Size: 0x0 (Inherited: 0x0)
struct UAnimNotifyState_WeaponReload : UAnimNotifyState_InterruptEmitter {
	float NotifyStateTotalDuration; // 0x0(0x0)
	float FrameTotalDuration; // 0x0(0x0)
	float NotifyStateThreshold; // 0x0(0x0)
	char pad_6C[0x4]; // 0x0(0x0)
};

 // Class /Script/Game.AutoPSO
// Size: 0x0 (Inherited: 0x0)
struct AAutoPSO : AActor {
	struct FMulticastInlineDelegate OnPSOStateChanged; // 0x0(0x0)
	struct UAutoPSOSubsystem* PSOSystem; // 0x0(0x0)
	__int32 MaxPreivewCount; // 0x0(0x0)
	char pad_23C[0x4]; // 0x0(0x0)
	struct AGamePlayerController* PlayerController; // 0x0(0x0)
	char pad_248[0x18]; // 0x0(0x0)
	struct AActor* ViewActor; // 0x0(0x0)
	struct AActor* ViewCastSkill; // 0x0(0x0)
	char pad_270[0x58]; // 0x0(0x0)

	bool Begin(); // Function /Script/Game.AutoPSO.Begin // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.AutoPSOSubsystem
// Size: 0x0 (Inherited: 0x0)
struct UAutoPSOSubsystem : UGameInstanceSubsystem {
	char pad_30[0x18]; // 0x0(0x0)
	struct FAutoPSOConfig Config; // 0x0(0x0)
	struct FAutoPSORuntime Runtime; // 0x0(0x0)
	char pad_88[0xC8]; // 0x0(0x0)

	void Stop(); // Function /Script/Game.AutoPSOSubsystem.Stop // (Final|Native|Public|BlueprintCallable) // @ game+0
	void Pause(bool InPause); // Function /Script/Game.AutoPSOSubsystem.Pause // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnMapReady(); // Function /Script/Game.AutoPSOSubsystem.OnMapReady // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnMapExit(); // Function /Script/Game.AutoPSOSubsystem.OnMapExit // (Final|Native|Public|BlueprintCallable) // @ game+0
	float GetCurrentPercent(); // Function /Script/Game.AutoPSOSubsystem.GetCurrentPercent // (Final|Native|Public|BlueprintCallable) // @ game+0
	void Begin(); // Function /Script/Game.AutoPSOSubsystem.Begin // (Final|Native|Public|BlueprintCallable) // @ game+0
	void AutoUploadPipelinecache(__int32 BuildNumber); // Function /Script/Game.AutoPSOSubsystem.AutoUploadPipelinecache // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.BalanceShow
// Size: 0x0 (Inherited: 0x0)
struct ABalanceShow : ACineCameraActor {
	char bActived : 1; // 0x0(0x0)
	char pad_810_1 : 7; // 0x0(0x0)
	char pad_811[0x7]; // 0x0(0x0)
	struct UGameCameraAnimMetaDataInfo* AnimationAsset; // 0x0(0x0)
	__int32 StartCameraIndex; // 0x0(0x0)
	__int32 EndCameraIndex; // 0x0(0x0)
	float DealyExhibitionTime; // 0x0(0x0)
	char pad_82C[0x14]; // 0x0(0x0)

	void StartBalanceShow(enum class ELevelFinishResult FinishResult); // Function /Script/Game.BalanceShow.StartBalanceShow // (Final|Native|Static|Public|BlueprintCallable) // @ game+0
	void ReceiveShowExhibition(); // Function /Script/Game.BalanceShow.ReceiveShowExhibition // (Event|Protected|BlueprintEvent|Const) // @ game+0
	void ReceiveSettlement(); // Function /Script/Game.BalanceShow.ReceiveSettlement // (Event|Protected|BlueprintEvent|Const) // @ game+0
	bool ReceiveActive(enum class ELevelFinishResult FinishResult); // Function /Script/Game.BalanceShow.ReceiveActive // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0
	struct USceneComponent* FindComponentByTag(struct FName Tag); // Function /Script/Game.BalanceShow.FindComponentByTag // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0
};

 // Class /Script/Game.BaseMovementComponent
// Size: 0x0 (Inherited: 0x0)
struct UBaseMovementComponent : UCharacterMovementComponent {
	struct UAbilityComponent* AbilityComponent; // 0x0(0x0)
	char bRunning : 1; // 0x0(0x0)
	char bEnableJump : 1; // 0x0(0x0)
	char pad_B08_2 : 6; // 0x0(0x0)
	char pad_B09[0x7]; // 0x0(0x0)
	struct FMulticastInlineDelegate OnRisingToFloating; // 0x0(0x0)
	struct FMulticastInlineDelegate OnFloatingToDown; // 0x0(0x0)
	char pad_B30[0x10]; // 0x0(0x0)
	enum class EAbnormalState CurrentAbnormalState; // 0x0(0x0)
	char pad_B41[0x7]; // 0x0(0x0)
	struct FAbnormalInfo CurrentStateInfo; // 0x0(0x0)
	char pad_BA0[0x20]; // 0x0(0x0)
	struct USkillMove* SkillMove; // 0x0(0x0)
	struct TArray<struct USkillMove*> SkillMove_Update; // 0x0(0x0)
	struct TArray<struct USkillMove*> DirtyMove; // 0x0(0x0)
	struct UAbnormalMove* AbnormalMove; // 0x0(0x0)
	float FrozenTime; // 0x0(0x0)
	char pad_BF4[0x4]; // 0x0(0x0)
	struct UCurveFloat* FrozenCurve; // 0x0(0x0)
	struct FVector LastCurveMoveVolocity; // 0x0(0x0)
	struct FVector AdditiveVelocity; // 0x0(0x0)
	struct URepelAbnormalMove* RepelAbnormal; // 0x0(0x0)
	struct UFloatingAbnormalMove* FloatingAbnormal; // 0x0(0x0)
	char pad_C28[0x1]; // 0x0(0x0)
	char bDisableVectorProjectWhenBlock : 1; // 0x0(0x0)
	char pad_C29_1 : 7; // 0x0(0x0)
	char pad_C2A[0x2]; // 0x0(0x0)
	float MoveBlockVectorProjectMinFactor; // 0x0(0x0)
	float TargetFramerate; // 0x0(0x0)
	char pad_C34[0xC]; // 0x0(0x0)

	void SetVectorProjectWhenBlockEnabled(bool bEnabled); // Function /Script/Game.BaseMovementComponent.SetVectorProjectWhenBlockEnabled // (Native|Public|BlueprintCallable) // @ game+0
	void SetCurrentSkillMove(struct USkillMove* NewSkillMove); // Function /Script/Game.BaseMovementComponent.SetCurrentSkillMove // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetCurrentAbnormalState(enum class EAbnormalState NewState, bool bForceRemove); // Function /Script/Game.BaseMovementComponent.SetCurrentAbnormalState // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ResetMaxSpeed(); // Function /Script/Game.BaseMovementComponent.ResetMaxSpeed // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveUpdateSkillMove(struct USkillMove* InvalidSkillMove); // Function /Script/Game.BaseMovementComponent.RemoveUpdateSkillMove // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnAbnormalUpdate(struct FAbnormalInfo& StateInfo, bool bAdd, bool bNewApply, bool bForceRemove); // Function /Script/Game.BaseMovementComponent.OnAbnormalUpdate // (Final|Native|Public|HasOutParms) // @ game+0
	void MoveBlock(struct FHitResult& HitResult); // Function /Script/Game.BaseMovementComponent.MoveBlock // (Final|Native|Public|HasOutParms) // @ game+0
	void ModifyMaxSpeed(float Value); // Function /Script/Game.BaseMovementComponent.ModifyMaxSpeed // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ModifyMaxRotationRate(float Pitch, float Yaw, float Roll); // Function /Script/Game.BaseMovementComponent.ModifyMaxRotationRate // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FRotator K2_GetDeltaRotation(float DeltaTime); // Function /Script/Game.BaseMovementComponent.K2_GetDeltaRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0
	float K2_GetCharacterMaxSpeed(); // Function /Script/Game.BaseMovementComponent.K2_GetCharacterMaxSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInSkillMove(); // Function /Script/Game.BaseMovementComponent.IsInSkillMove // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsInAnimMotionState(); // Function /Script/Game.BaseMovementComponent.IsInAnimMotionState // (Final|Native|Public) // @ game+0
	bool GetMoveStatus(float& OutDirection); // Function /Script/Game.BaseMovementComponent.GetMoveStatus // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool GetIsCurveMotionState(); // Function /Script/Game.BaseMovementComponent.GetIsCurveMotionState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct USkillMove* GetCurrentSkillMove(); // Function /Script/Game.BaseMovementComponent.GetCurrentSkillMove // (Final|Native|Public|BlueprintCallable) // @ game+0
	void GetAbnormalInfo(struct FAbnormalInfo& Info); // Function /Script/Game.BaseMovementComponent.GetAbnormalInfo // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0
	void CreatSkillMoveByMagic(struct FVector TargetLocation, struct AActor* Goal, struct AGameCharacter* Target, struct FMagicParameter& Info, struct UModifier* ModifierRef, struct FString SkillMoveName); // Function /Script/Game.BaseMovementComponent.CreatSkillMoveByMagic // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0
	void CreateSkillMoveByMagic_Multi(struct FVector TargetLocation, struct AActor* Goal, __int32 ModifierRunTimeID, struct FMagicParameter Info, struct FString SkillMoveName, unsigned __int32 InUniqueID); // Function /Script/Game.BaseMovementComponent.CreateSkillMoveByMagic_Multi // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0
	void CreateSkillMove_Multi(struct FQueryResult Target, __int32 EmitterID, float EmitterMontageDurationTime, struct FString SkillMoveName, unsigned __int32 InUniqueID); // Function /Script/Game.BaseMovementComponent.CreateSkillMove_Multi // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void CreateSkillMove(struct FQueryResult& Target, struct USkillEmitter* EmitterOwner, __int32 EmitterID, float EmitterMontageDurationTime, struct FString SkillMoveName); // Function /Script/Game.BaseMovementComponent.CreateSkillMove // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void CancleSkillMoveByModifier(__int32 ModifierRunTimeID); // Function /Script/Game.BaseMovementComponent.CancleSkillMoveByModifier // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void CancleCurrentSkillMove_Multi(unsigned __int32 InSkillMoveUniqueID); // Function /Script/Game.BaseMovementComponent.CancleCurrentSkillMove_Multi // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void CancleCurrentSkillMove(struct USkillMove* RemoveMove); // Function /Script/Game.BaseMovementComponent.CancleCurrentSkillMove // (Final|Native|Public|BlueprintCallable) // @ game+0
	void CancelAllSkillMove(); // Function /Script/Game.BaseMovementComponent.CancelAllSkillMove // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void AddUpdateSkillMove(struct USkillMove* NewSkillMove); // Function /Script/Game.BaseMovementComponent.AddUpdateSkillMove // (Final|Native|Public|BlueprintCallable) // @ game+0
};

 // Class /Script/Game.GameCharacter
// Size: 0x0 (Inherited: 0x0)
struct AGameCharacter : ACharacter {
	char pad_4C0[0x18]; // 0x0(0x0)
	struct UAbilityComponent* Ability; // 0x0(0x0)
	struct UAIControlDataComponent* AIControlData; // 0x0(0x0)
	struct UCharacterRenderComponent* CharacterRenderComponent; // 0x0(0x0)
	struct UUMGDataComponent* UMGDataComponent; // 0x0(0x0)
	struct UAbnormalComponent* AbnormalComponent; // 0x0(0x0)
	struct UPauseFrameComponent* PauseFrameComponent; // 0x0(0x0)
	enum class ECharacterType Type; // 0x0(0x0)
	enum class ESummonType SummonType; // 0x0(0x0)
	char Camp; // 0x0(0x0)
	char Level; // 0x0(0x0)
	__int32 AreaId; // 0x0(0x0)
	char bIsCaptain : 1; // 0x0(0x0)
	char pad_510_1 : 7; // 0x0(0x0)
	char pad_511[0x7]; // 0x0(0x0)
	struct TMap<__int32, __int32> SpineNodeSkillIdAndLevel; // 0x0(0x0)
	__int32 PatrolIndex; // 0x0(0x0)
	char pad_56C[0x4]; // 0x0(0x0)
	struct TArray<struct TWeakObjectPtr<struct AGameCharacter>> AllSummoned; // 0x0(0x0)
	struct TWeakObjectPtr<struct AGameCharacter> SummonedOwner; // 0x0(0x0)
	struct FRuntimeEASInfo SummonedRuntimeEASInfo; // 0x0(0x0)
	struct TWeakObjectPtr<struct AController> SummonedOwnerController; // 0x0(0x0)
	char pad_5AC[0x4]; // 0x0(0x0)
	struct AGamePlayerController* CharacterController; // 0x0(0x0)
	char pad_5B8[0x8]; // 0x0(0x0)
	struct FTransform SpawnTransform; // 0x0(0x0)
	bool bIgnore; // 0x0(0x0)
	char pad_5F1[0x7]; // 0x0(0x0)
	struct TArray<struct TWeakObjectPtr<struct ACharacterAccessory>> CharacterAccessories; // 0x0(0x0)
	enum class ECharacterCameraFade CameraFadeType; // 0x0(0x0)
	char pad_609[0x7]; // 0x0(0x0)
	__int64 TemplateId; // 0x0(0x0)
	__int64 CharacterCardID; // 0x0(0x0)
	char pad_620[0x10]; // 0x0(0x0)
	struct UCharacterCard* PlayerLineupMember; // 0x0(0x0)
	char pad_638[0x8]; // 0x0(0x0)
	struct USkeletalMesh* OriginSkeletal; // 0x0(0x0)
	struct USMStateMachineComponent* CharacterStateMachineClass; // 0x0(0x0)
	struct USMStateMachineComponent* CharacterStateMachine; // 0x0(0x0)
	struct UCharacterMovementComponent* CharacterMovementClass; // 0x0(0x0)
	bool bOptimizeNavWalk; // 0x0(0x0)
	char pad_661[0x7]; // 0x0(0x0)
	struct AAbilityCollisionEditor* AbilityCollisionExhibition; // 0x0(0x0)
	struct TArray<struct USceneComponent*> AllDamageComponents; // 0x0(0x0)
	struct FMulticastInlineDelegate OnMoveBlockBy; // 0x0(0x0)
	struct FMulticastInlineDelegate OnAbilityCollisionEditorNotifyEnter; // 0x0(0x0)
	struct TArray<struct APlayerWeapon*> AllPlayerWeapons; // 0x0(0x0)
	struct APlayerWeapon* PlayerWeapon; // 0x0(0x0)
	bool bWeaponHiddenInGame; // 0x0(0x0)
	char pad_6B9[0x3]; // 0x0(0x0)
	unsigned __int32 ActorHiddenType; // 0x0(0x0)
	float DodgeYawThreshold; // 0x0(0x0)
	char bInHalfSkillMontage : 1; // 0x0(0x0)
	char pad_6C4_1 : 7; // 0x0(0x0)
	char DodgeAnimationId; // 0x0(0x0)
	char pad_6C6[0x2]; // 0x0(0x0)
	float DodgeDesiredYaw; // 0x0(0x0)
	char pad_6CC[0x24]; // 0x0(0x0)
	struct FTransform AbnormalEffectOffset; // 0x0(0x0)
	float PreFireTime; // 0x0(0x0)
	float CurrentPreFireTime; // 0x0(0x0)
	char pad_728[0x4]; // 0x0(0x0)
	float AimingShootRange; // 0x0(0x0)
	float NormalShootRange; // 0x0(0x0)
	char pad_734[0x4]; // 0x0(0x0)
	struct TMap<enum class ERangeAttackState, struct UHitReactData*> HitReactionDataContainer; // 0x0(0x0)
	struct UAttributeAbnormalReactData* AttributeAbnormalReactData; // 0x0(0x0)
	struct UAbnormalReactData* AbnormalReactData; // 0x0(0x0)
	bool bCloseAnimOptimizations; // 0x0(0x0)
	char pad_799[0x3]; // 0x0(0x0)
	struct FPawnViewData PawnViewData; // 0x0(0x0)
	char pad_7B4[0x4]; // 0x0(0x0)
	struct TArray<struct FPawnViewData> PawnViewDataList; // 0x0(0x0)
	struct USpringArmComponent* SpringArmComponent; // 0x0(0x0)
	struct USceneComponent* AssistTargetComponent; // 0x0(0x0)
	char pad_7D8[0x1]; // 0x0(0x0)
	char bBlockCheckTarget : 1; // 0x0(0x0)
	char bIsAttacked : 1; // 0x0(0x0)
	char pad_7D9_2 : 6; // 0x0(0x0)
	char pad_7DA[0x2]; // 0x0(0x0)
	float EnterSwitchTime; // 0x0(0x0)
	float LeaveSwitchTime; // 0x0(0x0)
	char pad_7E4[0x4]; // 0x0(0x0)
	struct FMulticastInlineDelegate StageBreakProgress; // 0x0(0x0)
	struct FMulticastInlineDelegate OnFinishSwitchCharacter; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyPlayerActionFlay; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyPlayerMoveState; // 0x0(0x0)
	struct FMulticastInlineDelegate OnCameraMove; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyEquipedWeapon; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifySummon; // 0x0(0x0)
	struct FMulticastInlineDelegate OnNotifyTriggerAvoid; // 0x0(0x0)
	struct FMulticastInlineDelegate OnPickupDrop; // 0x0(0x0)
	struct FMulticastInlineDelegate OnMoveStepEvent; // 0x0(0x0)
	struct FMulticastInlineDelegate OnDoHitReaction; // 0x0(0x0)
	__int32 HitSoundEvent; // 0x0(0x0)
	__int32 HitWeaknessSoundEvent; // 0x0(0x0)
	struct TMap<enum class EModifyHPResult, __int32> SoundEventMap; // 0x0(0x0)
	__int32 KilledSoundEvent; // 0x0(0x0)
	float CurrentTimeDilation; // 0x0(0x0)
	struct TArray<struct UObject*> TimeDilationSources; // 0x0(0x0)
	struct TArray<struct USkeletalMeshComponent*> AllMesh; // 0x0(0x0)
	struct TArray<struct USkeletalMeshComponent*> NonePartitionSkeletalComp; // 0x0(0x0)
	struct TArray<struct USkeletalMeshComponent*> PartitionSkeletalComp; // 0x0(0x0)
	struct TArray<struct UBonePartitionBaseData*> PartitionDatas; // 0x0(0x0)
	struct TArray<struct FScaredCrowPartitionData> ScaredCrowPartitions; // 0x0(0x0)
	struct UBonePartitionBaseData* MainMeshPartitionData; // 0x0(0x0)
	float UseReviveCoinTime; // 0x0(0x0)
	char pad_964[0x4]; // 0x0(0x0)
	struct TMap<struct FString, struct UCurveSequence_PhysicalRecoilAnimation*> RecoilCurveSequencePhyContainer; // 0x0(0x0)
	struct TMap<struct FString, struct UCurveSequence_RecoilAnimation*> RecoilCurveSequenceContainer; // 0x0(0x0)
	struct TMap<struct FString, struct FRecoilSetup> HitsSetup; // 0x0(0x0)
	char pad_A58[0x80]; // 0x0(0x0)
	struct AActor* MeshActor; // 0x0(0x0)
	char CollisionMask; // 0x0(0x0)
	char MoveIgnoreCollisionMask; // 0x0(0x0)
	char pad_AE2[0xE]; // 0x0(0x0)

	void UpdateTips(enum class EFightMonsterTipsType InTipsType, bool Inactive); // Function /Script/Game.GameCharacter.UpdateTips // (Final|Native|Protected) // @ game+0
	void TryReaction_AttributeAbnormal(enum class EAttributeAbnormalState InAttributeAbnormalState); // Function /Script/Game.GameCharacter.TryReaction_AttributeAbnormal // (Final|Native|Public|BlueprintCallable) // @ game+0
	void StopAnimation(); // Function /Script/Game.GameCharacter.StopAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0
	void StartAnimation(); // Function /Script/Game.GameCharacter.StartAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0
	void Spwaned(); // Function /Script/Game.GameCharacter.Spwaned // (Native|Event|Public|BlueprintEvent) // @ game+0
	void ShowFightTip(__int32 TipType, struct FString Message, bool bShowUIAnim); // Function /Script/Game.GameCharacter.ShowFightTip // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetWeaponState(enum class EWeaponState WeaponState); // Function /Script/Game.GameCharacter.SetWeaponState // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetWeaponHiddenInGame(bool bHiddenInGame); // Function /Script/Game.GameCharacter.SetWeaponHiddenInGame // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetWeapon(struct APlayerWeapon* lpPlayerWeapon); // Function /Script/Game.GameCharacter.SetWeapon // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void SetupComponents(); // Function /Script/Game.GameCharacter.SetupComponents // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetTempSkeletalMesh(struct FString SkeletalMeshPath, struct FString HeadMeshPath); // Function /Script/Game.GameCharacter.SetTempSkeletalMesh // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	bool SetStateEventId2(char StateMachineIdx, char EventId); // Function /Script/Game.GameCharacter.SetStateEventId2 // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool SetStateEventId(char StateMachineIdx, char EventId, bool bResetOwner); // Function /Script/Game.GameCharacter.SetStateEventId // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetRootMotionMode(enum class ERootMotionMode Value); // Function /Script/Game.GameCharacter.SetRootMotionMode // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetInHalfSkillMontage(bool bInHalfSkill); // Function /Script/Game.GameCharacter.SetInHalfSkillMontage // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetGrowAttributeID(__int32 nGrowAttributeID); // Function /Script/Game.GameCharacter.SetGrowAttributeID // (Native|Public|BlueprintCallable) // @ game+0
	void SetDodgeDirection(); // Function /Script/Game.GameCharacter.SetDodgeDirection // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetCharacterController(struct AGamePlayerController* InController); // Function /Script/Game.GameCharacter.SetCharacterController // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetCanAsAITarget(bool InbCanAsAITarget); // Function /Script/Game.GameCharacter.SetCanAsAITarget // (Final|Native|Public|BlueprintCallable) // @ game+0
	void SetAttrackEnmityEnable(bool bEnable); // Function /Script/Game.GameCharacter.SetAttrackEnmityEnable // (Final|Native|Public|BlueprintCallable) // @ game+0
	void ServerSetDodgeInfo(char nDodgeAnimationId, float fDodgeDesiredYaw); // Function /Script/Game.GameCharacter.ServerSetDodgeInfo // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0
	void Server_DebugKillTeamMember(); // Function /Script/Game.GameCharacter.Server_DebugKillTeamMember // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void Server_DebugKillSelf(); // Function /Script/Game.GameCharacter.Server_DebugKillSelf // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void Server_DebugKillAllEnemy(); // Function /Script/Game.GameCharacter.Server_DebugKillAllEnemy // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0
	void ResetSkeletalMesh(); // Function /Script/Game.GameCharacter.ResetSkeletalMesh // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void ResetCurrentPreFireTime(); // Function /Script/Game.GameCharacter.ResetCurrentPreFireTime // (Final|Native|Public|BlueprintCallable) // @ game+0
	void RemoveAccessory(struct ACharacterAccessory* InAcc); // Function /Script/Game.GameCharacter.RemoveAccessory // (Native|Public|BlueprintCallable) // @ game+0
	void ReceiveSkillStart(bool bHalfSkill, bool bHalfSkillInAim); // Function /Script/Game.GameCharacter.ReceiveSkillStart // (Event|Public|BlueprintEvent) // @ game+0
	void ReceiveSkillEnd(bool bHalfSkill, bool bHalfSkillInAim); // Function /Script/Game.GameCharacter.ReceiveSkillEnd // (Event|Public|BlueprintEvent) // @ game+0
	bool ReceiveIsAllowAimed(struct AGameCharacter* CurrentInstigator); // Function /Script/Game.GameCharacter.ReceiveIsAllowAimed // (Event|Protected|BlueprintEvent|Const) // @ game+0
	void ReceiveHitAction(struct FHitResult& Hit); // Function /Script/Game.GameCharacter.ReceiveHitAction // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0
	float RecalcAttributeValue(struct UAbilityAttribute* AbilityAttribute, float CurrentValue, char CurrentLevel, bool bInverted); // Function /Script/Game.GameCharacter.RecalcAttributeValue // (Native|Public|BlueprintCallable) // @ game+0
	void PostEventAttachedActor(struct FString InEventName); // Function /Script/Game.GameCharacter.PostEventAttachedActor // (Net|Native|Event|NetMulticast|Public|BlueprintCallable) // @ game+0
	void PlayerExitBunkerInteract(); // Function /Script/Game.GameCharacter.PlayerExitBunkerInteract // (Final|Native|Public|BlueprintCallable) // @ game+0
	void PlayerEnterBunkerInteract(); // Function /Script/Game.GameCharacter.PlayerEnterBunkerInteract // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OpenHighLightBorder(); // Function /Script/Game.GameCharacter.OpenHighLightBorder // (Final|Native|Public|BlueprintCallable) // @ game+0
	void OnTakeDamage(struct FApplyDamageResultData& DamageResultData); // Function /Script/Game.GameCharacter.OnTakeDamage // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0
	void OnSwitchLeave(struct FTransform& Trans); // Function /Script/Game.GameCharacter.OnSwitchLeave // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0
	void OnSwitchEnter(struct FTransform& Trans); // Function /Script/Game.GameCharacter.OnSwitchEnter // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0
	void OnRep_UseReviveCoinTime(); // Function /Script/Game.GameCharacter.OnRep_UseReviveCoinTime // (Final|Native|Protected) // @ game+0
	void OnRep_TimeDilation(); // Function /Script/Game.GameCharacter.OnRep_TimeDilation // (Final|Native|Private) // @ game+0
	void OnRep_SetTemplateId(); // Function /Script/Game.GameCharacter.OnRep_SetTemplateId // (Final|Native|Public) // @ game+0
	void OnRep_SetInHalfSkillMontage(); // Function /Script/Game.GameCharacter.OnRep_SetInHalfSkillMontage // (Final|Native|Public) // @ game+0
	void OnRep_SetCharacterCardId(); // Function /Script/Game.GameCharacter.OnRep_SetCharacterCardId // (Final|Native|Public) // @ game+0
	void OnRep_CharacterAccessories(); // Function /Script/Game.GameCharacter.OnRep_CharacterAccessories // (Final|Native|Public) // @ game+0
	void OnMoveStep(); // Function /Script/Game.GameCharacter.OnMoveStep // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool OnLifeSpanExpired(); // Function /Script/Game.GameCharacter.OnLifeSpanExpired // (Native|Event|Protected|BlueprintEvent) // @ game+0
	void OnKill(struct AGameCharacter* BeKilledCharacter); // Function /Script/Game.GameCharacter.OnKill // (Native|Event|Protected|BlueprintEvent) // @ game+0
	void OnDie(struct AGameCharacter* Who, struct AGameCharacter* Killer, struct FHealthChangeValue& HealthChangeValue); // Function /Script/Game.GameCharacter.OnDie // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0
	void NotifyFightUmgTips(bool Inactive); // Function /Script/Game.GameCharacter.NotifyFightUmgTips // (Native|Public|BlueprintCallable) // @ game+0
	void NotifyFightTipsFirstAdd(); // Function /Script/Game.GameCharacter.NotifyFightTipsFirstAdd // (Net|Native|Event|NetMulticast|Public) // @ game+0
	void Multicast_SwitchLeave(); // Function /Script/Game.GameCharacter.Multicast_SwitchLeave // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	void Multicast_SwitchEnter(); // Function /Script/Game.GameCharacter.Multicast_SwitchEnter // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0
	bool K2_IsFalling(); // Function /Script/Game.GameCharacter.K2_IsFalling // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct UCharacterCard* K2_GetPlayerMember(); // Function /Script/Game.GameCharacter.K2_GetPlayerMember // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FBoneResult K2_GetPartitionMainPart(struct FString PartitionName); // Function /Script/Game.GameCharacter.K2_GetPartitionMainPart // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct FBoneResult K2_GetPartitionMainBone(struct FString PartitionName); // Function /Script/Game.GameCharacter.K2_GetPartitionMainBone // (Final|Native|Public|BlueprintCallable) // @ game+0
	struct TArray<struct AGameCharacter*> K2_GetCachedGameCharacters(); // Function /Script/Game.GameCharacter.K2_GetCachedGameCharacters // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool IsVehicle(); // Function /Script/Game.GameCharacter.IsVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsTrap(); // Function /Script/Game.GameCharacter.IsTrap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsSummon(); // Function /Script/Game.GameCharacter.IsSummon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsSpecialized(); // Function /Script/Game.GameCharacter.IsSpecialized // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsQTECharacter(); // Function /Script/Game.GameCharacter.IsQTECharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0
	bool IsPlayerNpc(); // Function /Script/Game.GameCharacter.IsPlayerNpc // (Native|Event|Public|BlueprintEvent) // @ game+0
	bool IsPlayer(); // Function /Script/Game.GameCharacter.IsPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsOptimizeNavWalk(); // Function /Script/Game.GameCharacter.IsOptimizeNavWalk // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool IsInSwitch(); // Function /Script/Game.GameCharacter.IsInSwitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInRush(); // Function /Script/Game.GameCharacter.IsInRush // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInIdle(); // Function /Script/Game.GameCharacter.IsInIdle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInHalfSkillMontage(); // Function /Script/Game.GameCharacter.IsInHalfSkillMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInFire(); // Function /Script/Game.GameCharacter.IsInFire // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsInAim(); // Function /Script/Game.GameCharacter.IsInAim // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsHostage(); // Function /Script/Game.GameCharacter.IsHostage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsDestructible(); // Function /Script/Game.GameCharacter.IsDestructible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsDead(); // Function /Script/Game.GameCharacter.IsDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsCurrentCharacter(); // Function /Script/Game.GameCharacter.IsCurrentCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsBunker(); // Function /Script/Game.GameCharacter.IsBunker // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsAlive(); // Function /Script/Game.GameCharacter.IsAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsAI(); // Function /Script/Game.GameCharacter.IsAI // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsAdvancedAction(); // Function /Script/Game.GameCharacter.IsAdvancedAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	bool IsAbnormalStateIgnore(enum class EAbnormalState State); // Function /Script/Game.GameCharacter.IsAbnormalStateIgnore // (Final|Native|Public|BlueprintCallable) // @ game+0
	bool HasRelation(struct AActor* InTarget, __int32 RelationMask); // Function /Script/Game.GameCharacter.HasRelation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct APlayerWeapon* GetWeapon(); // Function /Script/Game.GameCharacter.GetWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0
	struct TArray<struct FQueryResult> GetWeaknessPartsResults(bool bFindScaredCrow); // Function /Script/Game.GameCharacter.GetWeaknessPartsResults // (Final|Native|Public|BlueprintCallable) // @ game+0
